<!DOCTYPE html>
<!--[if lt IE 7]> <html class="ie6 ie"> <![endif]-->
<!--[if IE 7]>    <html class="ie7 ie"> <![endif]-->
<!--[if IE 8]>    <html class="ie8 ie"> <![endif]-->
<!--[if IE 9]>    <html class="ie9 ie"> <![endif]-->
<!--[if !IE]> --> <html> <!-- <![endif]-->

<!-- Mirrored from seop.illc.uva.nl/entries/al-farabi-metaphysics/ by HTTrack Website Copier/3.x [XR&CO'2014], Wed, 22 Jun 2022 19:37:24 GMT -->
<head>
<meta name="viewport" content="width=device-width, initial-scale=1.0" />
<title>
al-Farabi’s Metaphysics (Stanford Encyclopedia of Philosophy)
</title>
<meta http-equiv="Content-Type" content="text/html; charset=utf-8" />
<meta name="robots" content="noarchive, noodp" />
<meta property="citation_title" content="al-Farabi’s Metaphysics" />
<meta property="citation_author" content="Menn, Stephen" />
<meta property="citation_publication_date" content="2021/11/22" />
<meta name="DC.title" content="al-Farabi’s Metaphysics" />
<meta name="DC.creator" content="Menn, Stephen" />
<meta name="DCTERMS.issued" content="2021-11-22" />
<meta name="DCTERMS.modified" content="2021-11-22" />

<!-- NOTE: Import webfonts using this link: -->
<link href="https://fonts.googleapis.com/css?family=Source+Sans+Pro:400,300,600,200&amp;subset=latin,latin-ext" rel="stylesheet" type="text/css" />

<link rel="stylesheet" type="text/css" media="screen,handheld" href="../../css/bootstrap.min.css" />
<link rel="stylesheet" type="text/css" media="screen,handheld" href="../../css/bootstrap-responsive.min.css" />
<link rel="stylesheet" type="text/css" href="../../css/font-awesome.min.css" />
<!--[if IE 7]> <link rel="stylesheet" type="text/css" href="../../css/font-awesome-ie7.min.css"> <![endif]-->
<link rel="stylesheet" type="text/css" media="screen,handheld" href="../../css/style.css" />
<link rel="stylesheet" type="text/css" media="print" href="../../css/print.css" />
<link rel="stylesheet" type="text/css" href="../../css/entry.css" />
<!--[if IE]> <link rel="stylesheet" type="text/css" href="../../css/ie.css" /> <![endif]-->
<script type="text/javascript" src="../../js/jquery-1.9.1.min.js"></script>
<script type="text/javascript" src="../../js/bootstrap.min.js"></script>

<!-- NOTE: Javascript for sticky behavior needed on article and ToC pages -->
<script type="text/javascript" src="../../js/jquery-scrolltofixed-min.js"></script>
<script type="text/javascript" src="../../js/entry.js"></script>

<!-- SEP custom script -->
<script type="text/javascript" src="../../js/sep.js"></script>
</head>

<!-- NOTE: The nojs class is removed from the page if javascript is enabled. Otherwise, it drives the display when there is no javascript. -->
<body class="nojs article" id="pagetopright">
<div id="container">
<div id="header-wrapper">
  <div id="header">
    <div id="branding">
      <div id="site-logo"><a href="../../index.html"><img src="../../symbols/sep-man-red.png" alt="SEP logo" /></a></div>
      <div id="site-title"><a href="../../index.html">Stanford Encyclopedia of Philosophy</a></div>
    </div>
    <div id="navigation">
      <div class="navbar">
        <div class="navbar-inner">
          <div class="container">
            <button class="btn btn-navbar collapsed" data-target=".collapse-main-menu" data-toggle="collapse" type="button"> <i class="icon-reorder"></i> Menu </button>
            <div class="nav-collapse collapse-main-menu in collapse">
              <ul class="nav">
                <li class="dropdown open"><a id="drop1" href="#" class="dropdown-toggle" data-toggle="dropdown" role="button"><i class="icon-book"></i> Browse</a>
                  <ul class="dropdown-menu" role="menu" aria-labelledby="drop1">
                    <li><a href="../../contents.html">Table of Contents</a></li>
                    <li><a href="../../new.html">What's New</a></li>
                    <li><a href="https://plato.stanford.edu/cgi-bin/encyclopedia/random">Random Entry</a></li>
                    <li><a href="../../published.html">Chronological</a></li>
                    <li><a href="../../archives/index.html">Archives</a></li>
                  </ul>
                </li>
                <li class="dropdown open"><a id="drop2" href="#" class="dropdown-toggle" data-toggle="dropdown" role="button"><i class="icon-info-sign"></i> About</a>
                  <ul class="dropdown-menu" role="menu" aria-labelledby="drop2">
                    <li><a href="../../info.html">Editorial Information</a></li>
                    <li><a href="../../about.html">About the SEP</a></li>
                    <li><a href="../../board.html">Editorial Board</a></li>
                    <li><a href="../../cite.html">How to Cite the SEP</a></li>
                    <li><a href="../../special-characters.html">Special Characters</a></li>
                    <li><a href="../../tools/index.html">Advanced Tools</a></li>
                    <li><a href="../../contact.html">Contact</a></li>
                  </ul>
                </li>
                <li class="dropdown open"><a id="drop3" href="#" class="dropdown-toggle" data-toggle="dropdown" role="button"><i class="icon-leaf"></i> Support SEP</a>
                  <ul class="dropdown-menu" role="menu" aria-labelledby="drop3">
                    <li><a href="../../support/index.html">Support the SEP</a></li>
                    <li><a href="../../support/friends.html">PDFs for SEP Friends</a></li>
                    <li><a href="../../support/donate.html">Make a Donation</a></li>
                    <li><a href="../../support/sepia.html">SEPIA for Libraries</a></li>
                  </ul>
                </li>
              </ul>
            </div>
          </div>
        </div>
      </div>
    </div>
    <!-- End navigation -->
    
    <div id="search">
      <form id="search-form" method="get" action="https://seop.illc.uva.nl/search/searcher.py">
        <input type="search" name="query" placeholder="Search SEP" />
        <div class="search-btn-wrapper"><button class="btn search-btn" type="submit"><i class="icon-search"></i></button></div>
      </form>
    </div>
    <!-- End search --> 
    
  </div>
  <!-- End header --> 
</div>
<!-- End header wrapper -->

<div id="content">

<!-- Begin article sidebar -->
<div id="article-sidebar" class="sticky">
  <div class="navbar">
    <div class="navbar-inner">
      <div class="container">
        <button class="btn btn-navbar" data-target=".collapse-sidebar" data-toggle="collapse" type="button"> <i class="icon-reorder"></i> Entry Navigation </button>
        <div id="article-nav" class="nav-collapse collapse-sidebar in collapse">
          <ul class="nav">
            <li><a href="#toc">Entry Contents</a></li>
            <li><a href="#Bib">Bibliography</a></li>
            <li><a href="#Aca">Academic Tools</a></li>
            <li><a href="https://leibniz.stanford.edu/friends/preview/al-farabi-metaphysics/">Friends PDF Preview <i class="icon-external-link"></i></a></li>
            <li><a href="https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=al-farabi-metaphysics">Author and Citation Info <i class="icon-external-link"></i></a> </li>
            <li><a href="#pagetopright" class="back-to-top">Back to Top <i class="icon-angle-up icon2x"></i></a></li>
          </ul>
        </div>
      </div>
    </div>
  </div>
</div>
<!-- End article sidebar --> 

<!-- NOTE: Article content must have two wrapper divs: id="article" and id="article-content" -->
<div id="article">
<div id="article-content">

<!-- BEGIN ARTICLE HTML -->


<div id="aueditable"><!--DO NOT MODIFY THIS LINE AND ABOVE-->

<h1>al-Farabi&rsquo;s Metaphysics</h1><div id="pubinfo"><em>First published Mon Nov 22, 2021</em></div>

<div id="preamble">

<p>
&ldquo;Al-F&acirc;r&acirc;b&icirc;&rsquo;s metaphysics&rdquo;, as
understood here, means not just his views, and arguments for those
views, on a series of metaphysical topics, but his project of
reconstructing and reviving metaphysics as a science. This is part of
his larger project of reconstructing and reviving &ldquo;the sciences
of the ancients&rdquo;: his scientific project in metaphysics is
inseparable from his interpretation and assimilation of
Aristotle&rsquo;s <em>Metaphysics</em>. We start with some motivation
for F&acirc;r&acirc;b&icirc;&rsquo;s larger project of reconstructing
&ldquo;the sciences of the ancients&rdquo;, then turn to what he says
about metaphysics as one such science and about Aristotle&rsquo;s
<em>Metaphysics</em>, and then to details of his reconstruction of
metaphysics as a science, both in his account of maximally universal
concepts such as being and unity, and in his account of God as the
first cause of existence.</p>
</div> 

<div id="toc">

<!--Entry Contents-->
<ul>
<li><a href="#FaraProjReviScieAnci">1. F&acirc;r&acirc;b&icirc;&rsquo;s project of reviving the sciences of the ancients</a></li>
<li><a href="#FaraMetaScieArisMeta">2. F&acirc;r&acirc;b&icirc; on metaphysics as a science and Aristotle&rsquo;s <em>Metaphysics</em></a></li>
<li><a href="#FaraOntoBookLettOneUnit">3. F&acirc;r&acirc;b&icirc;&rsquo;s ontology: the <em>Book of Letters</em> and <em>On the One and Unity</em></a>
	<ul>
	<li><a href="#FaraProjBookLett">3.1 F&acirc;r&acirc;b&icirc;&rsquo;s project in the <em>Book of Letters</em></a></li>
	<li><a href="#LogiGramFormRolePart">3.2 Logical and grammatical form, and the role of particles</a></li>
	<li><a href="#FaraWordForBeinGreeArab">3.3 F&acirc;r&acirc;b&icirc; on the word for being, in Greek and Arabic</a></li>
	<li><a href="#FaraSensBeinMawjCorrSensExisWuju">3.4 F&acirc;r&acirc;b&icirc; on the senses of being [<em>mawj&ucirc;d</em>] and the corresponding senses of existence [<em>wuj&ucirc;d</em>]</a></li>
	<li><a href="#FaraScieQuesAbouBein">3.5 F&acirc;r&acirc;b&icirc; on the scientific questions about being</a></li>
	<li><a href="#OneUnitSensUnitDiffRelaBetwOneManyCircThinQuid">3.6 <em>On the One and Unity</em>: senses of unity, different relations between one and many, and the circumscription of a thing by its quiddity</a></li>
	</ul>
	</li>
<li><a href="#FaraPhilTheoPerfCityPoliRegi">4. F&acirc;r&acirc;b&icirc;&rsquo;s philosophical theology: the <em>Perfect City</em> and <em>Political Regime</em></a></li>
<li><a href="#Bib">Bibliography</a>
	<ul>
	<li><a href="#PrimSour">A. Primary sources</a>
		<ul>
		<li><a href="#EditTextFara">A.1 Editions of texts by F&acirc;r&acirc;b&icirc;</a></li>
		<li><a href="#EditEarlArabPhilText">A.2 Editions of earlier Arabic philosophical texts</a></li>
		<li><a href="#TranTextFara">A.3 Translations of texts by F&acirc;r&acirc;b&icirc;</a></li>
		<li><a href="#TranEarlArabPhilTextGreeTextSurvArab">A.4 Translations of earlier Arabic philosophical texts, and a Greek text surviving in Arabic/Hebrew</a></li>
		</ul>
		</li>
	<li><a href="#BSecoSour">B. Secondary sources</a></li>
	</ul>
	</li>
<li><a href="#Aca">Academic Tools</a></li>
<li><a href="#Oth">Other Internet Resources</a></li>
<li><a href="#Rel">Related Entries</a></li>
</ul>
<!--Entry Contents-->

<ul>
<li><a href="reviving-sciences.html">Supplement: F&acirc;r&acirc;b&icirc;&rsquo;s project of reviving the sciences of the ancients</a></li>
<li><a href="word-being.html">Supplement: F&acirc;r&acirc;b&icirc; on the word for being, in Greek and Arabic</a></li>
</ul>

<hr />

</div>

<div id="main-text">

<h2 id="FaraProjReviScieAnci">1. F&acirc;r&acirc;b&icirc;&rsquo;s project of reviving the sciences of the ancients</h2>

<p>
F&acirc;r&acirc;b&icirc; does metaphysics, not by writing a commentary
on Aristotle&rsquo;s <em>Metaphysics</em>, but by trying to
reconstruct Aristotle&rsquo;s aims and demonstrative method and to
write the book that Aristotle would have written had he been writing
in Arabic for a largely Muslim readership. This is a part of
F&acirc;r&acirc;b&icirc;&rsquo;s approach to the &ldquo;sciences of
the ancients&rdquo;, i.e., to Greek philosophy, mathematics, and
medicine, with all their sub-disciplines. A brief summary follows but,
for a fuller account, see
 <a href="reviving-sciences.html">Supplement: F&acirc;r&acirc;b&icirc;&rsquo;s project of reviving the sciences of the ancients</a>.</p>
 
<p>
F&acirc;r&acirc;b&icirc;, more than any other medieval philosopher,
distrusts the surface appearance of Greek philosophy as presented to
him in the Arabic translations. He tries to go beyond this surface to
reconstruct the ancient authors&rsquo; aims and methods, and even to
reconstruct the structure of their Greek expressions, which he
suspects have been badly served by the Arabic translations. In some
cases the Greek texts he is interested in were not available to him
even in Arabic translation, but only in translations of later ancient
summaries or descriptions, but this does not stop him from trying to
reconstruct their underlying thought. (He has access to translations
of almost all of the texts of Aristotle that we have now, but
apparently to none of the texts of Plato.) He thinks this is worth the
effort because he thinks that the Greeks, especially Plato and
Aristotle, developed sciences which have since decayed or have been
transmitted only imperfectly to the Arabic-writing Muslim-ruled lands,
but which it is still possible to reconstruct and to apply to the
urgent questions of his own time.</p>

<p>
F&acirc;r&acirc;b&icirc; is particularly interested in applying the
&ldquo;sciences of the ancients&rdquo;, and particularly metaphysics,
to resolve the issues addressed and disputed by the &ldquo;religious
sciences&rdquo; within Islam, especially <em>kal&acirc;m</em> or
&ldquo;dialectical theology&rdquo;. These issues include whether the
world was created in time or has existed from eternity, proofs of
God&rsquo;s existence and of his having no partner or contrary,
God&rsquo;s attributes (knowledge, power, will &hellip;) and his
action in creating the world, and how his causality relates to the
causality of creatures. (F&acirc;r&acirc;b&icirc; systematically
addresses these issues, as well as <em>kal&acirc;m</em> issues about
prophecy, the religious community, and the &ldquo;return&rdquo; or
afterlife, in his <em>Principles of the Opinions of the Perfect
City</em>: see
 <a href="#FaraPhilTheoPerfCityPoliRegi">Section 4</a>
 below.) F&acirc;r&acirc;b&icirc; thinks that the arguments about
these issues within the Muslim community (and other religious
communities within the Muslim world) have been merely dialectical, so
that it is equally possible to argue on both sides of each issue. He
thinks that if the sciences of the ancients, especially metaphysics,
can be reconstructed and practiced according to a demonstrative
method, they will be able to resolve these disputes. He thinks,
however, that earlier philosophers in the Muslim world, in practicing
what they saw as Platonic or Aristotelian philosophy, have argued
sub-demonstratively, and so have been unable to resolve the disputes.
F&acirc;r&acirc;b&icirc; claims to be the first person in the Muslim
world to have mastered Aristotle&rsquo;s <em>Posterior Analytics</em>
and so recaptured Aristotle&rsquo;s demonstrative method. And he
claims to be the first to have understood Aristotle&rsquo;s
<em>Metaphysics</em>, and to have mastered the science of being and
its universal attributes which gives the only scientific foundation
for making judgments about God and his causality.</p>

<p>
F&acirc;r&acirc;b&icirc; and his contemporaries use the word
&ldquo;philosophy&rdquo; (in Arabic &ldquo;<em>falsafa</em>&rdquo;),
borrowed from the Greek, only for those schools and disciplines that
present themselves as continuing ancient Greek philosophy. Before
F&acirc;r&acirc;b&icirc;&rsquo;s time this kind of philosophy was
mainly practiced, in the Muslim world, by Christians, often
Syriac-Arabic bilinguals (and almost all the translators of Greek
texts were Christian); although Christian philosophers also had Muslim
and Jewish students, and although some Isma&#703;ili Shi&#703;ites had
integrated a version of Greek philosophy into their ideal of what the
imam must know. F&acirc;r&acirc;b&icirc; wants to break the
association of philosophy with particular (and often marginalized)
linguistic and religious communities. The Arabic grammarian
S&icirc;r&acirc;f&icirc; had accused F&acirc;r&acirc;b&icirc;&rsquo;s
Christian teacher Ab&ucirc; Bishr Matt&acirc; of presenting as
universal rules of logic, normative for any rational being, what were
simply rules of Greek grammar, as translated from Greek through Syriac
into Arabic and probably damaged in translation. Against this charge,
F&acirc;r&acirc;b&icirc; wants to show that logic, and philosophy is
general, is not community-bound like Arabic grammar or Muslim
<em>kal&acirc;m</em>. Logic is to thought as the grammar of a
particular language is to that language: its rules apply to all
thought insofar as it is correct, whatever language it may be
expressed in, and they give the common core shared by all languages,
abstracted from the merely conventional and community-relative aspects
of particular languages. And philosophy is to religion as logic is to
grammar, giving rules for how to think about God and the physical
world and human beings, and therefore for how to act to achieve the
aim of human life, which apply to all humans insofar as they reason
and act correctly; and these rules give the common core of doctrines
and practical prescriptions shared by all religions, or at least by a
plurality of correct religions, abstracted from the merely
conventional and community-relative aspects of particular
religions.</p>

<h2 id="FaraMetaScieArisMeta">2. F&acirc;r&acirc;b&icirc; on metaphysics as a science and Aristotle&rsquo;s <em>Metaphysics</em></h2>

<p>
F&acirc;r&acirc;b&icirc; aims to revive the sciences of the ancients,
especially the philosophical disciplines practiced by Plato and
Aristotle, to replace the (as he thinks) non-demonstrative disciplines
of his contemporaries, and to resolve their otherwise interminable
disputes. This centrally includes a project of reviving scientific
metaphysics, because metaphysics (rather than physics or other
sciences) offers the hope of a scientific demonstration that God
exists and has no partner or contrary, and a scientific resolution of
the <em>kal&acirc;m</em> issues about God&rsquo;s attributes and acts,
and the relation of God&rsquo;s acts to creatures and their
 acts.<sup>[<a href="notes.html#note-1" id="ref-1">1</a>]</sup>
 Perhaps metaphysics can also determine whether the human soul, or
some part of it, survives death, and thus can resolve the
<em>kal&acirc;m</em> issue about our &ldquo;return&rdquo; to God. But
also, apart from whatever metaphysics may say about immortality,
F&acirc;r&acirc;b&icirc; thinks, following Aristotle, that the highest
human happiness consists in the contemplation of God, so that
metaphysics will describe the <em>content</em> of our possible
happiness after death, and will come as close as we can come to
anticipating it in this life.</p>

<p>
F&acirc;r&acirc;b&icirc; did not write any one systematic work on
metaphysics, corresponding to Aristotle&rsquo;s <em>Metaphysics</em>,
although his <em>Book of Letters</em> and <em>On the One and
Unity</em>, taken together, stand in a close relation to some parts
and aspects of Aristotle&rsquo;s <em>Metaphysics</em>, and parts of
his <em>Principles of the Opinions of the People of the Perfect
City</em> and <em>On the Political Constitution</em> stand in close
relations to other parts and aspects of the <em>Metaphysics</em>
(other parts of these treatises are closer to other Greek models).
F&acirc;r&acirc;b&icirc;&rsquo;s starting-point in trying to revive
the science of metaphysics and to reconstruct and imitate its
classical texts (above all Aristotle&rsquo;s <em>Metaphysics</em>) is
his discussion of the &ldquo;aim&rdquo; or &ldquo;object&rdquo;
[Arabic <em>ghara&#7693;</em> = Greek <em>skopos</em>] of metaphysics.
F&acirc;r&acirc;b&icirc; takes over late ancient philosophers&rsquo;
assumptions that each of Aristotle&rsquo;s treatises is devoted to
teaching some one science, and that each science (and the treatise
teaching it) has some one &ldquo;aim&rdquo;, such that everything the
science treats is somehow related to that aim. Thus the
&ldquo;aim&rdquo; of medicine is health: the science of medicine also
discusses, for instance, anatomy and pathology and pharmacology, but
only because they are somehow related to health. Much of
F&acirc;r&acirc;b&icirc;&rsquo;s discussion of Aristotle&rsquo;s texts
picks up late ancient discussions of what science each text transmits,
the &ldquo;aim&rdquo; of the science and the text, how those sciences
function together to attain the human good and what role each text can
play in that larger undertaking. In order to reconstruct what
Aristotle would say now, instead of what he said in Greek in the
<em>Metaphysics</em>, if he were addressing a different linguistic and
religious community in a different historical situation,
F&acirc;r&acirc;b&icirc; must start by understanding the aim of
metaphysics as a science and how each book of the <em>Metaphysics</em>
is directed toward attaining that aim. He gives surveys of the Greek
sciences in his <em>Enumeration of the Sciences</em> and
<em>Attainment of Happiness</em>, and of Aristotle&rsquo;s works in
the <em>Philosophy of Aristotle</em>, all of which include brief
discussions of metaphysics; he also has a brief discussion of
metaphysics and its relation to some other sciences in his <em>Book of
Letters</em>, and he writes an entire short treatise <em>On the aims
of the Sage in each book of the treatise which is called the Book of
Letters, that is, the determination of Aristotle&rsquo;s aim in his
treatise the Metaphysics</em> (for short, <em>On the Aims of the
Metaphysics</em>). In the bulk of the <em>Book of Letters</em> and
<em>On the One and Unity</em> he is not talking <em>about</em>
metaphysics as a science or about Aristotle&rsquo;s text, but rather
imitating Aristotle in practicing this science. Some of <em>On the
Aims of the Metaphysics</em> is also imitating Aristotle, since, in
describing the distinction between the different theoretical sciences
(physics, mathematics, metaphysics) and the different things that
metaphysics considers, he is imitating Aristotle&rsquo;s discussion in
<em>Metaphysics</em> VI,1.</p>

<p>
F&acirc;r&acirc;b&icirc; starts <em>On the Aims of the
Metaphysics</em> by saying:</p>

<blockquote>

<p>
Our intention in this book is to indicate the aim that is contained in
the treatise of Aristotle called <em>Metaphysics</em>, and [to
indicate] its primary divisions. For many people have followed their
fancy that the meaning and content of this treatise is the account of
the Creator (glory be to Him and be He exalted!) and the intelligence
and the soul and the other things that are related to these, and that
the science of metaphysics and the science of
 theology<sup>[<a href="notes.html#note-2" id="ref-2">2</a>]</sup>
 are one and the same. And thus we find that most of those who
investigate [this treatise] are confused and go astray, since we find
that most of the account in it lacks this aim, indeed we do not find
in it any special discussion of this aim except what is in the
eleventh book, which bears the sign <em>lam</em> [L or
 &Lambda;].<sup>[<a href="notes.html#note-3" id="ref-3">3</a>]</sup></p>
 </blockquote>

<p>
Here F&acirc;r&acirc;b&icirc; is referring to the discussion, which
Arabic writers had inherited from late ancient Greek commentators,
about the aim of the <em>Metaphysics</em>, or equivalently about what
the science of metaphysics is about: Aristotle himself does not use
the word or phrase
 &ldquo;metaphysics&rdquo;,<sup>[<a href="notes.html#note-4" id="ref-4">4</a>]</sup>
 but he speaks both of &ldquo;wisdom
 [<em>sophia</em>]&rdquo;<sup>[<a href="notes.html#note-5" id="ref-5">5</a>]</sup>
 and of &ldquo;first philosophy&rdquo;, and Greek and Arabic
commentators assume that &ldquo;wisdom&rdquo; and &ldquo;first
philosophy&rdquo; are different names for the same science, and that
the <em>Metaphysics</em> as a whole is dedicated to this science,
which can therefore also be called &ldquo;metaphysics&rdquo;. For two
reasons, there is an inherited problem about what this science is
about. The first reason is that Aristotle in different places says
different, not obviously compatible, things about what this science is
about: notably, in the <em>Metaphysics</em> I,1&ndash;2 he says that
wisdom is the science of first causes and principles; in
<em>Metaphysics</em> VI,1 and in several texts outside the
<em>Metaphysics</em> he says that first philosophy is the science of
divine things (which he calls &ldquo;theology&rdquo;) or the science
of eternally unchangeable separately existing
 things;<sup>[<a href="notes.html#note-6" id="ref-6">6</a>]</sup>
 in <em>Metaphysics</em> IV,1&ndash;2 he says that there is a science
of being as such and its attributes, and in <em>Metaphysics</em> VI,1
he apparently identifies that science with first philosophy or
theology; and in <em>Metaphysics</em> IV,2 he also identifies the
science of being as such with the science of substance. So the
commentators try in different ways to reconcile these different things
that Aristotle says about wisdom or first philosophy. The second
reason that there is a problem is that what Aristotle actually
<em>does</em> in the different books of the <em>Metaphysics</em> does
not obviously fit with what he <em>says</em> that wisdom or first
philosophy will do. If, as F&acirc;r&acirc;b&icirc; says here,
&ldquo;most people&rdquo; have concluded that &ldquo;the meaning and
content of this treatise is the account of the Creator &hellip; and
the intelligence and the soul and the other things that are related to
these&rdquo;&mdash;i.e., an account of things that can be argued to be
eternal and separable from matter&mdash;this is not because (as
F&acirc;r&acirc;b&icirc; puts it here) they have simply
&ldquo;followed their fancy&rdquo;, or because they have confused
Greek metaphysics with Islamic <em>kal&acirc;m</em>. Rather, it is
because Aristotle repeatedly <em>says</em> that first philosophy is a
science of separate eternally unchanging things. The problem is that,
as F&acirc;r&acirc;b&icirc; says, most of the <em>Metaphysics</em>
outside of Book XII (indeed, outside of roughly the second half of
Book XII) does not seem to be talking about such things, except
inasmuch as <em>Metaphysics</em> XIII&ndash;XIV try to refute other
philosophers&rsquo; candidates for separate eternally unchanging
things, namely Platonic Forms and mathematical objects. So
F&acirc;r&acirc;b&icirc;&rsquo;s problem in <em>On the Aims of the
Metaphysics</em> will not be simply to find a way of reconciling the
different things Aristotle <em>says</em> about wisdom or first
philosophy and show how these can all be referring to the same
science, but also to say what Aristotle actually <em>does</em> in each
book of the <em>Metaphysics</em> and to show how it contributes to
this science.</p>

<p>
In his <em>Enumeration of the Sciences</em> F&acirc;r&acirc;b&icirc;
gives a description of &ldquo;the divine science&rdquo; (corresponding
to Aristotle&rsquo;s word &ldquo;theology&rdquo; in
<em>Metaphysics</em> VI,1, and his description of wisdom as
&ldquo;divine science&rdquo; in <em>Metaphysics</em> I,2), crowning
his previous descriptions of mathematics and physics. Here
F&acirc;r&acirc;b&icirc; says the divine science is divided into three
parts. The first part investigates &ldquo;beings and the things that
belong to them inasmuch as they are beings&rdquo;: this reflects
Aristotle&rsquo;s programmatic declaration in <em>Metaphysics</em>
IV,1. The second part, says F&acirc;r&acirc;b&icirc;, investigates
(i.e., establishes) the principles of the particular sciences, and
also investigates (i.e., refutes) false opinions of earlier
philosophers about the principles of these sciences, among which
F&acirc;r&acirc;b&icirc; mentions the opinion that mathematical
objects are separately existing substances: the latter would reflect
<em>Metaphysics</em>
 XIII&ndash;XIV,<sup>[<a href="notes.html#note-7" id="ref-7">7</a>]</sup>
 but F&acirc;r&acirc;b&icirc; is probably also thinking of the
refutation in <em>Metaphysics</em> IV,3&ndash;8 of people who deny the
principle of noncontradiction. (There is little support in Aristotle
for the idea that metaphysics establishes principles of other
sciences, except for universal axioms like noncontradiction and
excluded middle, but this idea can be found in late ancient
commentators. Aristotle does accept cases where one science can
establish principles that are assumed in another science&mdash;for
instance, number theory establishes principles that are assumed in
mathematical music theory, and geometry establishes principles that
are used in astronomy and optics&mdash;and Porphyry says that
metaphysics is related to physics in this
 way.)<sup>[<a href="notes.html#note-8" id="ref-8">8</a>]</sup>
 The third part of the &ldquo;divine science&rdquo;&mdash;and here
F&acirc;r&acirc;b&icirc; has much more to say&mdash;shows that there
are beings which neither are bodies nor exist in bodies, that these
beings are not one but many, and not infinitely but finitely many, and
that they do not all share the same degree of perfection, but rather
some are superior and others inferior. This then leads to the
conclusion that these beings separate from bodies culminate in some
first being which has nothing prior to it and thus has no further
cause of its existence. And, F&acirc;r&acirc;b&icirc; says, this
science shows that this being also has no partner (nothing sharing its
degree of perfection) and no contrary; that there is no multiplicity
in it in any way, and that it is one, being, and true in a stronger
sense than everything else; and that it is the first cause which
bestows being, unity and truth on everything else. Then,
F&acirc;r&acirc;b&icirc; says, this science shows that this being
deserves the name &ldquo;God&rdquo;, and satisfies the rest of the
divine attributes; and then it shows how other beings arise from God
and how they form an ordered hierarchy (some beings arise from God
directly, others indirectly through these), explains how God acts on
other things, and refutes the false opinion that God is responsible
for evils. The description of this third part of the &ldquo;divine
science&rdquo; reads like an analytical table of contents for much of
what F&acirc;r&acirc;b&icirc; does in his <em>Principles of the
Opinions of the People of the Perfect City</em> and <em>Political
Regime</em>, but it is not closely related to anything in Aristotle.
At best, it is an enormously expanded version of some things that
Aristotle covers very quickly in <em>Metaphysics</em> XII,6&ndash;10:
XII,6 shows that there are separate incorporeal substances, XII,7
justifies the name &ldquo;god&rdquo;, XII,8 argues that there is a
finite multiplicity of such substances but only one first among them,
and then XII,10 identifies this first principle with the good itself
and argues (very sketchily) that it is the cause of good order in the
cosmos and that there is no evil principle contrary to it. Aristotle
does not seem to say in <em>Metaphysics</em> XII that the first
principle is one, being, and true in a stronger sense than everything
else, or that it bestows being, unity and truth on everything else
(the best support for this view might be <em>Metaphysics</em> II,1
993b23&ndash;31). But the more serious problem is that
F&acirc;r&acirc;b&icirc; here just gives a list of the things that the
science will investigate or prove, without explaining why these tasks
all belong to the same science, and without explaining what principles
the science can draw on to demonstrate all these conclusions. His
account here looks like a wish-list of what he would like the science
to do, especially as a Greek scientific alternative to Islamic
<em>kal&acirc;m</em>, but it does not explain how a science can do all
this. Rather than solving the inherited problem of how a single
science can meet the different descriptions that Aristotle gives of
wisdom or first philosophy, he aggravates the problem by adding more
things that the science must
 do.<sup>[<a href="notes.html#note-9" id="ref-9">9</a>]</sup></p>
 
<p>
In <em>On the Aims of the Metaphysics</em>, F&acirc;r&acirc;b&icirc;
tries to resolve the tension between &ldquo;ontological&rdquo; and
&ldquo;theological&rdquo; descriptions of metaphysics (science of
beings universally, vs. science of God or of separate immaterial
substances), and the tension between Aristotle&rsquo;s mostly
&ldquo;theological&rdquo; <em>descriptions</em> of his task and his
mostly &ldquo;ontological&rdquo; <em>practice</em> in the
<em>Metaphysics</em>, in two fundamental ways.</p>

<p>
First, F&acirc;r&acirc;b&icirc; takes up Aristotle&rsquo;s contrast,
in <em>Metaphysics</em> IV,1 and VI,1, between metaphysics and the
&ldquo;particular sciences&rdquo; such as physics and the mathematical
disciplines, each of which takes some one genus of beings and
investigates what can be said of the things in that genus. By
contrast, says F&acirc;r&acirc;b&icirc;,</p>

<blockquote>

<p>
universal science is that which investigates what is common to all the
things that are, such as being and unity, and its kinds and its
attributes, and things which are not accidents [proper to] any of the
subjects of the particular sciences, [i.e., things] like priority and
posteriority and potency and act and the perfect and the deficient and
what is like these, and the common principle of all the things that
are: this is the thing that must be called by the name of
 God.<sup>[<a href="notes.html#note-10" id="ref-10">10</a>]</sup></p>
 </blockquote>

<p>
F&acirc;r&acirc;b&icirc; says that there can be only one such
universal science, because sciences are individuated by their
subject-domains: if there are two sciences, such that the
subject-domain of one includes something that is not within the
subject-domain of the other, then at least the second science is not a
universal science; so any two universal sciences would have the same
subject-domain, and would therefore be the same science. So a
universal science, if there is one, would be a science of being as
such, and also of unity if (as F&acirc;r&acirc;b&icirc; says,
following Aristotle in <em>Metaphysics</em> IV,2) unity is coextensive
with being, and also of any attributes (more literally
&ldquo;consequences&rdquo;) of being or unity, i.e., predicates that
can be shown to apply to every existing thing just because it exists
or because it is one. (Since F&acirc;r&acirc;b&icirc; cites pairs like
&ldquo;the perfect and the deficient&rdquo;, he apparently means to
include, not just attributes that apply to all beings, but also pairs
of attributes that apply disjunctively to all beings, in something
like the way that even and odd apply disjunctively to all numbers.)
F&acirc;r&acirc;b&icirc; does not argue here that there is a universal
science, beyond saying that &ldquo;it does not belong to any of [the
particular sciences] to investigate what is common to all the things
that are&rdquo;. Perhaps his view is that there is at least something
to investigate here, namely &ldquo;what, if anything, is common to all
the things that are?&rdquo;. If that investigation yields no answer,
or a negative answer, then there is no universal science; if we
discover, for some value of <em>P</em>, that <em>P</em> belongs
universally to all the things that are, then that proposition and the
arguments for it belong to the universal science, so there is a
universal science. F&acirc;r&acirc;b&icirc; is not assuming that being
is univocal and so constitutes a single genus. He says in <em>On the
Aims</em> that Aristotle in <em>Metaphysics</em> V investigates
whether the terms for being and its attributes are univocal or not,
and in his <em>Book of Letters</em> (see 
  <a href="#FaraOntoBookLettOneUnit">Section 3</a> below) he says that
being is not univocal, but is said of substances primarily and of
other things derivatively. So if all beings have some attribute
<em>P</em>, it will be because substances are <em>P</em> primarily,
and other beings are <em>P</em> because substances are; but this is
still enough for &ldquo;all beings are <em>P</em>&rdquo; to be a
theorem of the universal science.</p>

<p>
We have seen that F&acirc;r&acirc;b&icirc; lists God as one of the
things investigated by the universal science. God is investigated by
the science that &ldquo;investigates what is common to all the things
that are&rdquo; because God is &ldquo;the common principle of all the
things that are&rdquo;: he belongs to all beings in common, not
because he is an attribute predicated of all beings, but because he is
a cause of all beings. More precisely, he is a cause of all beings
<em>qu&acirc;</em> being: that is, he is a cause, to the things that
are, of the fact <em>that they are</em>, rather than of other facts
about them. As F&acirc;r&acirc;b&icirc; says a bit further down,</p>

<blockquote>

<p>
the divine science must enter into this science, since God is the
principle of being <em>simpliciter</em>, not of one being as
distinguished from another being. And the division which gives the
principle of being must be the divine science, since these concepts
are not proper to physics but are higher than physics in generality.
So this science is higher than the science of nature, and
<em>after</em> the science of nature, and for this reason it should be
called the science of metaphysics [lit. the science of what is after
nature].</p>
</blockquote>

<p>
Here F&acirc;r&acirc;b&icirc; is taking a stand on an issue that was
controversial among Aristotelians, by saying that we do not come to
know God through the science of physics, even though Aristotle argues
in his <em>Physics</em> 8 that the eternal circular motions are caused
by eternally unmoved movers. F&acirc;r&acirc;b&icirc; is saying that
the right way to come to know God is as a cause of existence rather
than as a cause of motion. On the face of it, this could be taken in
two ways. (a) Perhaps F&acirc;r&acirc;b&icirc; means that God is both
a cause of existence (to everything) and a cause of motion (to the
things that move, i.e., to bodies rather than to incorporeal
substances), but that the right way to gain scientific knowledge of
God is to know him as the cause of existence.
F&acirc;r&acirc;b&icirc;&rsquo;s reason might be that, when we know
about God that he is a first cause of motion (an unmoved mover), we do
not thereby know <em>what God is</em>, since <em>what God is</em> must
apply only to God, and there are many unmoved movers, of the many
circular motions in the heavens. F&acirc;r&acirc;b&icirc;&rsquo;s
point may be that there is only one first cause of existence (although
many first causes of motion), and knowing about God that he is a first
cause of existence gives us knowledge of <em>what God is</em>. (b) In
fact, however, F&acirc;r&acirc;b&icirc; thinks that the first cause of
existence is prior to the first cause of motion in a stronger sense:
knowing the first cause of motion does not give us knowledge of God,
because God is not a cause of motion at all. On
F&acirc;r&acirc;b&icirc;&rsquo;s account in the <em>Perfect City</em>
and <em>Political Regime</em>, God is not the first of the unmoved
movers, but is rather a cause of existence to the unmoved movers and
thus indirectly to everything else. So an ascent to the first cause of
motion does not get us to God at all, but only to some lower being:
only a study of the causes of being will get us to God.</p>

<p>
So far, F&acirc;r&acirc;b&icirc;&rsquo;s description of metaphysics is
ontological: theology is part of metaphysics, because theology is part
of the study of being, namely the study of the first cause of
existence. This allows F&acirc;r&acirc;b&icirc; to reconcile
Aristotle&rsquo;s saying in <em>Metaphysics</em> VI,1 that first
philosophy is a science of being qu&acirc; being with his saying in
the same chapter that first philosophy is theology. Unfortunately,
this solution seems to conflict with something else Aristotle says in
the same chapter, namely that</p>

<blockquote>

<p>
physics is about things that are inseparate but not unmoved, some of
mathematics about things that are unmoved, but probably not separate
but rather existing in matter, whereas first philosophy is about
things that are both separate and unmoved.
 (1026a13&ndash;16)<sup>[<a href="notes.html#note-11" id="ref-11">11</a>]</sup></p>
 </blockquote>

<p>
This seems to mean, not just that the study of things that are
separate and unmoved belongs to first philosophy, but that first
philosophy is <em>defined</em> as the science of things that are
separate and unmoved. How then is first philosophy the science of
being and its universal attributes? One possible answer would be that
first philosophy is by definition the science of God (or perhaps the
science of separate unmoved things including God), and that it studies
being and its universal attributes instrumentally, because starting
with them and investigating their causes is the only way we have to
come to knowledge of God. (This might imply that those aspects of the
study of being and its universal attributes which are not useful for
drawing conclusions about God would <em>not</em> belong to first
philosophy.) But F&acirc;r&acirc;b&icirc; gives a different answer, by
reinterpreting what Aristotle means by &ldquo;separate&rdquo;. This is
the <em>second</em> way that F&acirc;r&acirc;b&icirc; tries to resolve
the tension between ontological and theological descriptions of
metaphysics.</p>

<p>
F&acirc;r&acirc;b&icirc; infers from the universality of the science
he has described, including its investigation of God as the cause of
existence universally, that</p>

<blockquote>

<p>
this science is higher than the science of nature, and <em>after</em>
the science of nature, and for this reason it should be called the
science of metaphysics [i.e., literally, the science of what is after
nature].</p>
</blockquote>

<p>
But, as he admits, mathematics too &ldquo;is higher than the science
of nature since its subjects are abstracted from matters&rdquo;: so
why doesn&rsquo;t it count as metaphysics? Aristotle in
<em>Metaphysics</em> VI,1 says that mathematics falls short of being
first philosophy because its objects, although unchanging, do not
exist separately but rather are thought in abstraction from the things
they really exist in, whereas the objects of first philosophy are not
merely <em>thought</em> in abstraction but <em>really exist</em>
separately. F&acirc;r&acirc;b&icirc; takes this up, and, like all
ancient and medieval interpreters, takes &ldquo;abstraction&rdquo; and
&ldquo;separation&rdquo; to mean abstraction and separation <em>from
matter</em>. It makes sense to say that God exists really separated
from matter and triangles don&rsquo;t. But F&acirc;r&acirc;b&icirc;
thinks that the objects of metaphysics include not only God but also
being and unity. Why should being and unity be any more
&ldquo;separate&rdquo; than triangles are? Here
F&acirc;r&acirc;b&icirc; reinterprets the notion of separation.
<em>Some</em> of the objects of metaphysics, like God, &ldquo;are
things that have no existence at all in natural things&rdquo;. But
others, like being and its universal attributes, &ldquo;are things
that exist in natural things but are imagined as abstracted from
them&rdquo;, and are to that extent like mathematical objects; but,
unlike mathematical objects, they</p>

<blockquote>

<p>
do not exist <em>per se</em> in these [natural] things in such a way
that their existence could not be divested from them: these are the
things whose subsistence is in natural things but which exist both in
natural things and in non-natural things.</p>
</blockquote>

<p>
So because being and its universal attributes are attributes of
natural things but are <em>also</em> attributes of separately existing
immaterial things, they too can be said to be &ldquo;separate&rdquo;
from natural things and from matter.</p>

<p>
Recall that in the <em>Enumeration of the Sciences</em>
F&acirc;r&acirc;b&icirc; describes metaphysics as investigating three
things&mdash;being and its attributes, the principles of the
particular sciences, and separate incorporeal beings (especially
God)&mdash;but he does not explain why the three investigations fall
under a single science or what premisses the science can draw on to
resolve the questions. In <em>On the Aims of the Metaphysics</em> he
tries to explain how these investigations fit together. The science
starts by studying its primary subject, namely being and unity; then,
&ldquo;since the science of opposites is the same&rdquo;, their
opposites, non-being and multiplicity; then it divides being and unity
and their opposites into their main species, or rather
quasi-species&mdash;&ldquo;quasi&rdquo; because substances, qualities,
and the other categories are each called &ldquo;being&rdquo; in a
different sense, whereas if being were a genus and they were its
species it would be said of them all in the same
 sense.<sup>[<a href="notes.html#note-12" id="ref-12">12</a>]</sup>
 Then the science investigates the attributes and principles of being
and unity and their opposites,</p>

<blockquote>

<p>
and these things are divided and subdivided until the subjects of the
particular sciences are reached, and this science terminates and there
are manifested in it the principles of all the particular sciences and
the definitions of their subjects.</p>
</blockquote>

<p>
Because being and unity are not univocal, we cannot just
straightforwardly investigate their attributes and causes, but once
they have been analyzed into their different senses, we can
investigate the attributes and causes of each sense of being or unity
in the same way that any other science investigates the attributes and
causes of some given genus. A given effect, say substantial being, may
have different kinds of causes (for instance, both a formal cause and
a material cause), and these different kinds of causes may not all
converge on a first principle which is a cause in all these ways at
once (there will not be a single first principle that is both a formal
and a material cause). Some chains of causes may proceed upwards
<em>ad infinitum</em> without reaching a first principle (like the
chain of my ancestors, if the world and species within it are
eternal); and chains of causes of some kind may lead to many first
causes which have no further causes of that kind, rather than to a
single first cause (each animal has a soul as a first formal cause
which has no higher formal cause, but there will be as many such
souls, not a single soul which is a first formal cause of all
animals). Nonetheless, F&acirc;r&acirc;b&icirc; claims that there is a
single first cause of all beings, which does not itself have a cause
of any kind; if so, such a thing would deserve the name
 &ldquo;God&rdquo;.<sup>[<a href="notes.html#note-13" id="ref-13">13</a>]</sup>
 If the science can show that there is such a single first principle,
the science would then try to deduce what this principle must be like
in order to be a cause of all beings, and in order not to have any
further cause itself, and would then try to deduce how it must acts in
order to cause the existence of other things, some directly and others
indirectly. Here in <em>On the Aims</em> F&acirc;r&acirc;b&icirc; says
that Aristotle does all these things in <em>Metaphysics</em> XII:</p>

<blockquote>

<p>
The eleventh book [i.e., Book XII, Lambda] is about the principle of
substance and [thereby] of all existence, the existence [of this
principle] and the confirmation that it is knowing by its essence and
true by its essence, and about the separate beings which are after it,
and about how the existence of beings depends on it.</p>
</blockquote>

<p>
But that is all that F&acirc;r&acirc;b&icirc; says here, and he never
gives any more detailed discussion of how he thinks Aristotle does
this in <em>Metaphysics</em> XII. But F&acirc;r&acirc;b&icirc; himself
tries to deliver on this promise in his <em>Perfect City</em> and
<em>Political Regime</em>, which we will turn to after discussing his
analysis of being and unity and other equally universal concepts in
his <em>Book of Letters</em> and <em>On the One and Unity</em>.</p>

<h2 id="FaraOntoBookLettOneUnit">3. F&acirc;r&acirc;b&icirc;&rsquo;s ontology: the <em>Book of Letters</em> and <em>On the One and Unity</em></h2>

<p>
F&acirc;r&acirc;b&icirc;&rsquo;s most widely-known and perhaps
best-understood work, the <em>Principles of the Opinions of the People
of the Perfect City</em>, and his often similar <em>Political
Regime</em>, presuppose analyses of being and unity in arguing for
conclusions about God and his attributes and his causality; but
F&acirc;r&acirc;b&icirc; makes these analyses fully explicit only in
two much less widely known and less well-understood texts, the
<em>Kit&acirc;b al-&#7717;ur&ucirc;f</em> = <em>Book of Letters</em>
and <em>On the One and Unity</em>, which are intended to be read
together. Both of these texts were edited for the first time by Muhsin
Mahdi, the <em>Book of Letters</em> in 1969 and <em>On the One and
Unity</em> in 1989; only partial translations of the <em>Book of
Letters</em>, and no translations at all of <em>On the One and
Unity</em>, have been published in English or any western European
 language.<sup>[<a href="notes.html#note-14" id="ref-14">14</a>]</sup>
 Both texts are difficult, and at least the <em>Book of Letters</em>
presents serious textual problems; there have been few studies of
<em>On the One and Unity</em>, and most studies of the <em>Book of
Letters</em> have focussed on its socio-political rather than
metaphysical
 sections.<sup>[<a href="notes.html#note-15" id="ref-15">15</a>]</sup>
 So what is said here must remain tentative.</p>

<h3 id="FaraProjBookLett">3.1 F&acirc;r&acirc;b&icirc;&rsquo;s project in the <em>Book of Letters</em></h3>

<p>
The most basic questions about the <em>Book of Letters</em> are what,
if anything, the treatise is about overall, and how the different
parts of the treatise contribute to knowledge of that aim. Mahdi 1969a
divides the text into three &ldquo;Parts&rdquo;
[<em>abw&acirc;b</em>]; in the manuscripts that have been studied so
far, the three Parts are probably not transmitted in the right order,
some parts of the text and perhaps in particular an introduction are
missing, and it is not obvious what the subject-matters of the three
Parts have to do with each other. The title <em>Kit&acirc;b
al-&#7717;ur&ucirc;f</em> = <em>Book of Letters</em> is the same title
by which F&acirc;r&acirc;b&icirc; in <em>On the Aims</em> cites
Aristotle&rsquo;s <em>Metaphysics</em> (which presumably gets called
<em>Book of Letters</em> because Arabic authors cite its individual
books by the names of letters of the alphabet, just as we do now), so
the title suggests that F&acirc;r&acirc;b&icirc; intends this treatise
to correspond to the <em>Metaphysics</em>; and there are heavy
overlaps of content between the <em>Book of Letters</em> and
Aristotle&rsquo;s <em>Metaphysics</em>, especially but not exclusively
Book V, which make it very unlikely that the correspondence of titles
is a coincidence. But the title <em>Kit&acirc;b
al-&#7716;ur&ucirc;f</em> can also mean something else, since
&ldquo;<em>&#7717;ur&ucirc;f</em>&rdquo; (sg. <em>&#7717;arf</em>),
besides meaning &ldquo;letters&rdquo;, can also mean grammatical
&ldquo;particles&rdquo;, i.e., any words that can neither be declined
like a noun nor conjugated like a verb, so pronouns and articles and
prepositions and adverbs and
 conjunctions.<sup>[<a href="notes.html#note-16" id="ref-16">16</a>]</sup>
 Parts I and III of the <em>Book of Letters</em> are organized
&ldquo;lexically&rdquo; (like F&acirc;r&acirc;b&icirc;&rsquo;s <em>On
Intelligence</em>), around the many meanings of each of a series of
terms, and the majority of the terms here are grammatically particles
rather than nouns or verbs: once again, it seems very unlikely that
this is a coincidence. But how can the same book be <em>Kit&acirc;b
al-&#7716;ur&ucirc;f</em> both in the sense of filling the role of
Aristotle&rsquo;s <em>Metaphysics</em>, and in the sense of being
about grammatical particles? And how would a study of the meanings of
particles (and of some selected nouns) contribute to metaphysics as
F&acirc;r&acirc;b&icirc; has described it in <em>On the Aims</em>? To
see how this could work, we have to see something about the projects
of the three Parts of the <em>Book of Letters</em> and how they fit
together; and we have to start with Part II, which
F&acirc;r&acirc;b&icirc; probably intended to come first, and which
can be taken as programmatic for the whole treatise. After discussing
the project of the treatise, we will focus on its most remarkable
claims about the different senses of being [<em>mawj&ucirc;d</em>] and
the corresponding senses of existence [<em>wuj&ucirc;d</em>], and
about how they should be investigated, and the implications for
metaphysics. Finally, we will look more briefly at the corresponding
claims about one and unity in <em>On the One and Unity</em>.</p>

<p>
Part II of the <em>Book of Letters</em> gives an account of the
development of the &ldquo;syllogistic arts&rdquo; (arts of reasoning
such as rhetoric, dialectic and sophistic), culminating in
demonstrative science, within a given linguistic and religious
community, and their transmission from one community to another.
F&acirc;r&acirc;b&icirc; is especially interested in the
<em>language</em> of these arts, especially of demonstrative science.
He talks about the origin of language as such; but language as it
naturally arises is not well suited to being the vehicle of
demonstrative science, because it is chiefly devoted to naming and
describing the objects of immediate practical interest to human
beings, which are not the main objects of theoretical interest. But
natural language can be extended in two main ways to provide the
terminology of the syllogistic arts. First, terms of ordinary language
can be extended metaphorically to new meanings, and can then be frozen
for use as technical terms; and this process of metaphorical extension
and freezing can be repeated indefinitely many times. Second, new
terms can be formed from old ones by regular grammatical processes of
morphological derivation, and this type of extension too can be
repeated and combined with the first type. Special problems, however,
arise when the arts, especially demonstrative science, are transmitted
from one community to another, and the translators must create a new
technical vocabulary in the target-language. If the technical terms of
the source-text were derived by freezing metaphorically extended words
in the source-language, the translator may try to create new technical
terms either by imitating the metaphors of the source-language in the
target-language, where they may be much less natural, or else by
forming new terms from metaphors more natural to the target language:
either way, there is a risk of misunderstanding.
F&acirc;r&acirc;b&icirc; talks about these problems in general, but he
devotes special attention to the transmission of demonstrative
philosophy and its vocabulary from Greek into (Syriac and thus)
Arabic.</p>

<p>
Although F&acirc;r&acirc;b&icirc; does not make explicit connections
between the different Parts of the <em>Book of Letters</em>, Part II
can be seen as giving an implicit program for Parts I and III, each of
which is organized lexically around a list of terms: in each case
F&acirc;r&acirc;b&icirc; lists the different meanings of the term,
starting with an ordinary-language meaning and then explaining how it
is metaphorically extended to a series of further meanings, including
technical meanings in the different arts and especially in philosophy.
Part I treats in this way terms including the names of many of the ten
Aristotelian categories, or the interrogative particles from which
names of categories are derived (&ldquo;<em>kamiyya</em>&rdquo; =
quantity is derived from &ldquo;<em>kam</em>?&rdquo; = &ldquo;how
much?&rdquo;, and so on); it also discusses particles such as
&ldquo;from&rdquo; and &ldquo;because&rdquo; and nouns such as
&ldquo;being&rdquo;, &ldquo;essence&rdquo;, and
&ldquo;accident&rdquo;, with a heavy overlap with the list of terms
investigated in Aristotle&rsquo;s <em>Metaphysics</em> V. Part Three
applies the same lexical method to the four kinds of scientific
question or investigation described in <em>Posterior Analytics</em>
II, the questions &ldquo;whether <em>X</em> is&rdquo;, &ldquo;what
<em>X</em> is&rdquo;, &ldquo;that <em>S</em> is <em>P</em>&rdquo;, and
&ldquo;why <em>S</em> is <em>P</em>&rdquo;. In each of these cases
F&acirc;r&acirc;b&icirc; distinguishes the ways of investigating these
questions in different disciplines&mdash;for instance, how they are
investigated in dialectic vs. how they are investigated in
demonstrative science&mdash;as if they turned on different meanings
that the particles, &ldquo;whether&rdquo; or &ldquo;what&rdquo; or
&ldquo;that&rdquo; or &ldquo;why&rdquo;, have in different syllogistic
arts. There are clear connections between Parts I and III, notably
between Part I on the senses of &ldquo;being&rdquo;
[<em>mawj&ucirc;d</em>] and Part III on the senses of &ldquo;whether
it is&rdquo; [<em>hal mawj&ucirc;d</em>]. F&acirc;r&acirc;b&icirc;
evidently thinks that people have gone wrong in the sciences through
confusing different meanings of the terms he discusses, in particular
through confusing ordinary-language meanings of these terms with
technical meanings in the syllogistic arts, or confusing meanings in
one syllogistic art with meanings in another. And he thinks these
problems are made worse when the technical terms of these arts are
first developed in one language (Greek) and then translated into
another (Arabic) in the ways he has described in Part II: if a word
which has a meaning in ordinary Arabic (or in the technical vocabulary
of some native Arabic art), or a word morphologically derived from
such an Arabic word, has its meaning extended to serve as the
artificial Arabic equivalent of some Greek technical term, then there
is a serious risk that it will be misunderstood by Arabic readers.
This explains why F&acirc;r&acirc;b&icirc; thinks that the sort of
work Aristotle does in <em>Metaphysics</em> V, distinguishing
different meanings of a series of technical terms, would be even more
necessary in Arabic than it was in Greek.</p>

<h3 id="LogiGramFormRolePart">3.2 Logical and grammatical form, and the role of particles</h3>

<p>
Something more, however, is needed to explain why
F&acirc;r&acirc;b&icirc; concentrates so heavily on the meanings of
<em>particles</em>, and why he thinks (as he does) that this study
will lead to a scientific investigation of being and its causes.</p>

<p>
A crucial point is that F&acirc;r&acirc;b&icirc; is worried not just
about lexical confusions (confusions between two meanings of a term or
between two similar terms), but about confusions arising from the
misleading grammatical form of a term: he thinks that these confusions
have given rise to serious philosophical errors, and he thinks that
the translation process has made such confusions more likely. Part I
of the <em>Book of Letters</em> distinguishes between the primitive
terms of a language and the terms derived or &ldquo;paronymous&rdquo;
[<em>mushtaqq</em>] from them. F&acirc;r&acirc;b&icirc; takes the
notion of paronymy ultimately from Aristotle&rsquo;s
<em>Categories</em> 1 (1a12&ndash;15). A proper noun like
&ldquo;Socrates&rdquo;, a common noun like &ldquo;horse&rdquo;, and an
abstract accidental term like &ldquo;whiteness&rdquo; are all
primitive terms, but the concrete accidental term &ldquo;white&rdquo;
is paronymous or derived from &ldquo;whiteness&rdquo;, not necessarily
in the sense that it arises later in the history of the language than
&ldquo;whiteness&rdquo;, but in the sense that something is called
&ldquo;white&rdquo; (rather than &ldquo;whiteness&rdquo;)
<em>because</em> there is a whiteness in it. F&acirc;r&acirc;b&icirc;,
unlike Aristotle, also treats (finite) verbs as being paronymous from
their infinitives, where the infinitive [<em>ma&#7779;dar</em>] in
Arabic is a noun expressing the action of the verb. The grammatical
form of a paronymous term suggests that something is <em>X</em> by
having an <em>X</em>-ness present in it, or <em>V</em>&rsquo;s by
having an action of <em>V</em>-ing in it. But sometimes the
grammatical form of a term misleadingly fails to track its logical
form, and in these cases there is a risk of being deceived by what
Aristotle in <em>On Sophistical Refutations</em> calls sophisms of
<em>skh&ecirc;ma t&ecirc;s lexe&ocirc;s</em>: this is usually
translated into English as &ldquo;sophisms of figure of speech&rdquo;,
but they would more accurately be called &ldquo;sophisms of
grammatical form&rdquo;, i.e., sophisms which arise because the
grammatical form of an expression fails to correspond to its logical
form, and which can be solved only by diagnosing this
 discrepancy.<sup>[<a href="notes.html#note-17" id="ref-17">17</a>]</sup>
 The Arabic translators of Greek philosophical texts, in trying to
find Arabic equivalents for the Greek source-terms, often use such
awkward and potentially misleading expressions, and so do Arabic
philosophical texts written in imitation of the language of the
translations. In particular, F&acirc;r&acirc;b&icirc; says that the
Greek word for &ldquo;being&rdquo; was non-paronymous, but that some
translators, not finding a good non-paronymous Arabic equivalent,
instead used the paronymous word, &ldquo;<em>mawj&ucirc;d</em>&rdquo;,
literally &ldquo;found&rdquo;, and that this gave rise to the
grammatical appearance that something is existent or
&ldquo;found&rdquo; [<em>mawj&ucirc;d</em>] through an existence or
&ldquo;finding&rdquo; [<em>wuj&ucirc;d]</em> present in it, as
something is white through a whiteness present in it.
F&acirc;r&acirc;b&icirc;, applying a methodological principle of
charity, seems to assume that in each case the Greek original was free
of such infelicities: this means that, in practice, his reconstructed
Greek serves as an ideal logical language, i.e., a language in which
grammatical form always tracks logical form.</p>

<p>
Where grammatical form tracks logical form, a non-paronymous noun will
signify either a substance or a being in one of the nine Aristotelian
categories of accidents, and a paronymous noun or a verb will signify
that such a being is present in or attributed to some underlying
subject. But metaphysics, as F&acirc;r&acirc;b&icirc; understands it,
is not about things in the categories (<em>Book of Letters</em>
I,11&ndash;17), but rather about the categories themselves (especially
substance) and about trans-categorial concepts such as being, unity,
essence, cause, and also God (who also, for F&acirc;r&acirc;b&icirc;,
does not fall under any category). And where grammatical form tracks
logical form, these concepts will be signified neither by
non-paronymous nouns, nor by paronymous nouns or verbs, but by
particles. Particles in an ideal logical language thus correspond
roughly to what a modern philosopher would call logical constants. And
it is clear that F&acirc;r&acirc;b&icirc; thinks that at least some
important metaphysical notions were expressed in Greek by particles,
or by terms morphologically derived from
 particles.<sup>[<a href="notes.html#note-18" id="ref-18">18</a>]</sup>
 As noted above, the names of many of the Aristotelian categories in
Arabic (and of some of them in Greek) either are particles or are
morphologically derived from particles, and the scientific questions
from <em>Posterior Analytics</em> II, which F&acirc;r&acirc;b&icirc;
treats in <em>Book of Letters</em> Part III, are distinguished by
their different interrogative words (&ldquo;if/whether&rdquo;,
&ldquo;what&rdquo;, &ldquo;why&rdquo;), which in Arabic are all
particles. And F&acirc;r&acirc;b&icirc; may well have thought that the
Greek original of <em>Metaphysics</em> V was devoted to distinguishing
the many meanings of <em>particles</em> (not just of words in
general), not in the sense that the lexical items that head each
chapter of <em>Metaphysics</em> V are in all cases themselves
particles or even nouns morphologically derived from particles
(although some of them
 are),<sup>[<a href="notes.html#note-19" id="ref-19">19</a>]</sup>
 but in the sense that the many meanings of these nouns would track
the many meanings of some particle, as the meanings of the noun
&ldquo;cause&rdquo; (<em>Metaphysics</em> V,2) track the meanings of
the particle &ldquo;because&rdquo;. There is in fact good reason to
think this is true for a reasonable number of the chapters of
<em>Metaphysics</em>
 V.<sup>[<a href="notes.html#note-20" id="ref-20">20</a>]</sup>
 <em>Metaphysics</em> V also discusses the categories of quantity and
quality (V,13&ndash;14), where, as noted, the name of the category is
derived from an interrogative word which is a particle in Arabic and
which F&acirc;r&acirc;b&icirc; might well expect to be a particle in
Greek (although in fact it is not), and the category of substance
(V,8), where it is reasonable to say that the many meanings of
&ldquo;substance&rdquo; track the many meanings of the question
&ldquo;what it is&rdquo; from <em>Posterior Analytics</em> II and
<em>Book of Letters</em> Part III, where again the interrogative word
&ldquo;what&rdquo; (<em>ti</em> in Greek, <em>m&acirc;</em> in Arabic)
is a particle in Arabic. We can also reasonably say that the many
meanings of &ldquo;being&rdquo; (V,7, <em>on</em> in Greek,
<em>mawj&ucirc;d</em> in Arabic) track the many meanings of the
question &ldquo;whether it is&rdquo; from <em>Posterior Analytics</em>
II and <em>Book of Letters</em> Part III (<em>ei esti</em> in Greek,
<em>hal mawj&ucirc;d</em> in Arabic), where the interrogative word
&ldquo;whether&rdquo; is a particle in both languages. More
surprisingly, although F&acirc;r&acirc;b&icirc; cites the Greek word
for &ldquo;being&rdquo; as <em>ast&icirc;n</em> = <em>estin</em>,
which is in fact the third-person singular present-tense verb
&ldquo;is&rdquo;, he says explicitly that this word is not a verb and
that it is not a paronymous noun: his description of its functions
implies that it also cannot be a non-paronymous noun, and so for
F&acirc;r&acirc;b&icirc; this word must be a
 particle.<sup>[<a href="notes.html#note-21" id="ref-21">21</a>]</sup></p>
 
<h3 id="FaraWordForBeinGreeArab">3.3 F&acirc;r&acirc;b&icirc; on the word for being, in Greek and Arabic</h3>

<p>
F&acirc;r&acirc;b&icirc;&rsquo;s analysis of the Greek word for being
as a particle is important in his reconstruction of the syntax of
Greek as something close to a logically ideal language, in his
reconstruction of the underlying logical syntax of any language, and
in his diagnosis of the misunderstandings that can arise when the
grammatical form of an expression in some natural language fails to
track its underlying logical form, as when the paronymous Arabic word
<em>mawj&ucirc;d</em> = &ldquo;being&rdquo; suggests that being is an
accident. While F&acirc;r&acirc;b&icirc; gives what we can think of as
an Arabic analogue to Aristotle&rsquo;s discussion in
<em>Metaphysics</em> V,7 of the many meanings of &ldquo;being&rdquo;,
the Arabic analogue focusses on several features that the Greek
original does not: the paronymous form of the word
<em>mawj&ucirc;d</em>, the difficulties that led the translators to
draft the word <em>mawj&ucirc;d</em>, literally &ldquo;found&rdquo;,
into service as an equivalent to the Greek word for being, and the
relation between <em>mawj&ucirc;d</em> = &ldquo;being&rdquo; in the
sense of &ldquo;that which is&rdquo;, and <em>wuj&ucirc;d</em> =
&ldquo;existence&rdquo; or &ldquo;being&rdquo; in the sense of
&ldquo;the being of that which is&rdquo;. Furthermore, while the use
of <em>mawj&ucirc;d</em> in the syllogistic arts to mean
&ldquo;being&rdquo; is always a metaphorical extension from the
original meaning &ldquo;found&rdquo;, and its use,
F&acirc;r&acirc;b&icirc; also thinks that <em>mawj&ucirc;d</em> =
&ldquo;being&rdquo; has <em>different</em> meanings in different
syllogistic arts, and in particular that it has a distinctive meaning
in demonstrative science, contrasting with its meaning in dialectic,
and that the paronymous form of the word, while it has some
justification in dialectic, is more seriously misleading in
demonstrative science. F&acirc;r&acirc;b&icirc; thinks that bringing
out the distinctive scientific meaning of &ldquo;being&rdquo;, and the
distinctive logical form of the word &ldquo;being&rdquo; as used in
demonstrative science, will show the path to a scientific treatment of
being, based on distinctively scientific ways of investigating (for a
given <em>X</em>) both the question <em>whether <em>X</em> is</em> and
the question <em>what <em>X</em> is</em>.</p>

<p>
F&acirc;r&acirc;b&icirc; says:</p>

<blockquote>

<p>
in all other languages [i.e., other than Arabic], such as Persian and
Syriac and Sogdian, there is an expression which they use to signify
all things without specifying one thing as opposed to another thing
[i.e., it is a predicate which is true of any subject whatever], and
they also use it to signify the connection
[<em>rib&acirc;&#7789;</em>, elsewhere translated
&ldquo;copula&rdquo;] between the predicate and what it is predicated
of: this is what connects the predicate with the subject when the
predicate is a noun or when they want the predicate to be connected
with the subject absolutely, without any mention of time. (<em>Book of
Letters</em> I,82, p.111,4&ndash;8)</p>
</blockquote>

<p>
A brief summary is given below of F&acirc;r&acirc;b&icirc;&rsquo;s
view on how being is expressed in Greek and Arabic, and of the
difficulties faced by the Arabic translators, but for a fuller
discussion see
 <a href="word-being.html">Supplement: F&acirc;r&acirc;b&icirc; on the word for being, in Greek and Arabic</a>
 </p>

<p>
F&acirc;r&acirc;b&icirc; assumes that Greek (like Arabic)
distinguishes syntactically between tensed and tenseless sentences,
and that (unlike Arabic) it expresses the copula in both kinds of
sentences. Because, according to Aristotle&rsquo;s definition of
&ldquo;verb&rdquo; in <em>On Interpretation</em> 3, a verb must
&ldquo;consignify a time&rdquo;, the tenseless copula cannot be a
verb. Nor can it be a noun: if to predicate one noun of another we
must insert a third noun between them, there will be an infinite
regress of copulas. So the tenseless copula <em>estin</em> (or
<em>ast&icirc;n</em>), in Greek as F&acirc;r&acirc;b&icirc;
reconstructs it, must be a particle, although there will also be
tensed copulas which are verbs paronymously derived from this
particle. He also thinks that the same particle can function, not only
in 2-place contexts, i.e., in tenseless predicative statements
&ldquo;<em>X</em> is <em>Y</em>&rdquo;, but also in 1-place contexts,
i.e., in tenseless statements of existence &ldquo;<em>X</em>
is&rdquo;: and he assumes that this is the word that Aristotle is
discussing in the chapter on the meanings of being,
<em>Metaphysics</em> V,7.</p>

<p>
We have seen that F&acirc;r&acirc;b&icirc; thinks that all languages
<em>other than Arabic</em> have a word with these functions. Since
Arabic has no word that does all these things, he thinks that the
Arabic translators of Greek philosophical texts have had trouble with
this word, and he discusses different strategies that they have
adopted. The most common strategy is to use the Arabic passive
participle &ldquo;<em>mawj&ucirc;d</em>&rdquo;, literally
&ldquo;found&rdquo;, as a tenseless &ldquo;is&rdquo; in both 1-place
or 2-place contexts, and to use passive forms of the verb
&ldquo;<em>wajada</em>&rdquo;, &ldquo;find&rdquo;, for the tensed
&ldquo;is&rdquo; and &ldquo;was&rdquo; and &ldquo;will be&rdquo;. The
disadvantage of &ldquo;<em>mawj&ucirc;d</em>&rdquo; is that then the
Arabic word for &ldquo;is&rdquo; or &ldquo;being&rdquo;, unlike the
Greek word it translates, is grammatically paronymous, so that its
grammatical form does not correspond to its logical form:</p>

<p>
the expression &ldquo;<em>mawj&ucirc;d</em>&rdquo; is, in its first
imposition in Arabic, paronymous, and every paronymous term by its
construction gives the impression that there is in what it signifies
an implicit subject and, in this subject, the meaning
[<em>ma&#8219;n&acirc;</em>] of the <em>ma&#7779;dar</em> [the
infinitive, functioning in Arabic as an abstract noun] from which [the
term] was derived [i.e., as &ldquo;white&rdquo; implies, without
explicitly mentioning, a subject in which whiteness is present]. For
this reason the expression &ldquo;<em>mawj&ucirc;d</em>&rdquo; has
given the impression that there is in every thing a meaning/entity
[<em>ma&#8219;n&acirc;</em>] in an implicit subject, and that this
meaning/entity is what is signified by the expression
&ldquo;<em>wuj&ucirc;d</em>&rdquo; [&ldquo;finding&rdquo; or
&ldquo;being found&rdquo;]: so it gave the impression that
<em>wuj&ucirc;d</em> is in an implicit subject, and
<em>wuj&ucirc;d</em> was understood as being like an accident in a
subject. (<em>Book of Letters</em> I,84, p.113,9&ndash;14)</p>

<p>
There is thus a grammatical appearance that <em>X</em> exists or is a
being (&ldquo;<em>X</em> <em>mawj&ucirc;d</em>&rdquo;) through an
accident of existence or beingness which inheres in <em>X</em>, or an
act of finding <em>X</em>; and F&acirc;r&acirc;b&icirc; thinks that
this appearance gives rise to serious metaphysical errors. His account
of the logical syntax of being in the <em>Book of Letters</em> is
designed to expose and root out these errors. In particular, it will
function as a critique of anyone who wants to understand God as
something like a Platonic form of being, so that other things would
exist by participating in this form. (Averroes, later, will adapt
F&acirc;r&acirc;b&icirc;&rsquo;s account of the logical syntax of
being to give a criticism of Avicenna&rsquo;s distinction between
essence and existence, see Menn 2011.) But F&acirc;r&acirc;b&icirc;
also wants to give the ontological foundations for a positive
metaphysical account of God, which he thinks Aristotle was aiming at
in <em>Metaphysics</em> XII and which he will try to reconstruct in
his <em>Principles of the Opinions of the People of the Perfect
City</em> and his <em>Political Regime</em> (see
 <a href="#FaraPhilTheoPerfCityPoliRegi">Section 4</a>
 below).</p>

<h3 id="FaraSensBeinMawjCorrSensExisWuju">3.4 F&acirc;r&acirc;b&icirc; on the senses of being [<em>mawj&ucirc;d</em>] and the corresponding senses of existence [<em>wuj&ucirc;d</em>]</h3>

<p>
We might expect F&acirc;r&acirc;b&icirc; to say that the paronymous
form of the Arabic word for being or &ldquo;exists&rdquo;
[<em>mawj&ucirc;d</em>] is a mere grammatical accident and that there
is no such thing as the existence [<em>wuj&ucirc;d</em>] through which
things exist. Instead he distinguishes (at least) two senses of being
[<em>mawj&ucirc;d</em>], each applicable in both 1- and 2-place
contexts, and says that in each case there is a corresponding sense of
existence [<em>wuj&ucirc;d</em>]. But he thinks that only a conflation
between these two senses of being would lead us to believe that a
being <em>X</em> exists through an existence which is both independent
of the mind and extrinsic to the essence of <em>X</em>.
F&acirc;r&acirc;b&icirc; tries to connect these two main senses of
being with differences in how the term &ldquo;being&rdquo; is
understood in different disciplines, specifically in dialectic and
demonstrative science, and with differences in how dialectic and
demonstrative science investigate the questions whether <em>X</em> is
and what <em>X</em> is, which F&acirc;r&acirc;b&icirc; discusses in
<em>Book of Letters</em> III in connection with the particles
&ldquo;whether&rdquo; and &ldquo;what&rdquo;. His discussion is
complicated and difficult, but some of his main points seem to be as
follows.</p>

<p>
F&acirc;r&acirc;b&icirc; in <em>Book of Letters</em> I,88&ndash;94
describes the different senses of being [<em>mawj&ucirc;d</em>] and
the corresponding senses of existence [<em>wuj&ucirc;d</em>],
concentrating on 1-place
 contexts.<sup>[<a href="notes.html#note-22" id="ref-22">22</a>]</sup>
 Aristotle in <em>Metaphysics</em> V,7 distinguishes four main senses
of being (giving mostly 2-place examples), in some cases with
sub-senses: being <em>per accidens</em>, being <em>per se</em> (with
subsenses corresponding to the different categories), being as the
true, and being in actuality or potentiality. F&acirc;r&acirc;b&icirc;
has nothing in I,88&ndash;94 corresponding to being <em>per
 accidens</em>,<sup>[<a href="notes.html#note-23" id="ref-23">23</a>]</sup>
 and his treatment of the other main senses of being corresponds only
roughly to Aristotle&rsquo;s&mdash;of course, his treatment is longer
and more detailed, and includes the discussion of existence
[<em>wuj&ucirc;d</em>], which does not correspond to anything in
<em>Metaphysics</em> V,7. F&acirc;r&acirc;b&icirc; starts in I,88 by
distinguishing three main senses of being, namely the sense of being
which is divided into different senses for the different categories
(pp.115,15&ndash;116,3), being as the true, i.e., what &ldquo;is
outside the soul and is in itself [<em>bi-&#8219;aynihi</em>] as it is
in the soul&rdquo; (p.116,3&ndash;6), and being as what is
&ldquo;circumscribed [<em>mun&#7717;&acirc;z</em>] by some quiddity
outside the soul, whether it has been represented in the soul or has
not been represented&rdquo; (p.116,6&ndash;7). But in I,90 he says
that these three senses of being can be reduced to two, &ldquo;that it
is true and that it has some quiddity outside the soul&rdquo;
(p.117,18&ndash;19). In this discussion F&acirc;r&acirc;b&icirc; is
giving his interpretation of two of Aristotle&rsquo;s four senses of
being, being <em>per se</em> and being as the true. (Later, in
I,93&ndash;94, he discusses being in actuality and potentiality, but
only as a subdivision within being as what has a quiddity outside the
soul, and it does not seem to play a large role in the <em>Book of
Letters</em>.) In I,89, starting from the I,88 enumeration of three
main senses of being, he discusses what kind of existence
[<em>wuj&ucirc;d</em>] corresponds to each of these senses of being
[<em>mawj&ucirc;d</em>]; and in I,92 he tries to show that being as
what has a quiddity outside the soul (unlike being as the true) is
said not univocally, but of some things in more primary senses and of
other things in derivative senses, across different categories and
even within the category of substance.</p>

<p>
Clearly the foundation of F&acirc;r&acirc;b&icirc;&rsquo;s account of
being is his distinction between being as the true and being as what
is circumscribed by a quiddity outside the soul. It is not immediately
obvious what he means by this distinction, and there is no obvious
precedent, either in Greek or in Arabic, for his notion of
&ldquo;circumscription&rdquo;. At first blush, &ldquo;being outside
the soul and in itself as it is in the soul&rdquo; and &ldquo;being
circumscribed by some quiddity outside the soul&rdquo; (or
&ldquo;having some quiddity outside the soul&rdquo;) sound similar,
although it is clear that F&acirc;r&acirc;b&icirc; wants them to be
very different. We might guess that the main difference is something
can have a quiddity outside the soul even if it is not represented in
the soul (as F&acirc;r&acirc;b&icirc; notes p.116,7); and in this
sense F&acirc;r&acirc;b&icirc; says that &ldquo;whatever is true is
also circumscribed by some quiddity outside the soul&rdquo; (I,91
p.117,20). But the deeper difference is that while &ldquo;being
circumscribed by some quiddity outside the soul&rdquo; is predicated
of an external object, being in the sense of &ldquo;true&rdquo;, i.e.,
&ldquo;being outside the soul as it is in the soul&rdquo;, is
predicated of something in the soul, and asserts that what is in the
soul has something outside the soul corresponding to it. So in I,89,
in discussing the kinds of existence [<em>wuj&ucirc;d</em>]
corresponding to each sense of &ldquo;being&rdquo;
[<em>mawj&ucirc;d</em>], F&acirc;r&acirc;b&icirc; says that &ldquo;the
existence [<em>wuj&ucirc;d</em>] of what is true is a certain relation
which
 thoughts<sup>[<a href="notes.html#note-24" id="ref-24">24</a>]</sup>
 have to something outside the soul&rdquo; (p.117,4&ndash;5).
F&acirc;r&acirc;b&icirc; is explicit that being in the sense of
&ldquo;true&rdquo; applies not only to the soul&rsquo;s judgments but
also to its concepts (I,88 p.116,3&ndash;5): to say of a concept that
it &ldquo;is&rdquo; in the sense of &ldquo;is true&rdquo; is to say
that it is instantiated. F&acirc;r&acirc;b&icirc; is apparently the
first person to have said that existence, in one sense of existence,
is a second-order predicate or second-order concept, a concept that is
predicated only of concepts; but, unlike Frege, he understands
concepts psychologistically, as mental
 states.<sup>[<a href="notes.html#note-25" id="ref-25">25</a>]</sup></p>
 
<p>
Despite F&acirc;r&acirc;b&icirc;&rsquo;s saying in I,91 (cited just
above) that being-as-having-a-quiddity-outside-the-soul is more widely
extended than being-as-true, it emerges from his later discussions
that, taking &ldquo;quiddity outside the soul&rdquo; in a strict
sense, having a quiddity outside the soul is <em>more</em> demanding,
and that we must first ask whether something <em>is</em> in the sense
of true, i.e., whether a given concept is instantiated outside the
soul, and only then, if the answer is yes, ask whether what
instantiates it is also circumscribed by a quiddity outside the soul.
If a concept is not instantiated outside the soul, such as (for
Aristotle and F&acirc;r&acirc;b&icirc;) the concept of vacuum, then,
while there vacuum has a quiddity-in-an-extended sense, since we can
ask &ldquo;what is vacuum?&rdquo; and answer the question by giving an
explanation of the name &ldquo;vacuum&rdquo;, a so-called
&ldquo;nominal definition&rdquo; which identifies what concept the
word &ldquo;vacuum&rdquo; stands for, nonetheless vacuum has no
quiddity in the proper sense, and certainly no quiddity outside the
soul (I,91 p.118,4&ndash;9). Even after we have determined &ldquo;that
what is understood by the expression is the same outside the
soul&rdquo;, we can still ask &ldquo;does it exist [<em>hal
mawj&ucirc;d</em>] or not?&rdquo;, meaning now not &ldquo;is it
true?&rdquo; but rather &ldquo;does it have some thing by which its
constitution [<em>qiw&acirc;m</em>] [is] and which is present in
it&rdquo; (III,229
 p.214,4&ndash;9).<sup>[<a href="notes.html#note-26" id="ref-26">26</a>]</sup>
 This will be &ldquo;one of the causes of its existence&rdquo;, so
that &ldquo;our saying &lsquo;does the thing exist?&rsquo; in the
second way&rdquo; is equivalent to &ldquo;does it have a cause by
which its constitution [is] in its essence?&rdquo; (III,229
p.214,11&ndash;13). For</p>

<blockquote>

<p>
not everything which is understood by some expression, such that what
is understood by it is also outside the soul, is such that it also has
an essence: like the meaning of &ldquo;privation&rdquo;, for it is a
meaning which is understood, and it is outside the soul as it is
understood, but it is not an essence and does not have an essence.
(III,240 p.218,12&ndash;15)</p>
</blockquote>

<p>
Examples of concepts which are instantiated, but whose instantiations
are not circumscribed by a quiddity, might include on the one hand
negations like not-a-horse or privations like blindness, and on the
other hand beings <em>per accidens</em>, i.e., accidental combinations
like white horse. Each of these will have a nominal definition which
identifies what concept the name stands for, but it will not have a
real definition expressing a real quiddity, &ldquo;the thing by which
its constitution [is] and which is in it&rdquo;: things can be
not-horses or blind through many different positive causes, and a
white horse will have a cause of being white and a cause of being a
horse, but no one cause that constitutes it as a white horse.</p>

<p>
In <em>Book of Letters</em> I,88&ndash;90 F&acirc;r&acirc;b&icirc;
describes not only the different senses of &ldquo;being
[<em>mawj&ucirc;d</em>]&rdquo;, but also the corresponding senses of
&ldquo;existence [<em>wuj&ucirc;d</em>]&rdquo;, i.e., that through
which a <em>mawj&ucirc;d</em> in each sense is <em>mawj&ucirc;d</em>.
As we have already seen, &ldquo;the existence [<em>wuj&ucirc;d</em>]
of what is true is a certain relation which thoughts have to something
outside the soul&rdquo; (p.117,4&ndash;5). The existence
[<em>wuj&ucirc;d</em>] of something which is a being
[<em>mawj&ucirc;d</em>] in the sense in which being is divided into
the categories will just be the category under which that thing falls,
which licenses calling it a being. F&acirc;r&acirc;b&icirc;&rsquo;s
treatment of the existence [<em>wuj&ucirc;d</em>] of something which
is a being [<em>mawj&ucirc;d</em>] in the sense of being circumscribed
by some quiddity outside the soul depends on whether it is a complex
(divisible) or a simple (indivisible) quiddity.</p>

<blockquote>

<p>
As for that whose quiddity is divisible, three [kinds of] things are
said to be its quiddity: (i) its unarticulated whole, (ii) [its whole]
articulated by the parts by which its constitution [is], (iii) each of
the parts of the whole, each of them through [?] the whole in turn.
Its whole is what its name signifies, and what is articulated by its
parts is what its definition signifies, and each of its parts is genus
and differentia, each in turn, or matter and form, each in turn. (I,88
p.116,8&ndash;13)</p>
</blockquote>

<p>
The existence [<em>wuj&ucirc;d</em>] of a being
[<em>mawj&ucirc;d</em>] circumscribed by a complex quiddity, but not
of a being circumscribed by a simple quiddity, can therefore be
distinguished from the being itself:</p>

<blockquote>

<p>
in the case of what is divided so that it has a whole and the
articulated [result] of this whole, the being [<em>mawj&ucirc;d</em>]
and the existence [<em>wuj&ucirc;d</em>] are different: the being is
[the thing] as a whole (this is the possessor of the quiddity) and the
existence is the quiddity of this thing, either articulated or each of
the parts of the whole, either its genus or its differentia, and since
its differentia is more proper to it, [the differentia] is more
appropriately called the existence which is proper to it. (I,89
p.117,1&ndash;4)</p>
</blockquote>

<p>
(F&acirc;r&acirc;b&icirc; adds that since the existence
[<em>wuj&ucirc;d</em>] of something which is a being in the sense of
falling under a category is the category or highest genus under which
it falls, this will also be its existence as a part of its quiddity,
so that being in the sense of falling under a category reduces to
being in the sense of having a quiddity, and the initial three senses
of being reduce to two, I,89 p.117,5&ndash;8 and I,90
p.117,14&ndash;19.) By contrast, &ldquo;everything whose quiddity is
indivisible either is a being which does not exist [<em>yak&ucirc;na
mawj&ucirc;dan l&acirc; y&ucirc;jadu</em>]&rdquo;&mdash;because the
finite verb &ldquo;exists&rdquo; is paronymous and would imply that
existence belongs to it as an accident&mdash;&ldquo;or else the
meaning of its existence and that it exists [<em>ma&#703;na
wuj&ucirc;dihi wa-annahu mawj&ucirc;dun</em>] are one and the same,
and that it is an existence [<em>wuj&ucirc;d</em>] and that it is a
being [<em>mawj&ucirc;d</em>] are one and the same meaning&rdquo;,
since its existence [<em>wuj&ucirc;d</em>] is not a further entity
explaining the fact that it is a being [<em>mawj&ucirc;d</em>], but is
just that being, which is simple and not explained by any further
cause to explain it (I,89 p.117,8&ndash;10). This will be true both of
each of the categories or highest genera (each category is an
undefinable highest genus, and not a composite of being as a genus and
some differentia added to being), and of &ldquo;whatever is not in a
subject and is not a subject of anything at all, for it is forever
simple in its quiddity&rdquo; (I,89
 p.117,10&ndash;13).<sup>[<a href="notes.html#note-27" id="ref-27">27</a>]</sup></p>
 
<p>
In all of this F&acirc;r&acirc;b&icirc; is broadly following the
Aristotelian idea that, for any composite object <em>X</em>, we can
ask &ldquo;what is <em>X</em>?&rdquo; and answer the question either
by giving a definition of <em>X</em> spelling <em>X</em> out into many
in-some-sense-constituents of <em>X</em>, or by giving some one such
constituent of <em>X</em>, which is a <em>partial</em> answer to
&ldquo;what is
 <em>X</em>?&rdquo;.<sup>[<a href="notes.html#note-28" id="ref-28">28</a>]</sup>
 F&acirc;r&acirc;b&icirc; is also following Aristotle in insisting
that all of the things which should be mentioned in the definition of
<em>X</em> are causes of <em>X</em>&rsquo;s being (&ldquo;the thing by
which [<em>X</em>&rsquo;s] constitution [is]&rdquo;), and,
furthermore, essential causes, in the sense that it is not simply that
some instance of <em>X</em> happens for this reason, but that a thing
wouldn&rsquo;t be <em>X</em> if it weren&rsquo;t caused in this way:
according to Aristotle in <em>Metaphysics</em> VIII,4, a scientific
definition of <em>X</em> should mention all and only such causes of
<em>X</em>. He is also following Aristotle in saying that this process
must come to a stop with simples, where there will be no further
definition and no distinction between the thing and any further answer
to &ldquo;what is it?&rdquo;. He also follows Aristotle further down,
in <em>Book of Letters</em> III,244, in saying that in asking for the
cause of <em>X</em>&rsquo;s being, we cannot look for a middle term
between the subject and predicate of &ldquo;<em>X</em> is [<em>X</em>
<em>mawj&ucirc;d</em>]&rdquo;, or between the subject and predicate of
&ldquo;<em>X</em> is <em>X</em>&rdquo;. Rather, we must unpack this
judgment so that its subject and predicate are different, so that we
can seek a middle term connecting them (&ldquo;why are there
eclipses?&rdquo; might be unpacked as &ldquo;why is the moon
eclipsed?&rdquo; or &ldquo;why is the moon darkened at
opposition?&rdquo;): if <em>X</em> is simple, so that
&ldquo;<em>X</em> is&rdquo; cannot be unpacked into a judgment with
distinct subject and predicate, then there is no further investigation
into why <em>X</em> is, and therefore also not into what <em>X</em>
 is.<sup>[<a href="notes.html#note-29" id="ref-29">29</a>]</sup>
 But F&acirc;r&acirc;b&icirc; is putting all of this in the service of
an argument which has no direct parallel in Aristotle, that, contrary
to the linguistic appearance of the paronymous term
<em>mawj&ucirc;d</em> (being or existent), a thing does not exist
through an accident of existence [<em>wuj&ucirc;d</em>] as it is white
through an accident of whiteness (so I,84, p.113,9&ndash;14, cited
above). If we say that <em>X</em> exists [<em>mawj&ucirc;d</em>] in
the sense that <em>X</em> is true, then the existence
[<em>wuj&ucirc;d</em>] of <em>X</em> is not an attribute of the real
thing <em>X</em> outside the mind, but only an attribute of the mental
concept of <em>X</em>, namely, that that concept is instantiated
outside the mind. If we say that <em>X</em> exists
[<em>mawj&ucirc;d</em>] in the sense that <em>X</em> is circumscribed
by a real quiddity, then the existence [<em>wuj&ucirc;d</em>] of
<em>X</em> is that quiddity: either it is the whole essence of
<em>X</em> as spelled out by its definition, or it is some part of the
essence of <em>X</em>, or if <em>X</em> is simple it is just
<em>X</em> itself, but in no case is it an accident of <em>X</em>.
(F&acirc;r&acirc;b&icirc; also says similar things about two-places
uses of <em>mawj&ucirc;d</em> as a tenseless copula &ldquo;<em>X</em>
is <em>Y</em>&rdquo;: particularly in I,101 he argues that
&ldquo;<em>X</em> is <em>Y</em>&rdquo; has a sense which does not
assert, e.g., that the quiddity of <em>X</em> is to be <em>Y</em>, or
that either <em>X</em> or <em>Y</em> have real quiddities outside the
mind. What it asserts is something like two-place being-as-truth, but
F&acirc;r&acirc;b&icirc; says that such a sentence need not assert
that something is <em>outside</em> the mind as it is in the mind,
since in some &ldquo;<em>X</em> is <em>Y</em>&rdquo; is true although
neither <em>X</em> nor <em>Y</em> exists outside the mind.)</p>

<p>
F&acirc;r&acirc;b&icirc;&rsquo;s distinction between being-as-true and
being-as-having-a-quiddity-outside-the-mind also allows him to resolve
the issue about whether being is univocal or whether it is said of one
thing (or of one kind of thing) primarily and of other things in a
dependent and derivative sense. Looking only at one-place cases,
being-as-true must be univocal to beings in all categories, and also
to beings in no category such as negations or privations and beings
<em>per accidens</em> like white horse. For I must be able to ask
&ldquo;is the concept of <em>X</em> instantiated?&rdquo; before I know
what category the instances of <em>X</em> will fall under, or even
whether <em>X</em> will turn out to be merely a privation, or an
accidental combination of two positive entities. (If <em>X</em> is
eclipse, we might reasonably start by keeping many of these options
open: only the investigation of actual eclipses, if it turns out that
there are some, will determine which option is right.) By contrast,
&ldquo;what has a quiddity outside the soul, although [being in this
sense] is general, is said by priority and posteriority in
order&rdquo; (I,92 p.118,14&ndash;16), since if the quiddity of
<em>X</em> involves a reference to <em>Y</em> as the cause of
existence to <em>X</em>, then <em>Y</em> has a prior and stronger
claim than <em>X</em> to have a quiddity outside the soul, rendering
it capable of independent existence. First, substances will be prior
in this way to accidents, since for an accident to be is for it to
belong to a substance, and the scientific definition of any kind of
accident will mention the kind of substance that it can be predicated
of. But then, within the category of substance, &ldquo;what requires a
differentia or genus in this category in order for its quiddity to be
realized is more deficient with respect to quiddity than the thing in
this category which is a cause of the realization of its
quiddity&rdquo;, and by pursuing causes of quiddities in this way we
can come to some first substance, &ldquo;whether this is one or more
than one&rdquo;, which has a stronger claim to the title of
&ldquo;being&rdquo; than all other substances, and <em>a fortiori</em>
than accidents (I,92 pp.118,18&ndash;119,4).</p>

<blockquote>

<p>
And if something is discovered outside all these categories which is
the
 cause<sup>[<a href="notes.html#note-30" id="ref-30">30</a>]</sup>
 of the realization of the quiddity of the most
 fundamental<sup>[<a href="notes.html#note-31" id="ref-31">31</a>]</sup>
 thing in this category [i.e., the category of substance], then this
*is more deserving to be called &ldquo;being&rdquo;
[<em>mawj&ucirc;d</em>] than the most perfect thing in this category,
and this is the first cause of existence [<em>wuj&ucirc;d</em>] to the
most perfect thing in this category, and this most perfect thing [sc.
within the category of substance] is the cause in the quiddity
 of*<sup>[<a href="notes.html#note-32" id="ref-32">32</a>]</sup>
 the other things in this category, and what is in this category is
the cause in the quiddity of the other categories: thus the beings,
where what is meant by &ldquo;being&rdquo; is what has a quiddity
outside the soul, are ordered by this order. (I,92
p.119,4&ndash;8)</p>
</blockquote>

<p>
It was traditional enough to say that God (and only God) is being in
the strictest sense, and is the cause of existence to all other
beings. But F&acirc;r&acirc;b&icirc;&rsquo;s version is importantly
different. F&acirc;r&acirc;b&icirc; is taking up Aristotle&rsquo;s
program of defining each thing through its essential cause, and
arguing that this kind of cause of <em>X</em>&rsquo;s existing (such
that something would not be an <em>X</em> if it were caused in some
other way) is the <em>existence</em> [<em>wuj&ucirc;d</em>] of
<em>X</em> and has a stronger claim to the title of being
[<em>mawj&ucirc;d</em>] than <em>X</em>: if this causal chain leads
ultimately to God, so that God is ultimately involved in the quiddity
of each other thing, then F&acirc;r&acirc;b&icirc; will have a
scientific Aristotelian way of filling in the program of the <em>Aims
of the Metaphysics</em>, of showing how an analysis of being and of
its causes (once we grasp the relevant senses of being and of cause)
will lead to God as the first cause of being and universal first
principle. As this is presented in the <em>Book of Letters</em>, it is
just a program for research, which might or might not lead up to a
single first cause of existence from which all other beings can be
derived carried out. But in the <em>Perfect City</em> and the
<em>Political Regime</em> F&acirc;r&acirc;b&icirc; gives at least a
sketch of the upward causal argument to God as a single first cause of
existence, and of the downward path from God to all other beings.
F&acirc;r&acirc;b&icirc; sees a charter for this causal investigation
of the existence of thing especially in Aristotle&rsquo;s
<em>Posterior Analytics</em> II.</p>

<h3 id="FaraScieQuesAbouBein">3.5 F&acirc;r&acirc;b&icirc; on the scientific questions about being</h3>

<p>
F&acirc;r&acirc;b&icirc; further develops the discussion of the
relation between a being and its existence, in different senses of
&ldquo;existence&rdquo;, in <em>Book of Letters</em> III. Here he is
officially continuing the discussion of particles by explaining the
meanings of various interrogative particles in different
&ldquo;syllogistic arts&rdquo;: the main interest is to explain the
distinctive meanings these particles have in demonstrative science,
and to warn against confusing them with the meanings they have in
other disciplines. This resembles the discussion in <em>Book of
Letters</em> I, but the particles (and &ldquo;logical&rdquo; particles
which are grammatically nouns in Arabic) discussed in <em>Book of
Letters</em> I correspond roughly to those discussed in
Aristotle&rsquo;s <em>Metaphysics</em> V; <em>Book of Letters</em>
III, by contrast, picks up issues from <em>Posterior Analytics</em>
II. There Aristotle discusses the different kinds of scientific
&ldquo;question&rdquo; or &ldquo;investigation&rdquo;
[<em>z&ecirc;t&ecirc;sis</em>], and he specifies each one by an
interrogative particle (&ldquo;whether&rdquo;, &ldquo;what&rdquo;,
&ldquo;why&rdquo;). But Aristotle is interested mainly in the methods
the scientist uses to <em>answer</em> these questions; nobody before
F&acirc;r&acirc;b&icirc; had thought there was a distinctive
scientific meaning of the particles themselves. But Aristotle does
talk about how the scientist should investigate whether something is,
what something is, and why something is, and F&acirc;r&acirc;b&icirc;
takes this discussion as giving not just a methodology but a
scientific account of existence and quiddity, i.e., of the scientific
meanings of the particles &ldquo;whether&rdquo; and
&ldquo;what&rdquo;.</p>

<p>
Aristotle discusses there four types of scientific question or
investigation, &ldquo;whether <em>X</em> is&rdquo;, &ldquo;what
<em>X</em> is&rdquo;, &ldquo;whether <em>X</em> is <em>Y</em>&rdquo;,
and &ldquo;why <em>X</em> is <em>Y</em>&rdquo;. His main claim is that
the investigation <em>what</em> <em>X</em> is stands to the
investigation <em>whether</em> <em>X</em> is, as the investigation
<em>why</em> <em>X</em> is <em>Y</em> stands to the investigation
<em>whether</em> <em>X</em> is <em>Y</em>. So in order to determine
<em>what</em> <em>X</em> is, we must first investigate
<em>whether</em> <em>X</em> is, and then, if the answer is yes,
investigate <em>why</em> <em>X</em> is. An answer to <em>why</em>
<em>X</em> is can be converted into a scientific answer to
<em>what</em> <em>X</em> is; where to discover <em>why</em> <em>X</em>
is, we must reformulate the judgment &ldquo;<em>X</em> is&rdquo; as a
two-place judgment with distinct subject and predicate terms, and then
look for a middle term connecting them. In the standard example, if
<em>X</em> is (lunar) eclipse, before we can scientifically
investigate what eclipses are, we must first investigate whether there
are eclipses; if there are, and if the nominal definition of (lunar)
eclipse is &ldquo;darkening of the moon at opposition&rdquo;, then we
investigate why the moon is sometimes darkened at opposition; and if
we conclude that this is due to the interposition of the earth between
the moon and the sun, we can convert this into a scientific definition
of eclipse as &ldquo;darkening of the moon at opposition due to the
interposition of the earth between the sun and the moon&rdquo;.
F&acirc;r&acirc;b&icirc; takes all this up in <em>Book of Letters</em>
III,226 and following, under the headings of the scientific meanings
of the particles &ldquo;whether&rdquo;, &ldquo;what&rdquo;, and
&ldquo;why&rdquo;: or rather, when he says &ldquo;whether <em>X</em>
exists&rdquo; (or &ldquo;does <em>X</em> exist?&rdquo;, <em>hal
<em>X</em> mawj&ucirc;dun</em>), <em>both</em> the word
&ldquo;whether&rdquo; and the word &ldquo;exists&rdquo; are logically,
if not grammatically, particles. F&acirc;r&acirc;b&icirc; follows
Aristotle in saying that there is an ordered series of questions or
investigations: first we must ask <em>whether</em> <em>X</em> exists,
and only then, if the answer is yes, can we ask <em>what</em>
<em>X</em> is, by asking <em>why</em> <em>X</em> exists. But
F&acirc;r&acirc;b&icirc;&rsquo;s story is more complicated than
Aristotle&rsquo;s, because he distinguishes different senses both of
&ldquo;whether <em>X</em> exists&rdquo; and of &ldquo;what <em>X</em>
is&rdquo;. Fundamentally, F&acirc;r&acirc;b&icirc; thinks that there
is a series of four questions: first &ldquo;what <em>X</em> is&rdquo;
seeking the nominal definition of <em>X</em>, which spells out the
concept of <em>X</em> in the soul; then &ldquo;whether <em>X</em>
is&rdquo; in the sense of being-as-the-true, asking whether <em>X</em>
exists outside the soul as it does in the soul; then &ldquo;whether
<em>X</em> is&rdquo; in the sense of being as having a quiddity
outside the soul, asking rather &ldquo;does it have some thing by
which its constitution [<em>qiw&acirc;m</em>] [is] and which is
present in it&rdquo; (III,229 p.214,6&ndash;7, cited above); then
&ldquo;what <em>X</em> is&rdquo; seeking the quiddity of <em>X</em>
outside the soul, namely this thing present in <em>X</em> which is the
cause of <em>X</em>&rsquo;s constitution. The <em>Posterior
Analytics</em> has nothing corresponding to the distinction between
the two &ldquo;whether <em>X</em> is&rdquo; questions, but
<em>Posterior Analytics</em> II,2 does say that when we
ask/investigate whether <em>X</em> is <em>Y</em>, or whether
<em>X</em> <em>is</em>, we are asking &ldquo;whether there is a middle
term for it&rdquo;, and that when we then ask/investigate <em>why</em>
<em>X</em> is <em>Y</em>, or <em>what</em> <em>X</em> is, we are
asking &ldquo;what that middle term is&rdquo; (89b37&ndash;90a1). And
F&acirc;r&acirc;b&icirc; argues that this requires a distinctive
meaning of &ldquo;is&rdquo; in the question &ldquo;whether <em>X</em>
is&rdquo;, since <em>X</em> could exist in the sense that it is
outside the soul as it is in the soul, without there being a middle
term between some subject and some predicate which would cause
<em>X</em>&rsquo;s existence. There are at least two ways this could
happen. First, if <em>X</em> is a privation or even
&ldquo;privation&rdquo; in general (see III,240 p.218,12&ndash;15,
quoted above), or presumably also if <em>X</em> is an <em>ens per
accidens</em> like white horse, there simply is nothing outside the
mind by which <em>X</em> is constituted. Second, if <em>X</em> has/is
a <em>simple</em> quiddity, then &ldquo;<em>X</em> is&rdquo; cannot be
expanded into a sentence &ldquo;<em>Y</em> is <em>Z</em>&rdquo; where
there might be a middle term between the subject and the predicate. So
once we have established that <em>X</em> exists outside the soul, we
must still investigate whether <em>X</em> is constituted by some cause
outside the soul, and then what that cause is.</p>

<p>
F&acirc;r&acirc;b&icirc; takes this result as indicating that
dialectic and demonstrative science give different meanings, not only
to the &ldquo;what is <em>X</em>?&rdquo; question and thus to quiddity
(dialectic seeking a nominal definition, science a causal definition),
but also to the &ldquo;whether <em>X</em> is&rdquo; question and thus
to existence. So he says that, as in dialectic the two-place
investigation &ldquo;whether <em>X</em> is <em>Y</em>&rdquo; is only
concerned with the copula (not with whether it is essential
predication), so in dialectic the one-place investigation
&ldquo;whether <em>X</em> is&rdquo; is asking only about being as the
true, i.e., about whether the concept of <em>X</em> is instantiated
(III,246&ndash;7). He connects this with an inherited problem in
Aristotle&rsquo;s dialectic: in the <em>Topics</em> Aristotle
classifies dialectical problems as asking whether <em>Y</em> is an
accident of <em>X</em>, whether <em>Y</em> is the genus of <em>X</em>,
whether <em>Y</em> is proper to <em>X</em>, or whether <em>Y</em> is
the definition of <em>X</em>&mdash;so how should we treat the question
whether <em>X</em> exists? As F&acirc;r&acirc;b&icirc; says, Alexander
of Aphrodisias in his commentary on the <em>Topics</em> classifies
questions of existence as questions of accident, treating the
existence of <em>X</em> as an accident of <em>X</em>. And
F&acirc;r&acirc;b&icirc; says that he is right to do so, since
dialectic is asking whether the concept of <em>X</em> in the mind is
instantiated outside the mind, and this belongs as an accident to the
concept of <em>X</em>. However, if we mean whether the real thing
<em>X</em> outside the mind is constituted by some quiddity, or
whether <em>X</em> falls under one of the categories, then we would be
asking whether something belongs to <em>X</em> as its genus or
definition. F&acirc;r&acirc;b&icirc; also says that different
particular sciences give different meanings to these questions.
Notably, in physics the questions &ldquo;whether <em>X</em> is&rdquo;
and &ldquo;what <em>X</em> is&rdquo; are asking for <em>any kind</em>
of cause of <em>X</em>&rsquo;s existing, whether that cause is
internal to <em>X</em> or not (III,237)&mdash;it could be an extrinsic
efficient or final cause, like the earth blocking sunlight from
reaching the moon, which would be incorporated into a physical
definition, as in this case of eclipse. Most importantly, in
&ldquo;the divine science&rdquo;, if we ask whether God <em>is</em>,
and if we mean by this whether there is some cause through which God
is
 constituted,<sup>[<a href="notes.html#note-33" id="ref-33">33</a>]</sup>
 then while this is a legitimate question the answer can only be no
(III,238&ndash;9 and III,243). Nonetheless, we can still ask of God
&ldquo;whether he is some circumscribed essence&rdquo; (III,240,
p.218,11), and we can discover that he is, not because we can give a
definition analyzing that essence into simpler terms, but because in
analyzing other beings and seeking their causal definitions, tracing
them back step by step to their causes, we discover that they all lead
ultimately to a single first cause of their existence, so that God
enters into the fully spelled out quiddities of everything else
(III,251). Because we learn in this way that God is simple and
dependent on no cause, we can ask &ldquo;whether his existence is an
existence which, in order for him to exist through it, needs nothing
other than itself in any way&rdquo; (III,242 p.220,1&ndash;2), neither
a substratum nor an efficient cause, and the answer is yes. So too in
the divine science, if we ask &ldquo;whether God is <em>X</em>&rdquo;
for some predicate <em>X</em> (whether God is an intelligence, is
knowing, is one, is a maker or cause of something else&rsquo;s
existing, III,242 p.220,2&ndash;5), and if we mean by that
&ldquo;whether there is a middle term for it&rdquo; as <em>Posterior
Analytics</em> II,2 suggests, i.e., a cause to God of his being
<em>X</em>, such as an accident inhering in God, or a part of
God&rsquo;s essence distinct from the whole essence, then again the
answer can only be no. But we can also mean</p>

<blockquote>

<p>
whether the existence by which his constitution is not by anything
other than he, is that he is intelligence and knowing, and whether his
essence is that he is intelligence,</p>
</blockquote>

<p>
and in asking whether he is the cause or agent of something
else&rsquo;s existing we can mean</p>

<blockquote>

<p>
whether his existence by which he is existent, or his quiddity which
specifies him, or which belongs to him, necessitates that he is a
cause of the existence of something other than he, or the maker of
something other than he. (III,242 p.220,3&ndash;6)</p>
</blockquote>

<p>
And again we discover, by tracing back the causes of things to a first
cause which needs nothing beyond itself to know and to produce, that
the answer is yes. This text is a charter for the theological parts of
the <em>Perfect City</em> and <em>Political Regime</em>, discussed in
 <a href="#FaraPhilTheoPerfCityPoliRegi">Section 4</a>
 below.</p>

<h3 id="OneUnitSensUnitDiffRelaBetwOneManyCircThinQuid">3.6 <em>On the One and Unity</em>: senses of unity, different relations between one and many, and the circumscription of a thing by its quiddity</h3>

<p>
To F&acirc;r&acirc;b&icirc;&rsquo;s &ldquo;general
metaphysics&rdquo;&mdash;his study of being and its universal
attributes, rather than of God as the first cause of
being&mdash;belongs not only the <em>Book of Letters</em> but also
<em>On the One and Unity</em>. F&acirc;r&acirc;b&icirc; in <em>On the
Aims of the Metaphysics</em> had included unity alongside being in the
object of metaphysics; and when <em>Book of Letters</em> I follows the
agenda and many of the subject-headings of Aristotle&rsquo;s
&ldquo;lexicon&rdquo; in <em>Metaphysics</em> V, it is strange that it
leaves out unity, which Aristotle treats in <em>Metaphysics</em> V,6.
But the treatment of unity, missing from the <em>Book of Letters</em>,
is supplied by <em>On the One and Unity</em> [henceforth <em>On the
One</em>]. Since the <em>Book of Letters</em> as is incompletely
transmitted, it is not entirely out of the question that <em>On the
One</em> is a missing part of the <em>Book of Letters</em>. Perhaps
more likely, <em>On the One</em> was originally intended as a part of
the <em>Book of Letters</em>, but got too long and complicated, and
was spun off as a separate treatise. The treatise is too complicated
and too little-studied (with major editorial problems) to treat here
in full detail, but we can describe some major themes. The treatise is
helpful in understanding the notion of circumscription by a quiddity,
which is thematized both in the <em>Book of Letters</em> and <em>On
the One</em> and used without explanation in the <em>Perfect City</em>
and <em>Political Regime</em>, and also in understanding
F&acirc;r&acirc;b&icirc;&rsquo;s explanation of Aristotle&rsquo;s
claim in <em>Metaphysics</em> IV,2 that being and unity are
coextensive and mutually entailing, and his account in the <em>Perfect
City</em> and <em>Political Regime</em> of how unity is predicated of
God.</p>

<p>
Main themes of the treatise include distinguishing a whole family of
senses of &ldquo;one&rdquo; (in a few cases F&acirc;r&acirc;b&icirc;
also gives the corresponding senses of the abstract
&ldquo;unity&rdquo;), but also and especially distinguishing different
ways that senses of &ldquo;one&rdquo; are related to senses of
&ldquo;many&rdquo;. The treatise can read like a dry catalogue, and
F&acirc;r&acirc;b&icirc; rarely gives arguments or admits that his
claims might be controversial, but it is often clear that he has an
opponent in mind. That opponent might be a type rather than a
particular earlier philosopher, but it seems likely that it is
specifically al-Kind&icirc;. Kind&icirc; had argued in <em>On First
Philosophy</em> that any thing other than God that is called
&ldquo;one&rdquo; is many as well as one, and therefore that it is one
not essentially but only accidentally, indeed that it is one only
improperly or &ldquo;metaphorically&rdquo;; and he argues that such a
thing can be one only through participation in some unity extrinsic to
it, which (to avoid infinite regress) must be purely one and not also
many. Kind&icirc; also argues that any many is a collection of ones:
and since everything is either one or many, and any many depends on
ones, and any one depends on a <em>pure</em> one, and God is the only
pure one, everything owes its existence directly or indirectly to God.
While Kind&icirc;, like F&acirc;r&acirc;b&icirc;, gives a long list of
different kinds of things that can be said to be one, and while he has
different reasons for disqualifying each of them from being a pure
one, i.e., a one that is not also many, typically he seems to think
that each of these senses of &ldquo;one&rdquo; is predicated of some
subject which is many, so that if the unity were removed, that
underlying multiplicity would remain. Kind&icirc; infers that each of
these ones is a many-that-is-one, and therefore that it has contrary
attributes, and therefore that it is not essentially one, and even
that it is only metaphorically one, since (as he argues in a tradition
going back to Zeno of Elea and to the first Hypothesis of
Plato&rsquo;s <em>Parmenides</em>) for something to be truly one is
for it not to be many in any way, e.g., by having many
 constituents.<sup>[<a href="notes.html#note-34" id="ref-34">34</a>]</sup></p>
 
<p>
F&acirc;r&acirc;b&icirc; by contrast maintains, following Aristotle in
<em>Metaphysics</em> IV,2, that unity is coextensive with being, and
that both &ldquo;one&rdquo; and &ldquo;being&rdquo; are truly and
properly said of many things. Indeed, F&acirc;r&acirc;b&icirc; claims,
not just that these many things are each truly being and truly one,
but that they are <em>essentially</em> so, i.e., that they are not
being and one [<em>mawj&ucirc;d</em>, <em>w&acirc;&#7717;id</em>]
through an existence or unity [<em>wuj&ucirc;d</em>,
<em>wa&#7717;da</em>] which is accidental to them or extrinsic to
their quiddity, as something is white through an accident of
whiteness. There are senses of being, notably being as the true, in
which existence is accidental, but in the primary sense of being, and
the sense of primary interest to the metaphysician, the things&rsquo;s
existence is its quiddity or part of its quiddity; and so too,
F&acirc;r&acirc;b&icirc; claims, for the unity corresponding to the
sense of &ldquo;one&rdquo; of primary interest to the metaphysician,
which is convertible with this sense of &ldquo;being&rdquo;. In order
for F&acirc;r&acirc;b&icirc; to deflect Kind&icirc;&rsquo;s arguments
against the claim that there are many things that are each truly and
essentially one, it is crucial for him not only to distinguish
different senses of &ldquo;one&rdquo;, but also to distinguish
different ways that senses of &ldquo;one&rdquo; can be related to
senses of &ldquo;many&rdquo;. F&acirc;r&acirc;b&icirc; distinguishes
between a many that is the <em>subject</em> of a one, a many that is
<em>opposite</em> to a one, and a many that <em>arises from</em> a
one. When F&acirc;r&acirc;b&icirc; says that some sense of
&ldquo;many&rdquo; is the <em>opposite</em> of some sense of
&ldquo;one&rdquo;, he apparently means that these kinds of unity and
multiplicity are contraries or that one of them is the privation of
the other. When he talks about a many that <em>arises</em> from a one,
he seems to mean what Aristotle calls a many that is &ldquo;measured
by&rdquo; a one, i.e., a many composed out of ones of this type, so
that the one or unit can be used to count the many. (Aristotle says in
<em>Metaphysics</em> <em>X</em> that in this kind of one-many
relationship the unity and the multiplicity are <em>correlatives</em>,
as the measure and the measured, whereas when one and many are related
as indivisible and divisible, unity as indivisibility is a
<em>privation</em> of multiplicity as divisibility. Or perhaps he
really means that, although from the point of view of our language and
our concepts divisibility is the more basic and indivisibility is its
privation, in reality indivisibility is basic and divisibility is its
privation. In Aristotle&rsquo;s terminology, possession and privation
are one kind of opposites, contraries are another, contradictories are
another, and correlatives are yet another. But
F&acirc;r&acirc;b&icirc; apparently does not count correlatives here
as opposites.)</p>

<p>
F&acirc;r&acirc;b&icirc; grants to his implicit opponent that some
senses of &ldquo;one&rdquo; do presuppose a many as their subject, so
that if the one were removed the many would remain. There are
two-place senses of &ldquo;one&rdquo;, as there are two-place senses
of &ldquo;being&rdquo;: for instance, we can say &ldquo;<em>X</em> and
<em>Y</em> are one in species&rdquo;. Or perhaps it is better to say,
not that these are two-place senses of &ldquo;one&rdquo;, but that
they are plural-subject senses, since we can equally well say
&ldquo;<em>X</em> and <em>Y</em> and <em>Z</em> are one in
species&rdquo;. In any case F&acirc;r&acirc;b&icirc; grants that there
are several senses of &ldquo;one&rdquo; which presuppose a many as
their subject. Perhaps surprisingly, F&acirc;r&acirc;b&icirc; includes
here not only &ldquo;one in species&rdquo; and the like but also
&ldquo;one in number&rdquo;: he thinks that the appropriate expression
is not, e.g., &ldquo;Aristotle is one in number&rdquo; but
&ldquo;Plato&rsquo;s best student and Alexander&rsquo;s teacher are
one in number&rdquo;. Also perhaps surprisingly, he tries to trace
back the other plural-subject senses of &ldquo;one&rdquo; to
&ldquo;one in number&rdquo;, saying for instance that if <em>X</em>
and <em>Y</em> are one in species, then the species of <em>X</em> and
the species of <em>Y</em> are one in number (#1&ndash;#8).
F&acirc;r&acirc;b&icirc; also grants that there are some senses even
of the one-place predication &ldquo;<em>X</em> is one&rdquo; which
presuppose, not a plural subject, but still a subject consisting of
many parts, so that for <em>X</em> to be one is for <em>X</em>&rsquo;s
parts to be related in an appropriate way. For instance, for
<em>X</em> to be one as continuous is for <em>X</em> to have parts
whose limits are the same; for <em>X</em> to be one as contiguous is
for <em>X</em> to have parts whose limits, while not the same, are
kept in contact by some bond; for <em>X</em> to be one as whole as for
<em>X</em> to have all the parts it needs in order to perform its
activity well (#9&ndash;#15). But F&acirc;r&acirc;b&icirc; says that
where many things are said to be one, or where something is said to be
one in a way presupposing that it has many parts, this sense of
&ldquo;many&rdquo; and this sense of &ldquo;one&rdquo; are not
opposite: nothing is predicated of its opposite. Thus the opposite of
one-in-number is many-in-number, but the subject of one-in-number is
many names or descriptions of the same thing; the opposite of
one-as-continuous is discretely many things disconnected from each
other, but the subject of one-as-continuous is magnitude.
F&acirc;r&acirc;b&icirc; insists equally emphatically that there are
senses of &ldquo;one&rdquo; that are not plural-subject senses and do
not presuppose a subject with many parts, and indeed in some cases
contradict having a subject with many parts. One sense of
&ldquo;one&rdquo; is as &ldquo;undivided&rdquo; or
&ldquo;indivisible&rdquo; (the Arabic phrase, like the Greek word, is
ambiguous between these two construals). Or perhaps rather, as
F&acirc;r&acirc;b&icirc; suggests at the end of the treatise, all
senses of &ldquo;one&rdquo; can be traced back in one way or another
to being undivided (#95). Certainly there are many ways that something
could be divided, and filling them out leads to different senses of
one-as-undivided or one-as-indivisible. For instance, as
F&acirc;r&acirc;b&icirc; notes, &ldquo;one&rdquo; is said of something
extended that is divisible but not actually divided; of something that
is spatially located but quantitatively indivisible, i.e., a point; of
what is not spatially located and is therefore quantitatively
indivisible; of what has (or is) a simple quiddity not divisible into
parts of a definition such as genus and differentia; and of what is
not &ldquo;divided&rdquo; between a paronymously named subject
<em>X</em> and an <em>X</em>-ness through which it is <em>X</em>
(#20&ndash;24). Some of these senses of &ldquo;one&rdquo;, such as one
in the sense of an indivisible point, are <em>never</em> predicated of
a many. Something can also be called one because it does not have a
partner, i.e., because is the <em>only</em> F, for some predicate F,
or if nothing else is F in the same way that it is F; and especially
if F is its quiddity, as, e.g., the moon can be called
&ldquo;one&rdquo; in the sense that there is nothing else of the same
species as it (#25, pp.55&ndash;6). This sense of &ldquo;one&rdquo;,
too, does not presuppose any plurality in its subject.
F&acirc;r&acirc;b&icirc; also talks about different senses of
&ldquo;one&rdquo; as &ldquo;circumscribed&rdquo; in some way (see
below): at least some of these senses do not presuppose any plurality
in their subject, and apparently in all these senses, if the subject
that is one were stripped of its unity, it would not become many
instead. F&acirc;r&acirc;b&icirc; apparently does not say that
&ldquo;one&rdquo; in such a sense does not have an opposite, but it
does not have an opposite that is a sense of &ldquo;many&rdquo;: the
opposite of &ldquo;one&rdquo; in such a sense would be the
<em>contradictory</em>, &ldquo;not one&rdquo;, but not a contrary or
privative &ldquo;many&rdquo;.</p>

<p>
F&acirc;r&acirc;b&icirc; also insists that the many <em>arising
from</em> some sense of &ldquo;one&rdquo;, i.e., a many composed out
of things that are each one in this sense, is not the many
<em>opposite to</em> this sense of &ldquo;one&rdquo;, although he
admits that in some cases the many arising from the one and the many
opposite to the one are the same <em>per accidens</em>
(#37&ndash;#49). As before, there are senses of &ldquo;one&rdquo; that
do not have an opposite sense of &ldquo;many&rdquo;. There are also
senses of &ldquo;one&rdquo; that do have an opposite sense of
&ldquo;many&rdquo;, but where the many that arises from the one is not
the same as the many that is opposite to the one. Thus the many
arising from the one as a point (the one as what is indivisible
although spatially located) is many points, while the opposite of the
one as a point is a continuous extension. The many arising from the
one as having-no-partner-in-its-species might be a plurality like a
unique moon and a unique sun (or a unique phoenix), each without a
partner in its distinct species, whereas the opposite of
having-no-partner-in-its-species is having-a-partner-in-its-species.
The opposite of the one as indivisible quiddity is a divisible
quiddity; the many arising from the one as indivisible quiddity is
several indivisible quiddities, which <em>could</em> be a divisible
quiddity if, say, one of them is an unanalyzable genus and the others
are successive unanalyzable differentiae of that genus, but the
several indivisible quiddities <em>need not</em> be a single quiddity
at all. But, beyond these examples, F&acirc;r&acirc;b&icirc;&rsquo;s
basic point is that, in the many <em>arising</em> from a one, the one
is an essential constituent of the many, &ldquo;a part by which its
constitution [is]&rdquo; (#62, p.75): and so it can no more be
opposite to this one than a species can be opposite to its constituent
genera and differentiae. And likewise, if a one, in some sense of
&ldquo;one&rdquo;, is what it is by being a unit, a constituent of a
many, then it cannot be opposite to that many, even if there is some
<em>other</em> sense of &ldquo;many&rdquo; which is its opposite.</p>

<p>
When F&acirc;r&acirc;b&icirc; says that there are senses of
&ldquo;one&rdquo; which do not presuppose any plurality and which have
no opposite except a bare contradictory&mdash;so that there is no
sense of &ldquo;many&rdquo; <em>opposite</em> to these senses of
&ldquo;one&rdquo;, although there is a sense of &ldquo;many&rdquo;
<em>arising</em> from each such sense of &ldquo;one&rdquo;&mdash;he is
interested above all in the sense of &ldquo;one&rdquo; as
&ldquo;circumscribed by a quiddity&rdquo; (first introduced #17).
F&acirc;r&acirc;b&icirc; does not assume that the reader will already
be familiar with this analysis of a special sense of
&ldquo;one&rdquo;: he tries to build up to it from other senses of
&ldquo;one&rdquo; as &ldquo;circumscribed&rdquo; in some other way. He
starts by talking about a &ldquo;body circumscribed by a limit that
specifies [<em>takhu&#7779;&#7779;u</em>] it&rdquo; (#16, p.50).
&ldquo;Circumscribed&rdquo; here has a straightforward literal sense:
the body is surrounded on all sides by its limit or boundary.
&ldquo;Specifies&rdquo; adds that everything inside that limit is the
body, and everything outside that limit is not the body. This may
connect with &ldquo;one&rdquo; as having no partner in some property,
since the body is the only thing inside its limit.
F&acirc;r&acirc;b&icirc; passes from &ldquo;one&rdquo; as a body to a
circumscribed by a limit to &ldquo;one&rdquo; as a body circumscribed
by a place, where a body&rsquo;s place is, on the Aristotelian
analysis, not the limit of the body itself but the limits of the
bodies that surround it. Here again, everything that is in the place
is the body, and everything that is not in the place is not the body.
Thus the limit, or the place, contributes in two ways to making the
body one: it makes the parts of the body one with each other, and it
makes the body one body distinguished from other bodies, with which it
yields the many that &ldquo;arises from&rdquo; this sense of one. The
unity [<em>wa&#7717;da</em>] corresponding to these senses of
&ldquo;one&rdquo; [<em>w&acirc;&#7717;id</em>] is presumably the
circumscription [<em>in&#7717;iy&acirc;z</em>] by the limit or the
place, which is an accident of an underlying
 subject.<sup>[<a href="notes.html#note-35" id="ref-35">35</a>]</sup>
 But F&acirc;r&acirc;b&icirc; denies that if this unity were removed,
its subject would thereby become a many: rather, it would fuse with
other things into a larger one when the circumscription separating
them from each other is removed (#28). Still, these kinds of unity do
<em>also</em> unify a divisible subject, as do the unity of what is
one as continuous or contiguous or whole. But F&acirc;r&acirc;b&icirc;
is building up to a less familiar but more fundamental, non-spatial
kind of circumscription which has only the function of distinguishing
a one from other ones and not the function of uniting a plurality.
F&acirc;r&acirc;b&icirc; talks about the circumscription of a thing by
any attribute, which would include limits and places and other
accidents such as qualities (some examples at #78), but he
concentrates overwhelmingly on the circumscription of a thing by its
quiddity. This can happen at different levels of generality&mdash;it
can be a specific or a generic quiddity (#27). What is circumscribed
by a quiddity, unlike what is circumscribed by a limit or a place,
need not be a body and need not be divisible, but can be as general as
&ldquo;being&rdquo; or &ldquo;thing&rdquo; (#64). In some cases, if a
thing&rsquo;s circumscription by its quiddity were removed, it would
fuse into a one with other ones when it the attributes distinguishing
it from these others are removed, as a body circumscribed by a limit
or place would fuse into a one with other bodies when its
circumscription by its limit or place is removed. If a thing&rsquo;s
circumscription by its specific quiddity were removed, it would still
be circumscribed by its generic quiddity, and would fuse into a one
with the other things in its genus, but if <em>all</em>
circumscription by a quiddity were removed from it, there would no
longer be anything left at all (#27). So there is no opposite to this
sense of &ldquo;one&rdquo; except sheer non-being (#27): there is a
sense of &ldquo;many&rdquo; <em>arising from</em> this sense of
&ldquo;one&rdquo;, but it is not <em>opposite to</em> this sense of
&ldquo;one&rdquo; (#49). The cases of circumscription by a limit or a
place might wrongly lead us to think that whenever something is called
&ldquo;one&rdquo; its unity is an accident attaching to some
underlying subject, but in the present case if the unity were removed
the quiddity would be destroyed. F&acirc;r&acirc;b&icirc; does seem to
distinguish a thing&rsquo;s unity in this sense from its quiddity when
he says that the unity of a species, as circumscribed by its specific
quiddity, is the differentia by which it is circumscribed from other
species of its genus (#78): but this is still essential to the thing,
and we know from the <em>Book of Letters</em> that the differentia can
be called the existence of the thing, as here it is called the unity
of the thing.</p>

<p>
F&acirc;r&acirc;b&icirc; says that what is one in the strongest
[<em>a&#7717;r&acirc;</em>] sense is what is circumscribed by a
quiddity (#78). He says equally that what is circumscribed by a
quiddity is &ldquo;circumscribed by its portion [or allotment] of
existence [<em>qis&#7789; al-wuj&ucirc;d</em>]&rdquo; (#17), i.e., by
its being what it is: this being-what-it-is is described in the
<em>Book of Letters</em> as the existence [<em>wuj&ucirc;d</em>] of
the thing, and <em>On the One and Unity</em> argues that it is also
the thing&rsquo;s unity [<em>wa&#7717;da</em>].
F&acirc;r&acirc;b&icirc; uses this analysis to try to make good on
Aristotle&rsquo;s programmatic claim in <em>Metaphysics</em> IV,2 that
being and one are mutually entailing and in a way equivalent, or that
there is a sense of &ldquo;being&rdquo; and a sense of
&ldquo;one&rdquo;, or a family of senses of &ldquo;being&rdquo; and a
corresponding family of senses of &ldquo;one&rdquo; which are mutually
entailing and in a way equivalent. Thus here in <em>On the One</em>
#17 he says that &ldquo;one&rdquo; in <em>this</em> meaning, i.e., the
meaning &ldquo;circumscribed by a quiddity&rdquo;, is mutually
entailing or equivalent [<em>mus&acirc;wiq</em>] with being. So
&ldquo;one&rdquo; in this sense needs to apply to things in all
categories, not just substances, and indeed F&acirc;r&acirc;b&icirc;
says that in #17, and he adds that it also applies to &ldquo;other
things, if there are any outside the categories&rdquo; (#17, p.51,
compare the <em>Book of Letters</em> on a possible ascent to a first
cause of being to substances which would itself be outside all
categories including substance). Again, if &ldquo;one&rdquo; in this
sense is necessarily coextensive with being, F&acirc;r&acirc;bi needs
to say that not only species and genera but also individual substances
(and individual qualities and so on) are each circumscribed by their
own quiddity&mdash;not merely by a shared quiddity and an individual
place or other accidental attributes&mdash;so that there are
<em>many</em> things in each species, in the sense of
&ldquo;many&rdquo; arising from this sense of &ldquo;one&rdquo;.</p>

<blockquote>

<p>
The meaning [<em>ma&#703;n&acirc;</em>] of human [i.e., the species
human] is circumscribed and isolated from what is not human, i.e.,
horse and so on, and <em>this</em> human is circumscribed from
<em>that</em> human by a circumscription more perfect [or complete]
than the circumscription of human from horse. (#64, p.78)</p>
</blockquote>

<p>
F&acirc;r&acirc;b&icirc; is thus committed to individual quiddities,
even though our language does not allow us to formulate a
<em>definition</em> of any individual. &ldquo;Every being and every
thing must have no partner in something which is attributed to
it&rdquo; (#26, p.56), and &ldquo;having no partner&rdquo; in turn is
mutually entailing or equivalent [<em>mus&acirc;wiq</em>] with
&ldquo;circumscribed by a quiddity&rdquo; (#26, p.57).</p>

<blockquote>

<p>
&ldquo;One&rdquo; is said of everything that is circumscribed by a
quiddity which specifies it [<em>takhu&#7779;&#7779;uhu</em>] and an
existence which specifies it, by which it is circumscribed from
everything other than it, and it is one by a unity which is that by
which it is circumscribed from other things. And if the quiddity of
each thing is circumscribed from other things only by some category,
it [i.e., this sense of &ldquo;one&rdquo;] is equivalent to the
&ldquo;being&rdquo; that signifies the categories, and to whatever
else is equivalent to &ldquo;thing&rdquo;. (#94,
 pp.101&ndash;102)<sup>[<a href="notes.html#note-36" id="ref-36">36</a>]</sup></p>
 </blockquote>

<p>
Thus F&acirc;r&acirc;b&icirc;&rsquo;s analyses of the senses of
&ldquo;being&rdquo; in the <em>Book of Letters</em>, and of the senses
of &ldquo;one&rdquo; in <em>On the One</em>, give the basis for his
account of a &ldquo;transcendental&rdquo; sense of &ldquo;one&rdquo;
in which it is mutually entailing with &ldquo;being&rdquo;, and also
for his account of how unity and existence are predicated of God (see
the next section): once we distinguish the different senses, and
understand how they are related, we will see that circumscription by a
quiddity is both the strongest sense of existence and the strongest
sense of unity. And since every being in every category, individual or
universal, is circumscribed by a quiddity,
F&acirc;r&acirc;b&icirc;&rsquo;s analysis allows him to vindicate his
claim against Kind&icirc; that each of these things is truly one, and
indeed essentially one.</p>

<h2 id="FaraPhilTheoPerfCityPoliRegi">4. F&acirc;r&acirc;b&icirc;&rsquo;s philosophical theology: the <em>Perfect City</em> and <em>Political Regime</em></h2>

<p>
Finally, we turn to metaphysical texts where F&acirc;r&acirc;b&icirc;
tries to do what in the <em>Enumeration of the Sciences</em> he says
that the &ldquo;third part of the divine science&rdquo; does: namely,
to show that there are beings separate from bodies, culminating in a
first uncaused being which has no partner and no contrary, contains no
multiplicity, is one, being, and true in a stronger sense than
everything else, is the first cause of existence, unity and truth to
everything else, and satisfies (some interpretation of) the other
traditional divine attributes; and then to show how this first being
acts to produce other beings directly or indirectly, and how its
action relates to
 theirs.<sup>[<a href="notes.html#note-37" id="ref-37">37</a>]</sup>
 This is also what F&acirc;r&acirc;b&icirc; more briefly says in the
<em>Aims of the Metaphysics</em> that Aristotle does in
<em>Metaphysics</em> XII:</p>

<blockquote>

<p>
The eleventh book [i.e., Book XII on our numbering] is about the
principle of substance and of all existence, its existence and the
confirmation that it is knowing by its essence and true by its
essence, and about the separate beings which are after it, and about
how the existence of beings depends on it.</p>
</blockquote>

<p>
Presumably F&acirc;r&acirc;b&icirc; thinks that Aristotle drew these
conclusions on the basis of his analyses of the senses of being and
unity, of the ways in which one kind of being [<em>mawj&ucirc;d</em>]
could be prior to another being, of what a being&rsquo;s existence
[<em>wuj&ucirc;d</em>] is, of how one being can cause existence to
another being, and so on. F&acirc;r&acirc;b&icirc; himself undertakes
such analyses in his <em>Book of Letters</em> and <em>On the One</em>,
and in one section of the <em>Book of Letters</em> he sketches in a
purely hypothetical way how they might lead to a first being that is
being in the strongest sense.</p>

<p>
However, the two extant books where F&acirc;r&acirc;b&icirc; tries to
carry out this part of metaphysics, the <em>Perfect City</em> and the
<em>Political Regime</em>, are of a rather different character from
the texts that he wrote for an audience within the Baghdad
philosophical school, engaging with Aristotle&rsquo;s texts and trying
to rewrite them for a modern audience. Neither of these books is
devoted exclusively to metaphysics: each first gives a long account of
God as first cause, and then an account of the heavenly and sublunar
things that proceed from God, before focussing on the human soul,
human societies and their governance, prophecy, and the conditions for
the soul&rsquo;s successful &ldquo;return&rdquo; to God or for more or
less satisfactory approximations. Especially in the <em>Perfect
City</em> it is clear that F&acirc;r&acirc;b&icirc; is adopting an
overall sequence of topics from <em>kal&acirc;m</em> treatises, and is
trying to show that the methods of <em>falsafa</em> allow him to give
a scientific content to the knowledge of God, and a demonstrative
resolution of the issues in dispute, which in his view the methods of
<em>kal&acirc;m</em> cannot. The full titles of the two texts, the
<em>Principles of the Opinions of the People of the Perfect City</em>
and the <em>Political Regime known as &ldquo;Principles of
Beings&rdquo;</em> suggest that he is trying to reconstruct and
rewrite Plato&rsquo;s <em>Republic</em> (about which he has only
indirect information), or perhaps a sequence of several Platonic texts
including the
 <em>Republic</em>.<sup>[<a href="notes.html#note-38" id="ref-38">38</a>]</sup>
 In Plato, the thesis that the best society will be ruled by
philosophers leads to a discussion of the objects the philosophers
need to know, Platonic Forms and especially the Good-itself, and this
may give F&acirc;r&acirc;b&icirc; a model for including in these
treatises a metaphysical account of the first cause and how other
things proceed from it: the rulers of the best society will know these
truths, and other members of the society will either believe them
without demonstration, or accept some imitation of
 them.<sup>[<a href="notes.html#note-39" id="ref-39">39</a>]</sup>
 But while Plato starts with a discussion of the city and uses it to
motivate digressions into metaphysics, F&acirc;r&acirc;b&icirc; starts
at the top, with metaphysics (in the <em>Political Regime</em> with a
classification of &ldquo;principles&rdquo; or non-bodily causes, in
the <em>Perfect City</em> with the first cause), with no prior context
or motivation. He does <em>not</em> frame the metaphysics by saying
that this is what the people of the perfect city know or believe.
Rather, he starts from the first cause, explains how the various types
of being in the cosmos, including human souls, depend on it, and draws
conclusions about what sort of city would further human perfection and
what its rulers or other inhabitants would have to know or believe:
this conforms to the structure of <em>kal&acirc;m</em> treatises,
which typically start with God&rsquo;s existence and unity and
attributes and acts, then talk about God&rsquo;s creation including
human beings, and then about prophecy and the religious community and
the afterlife (<em>&acirc;khira</em>) or &ldquo;return&rdquo;
(<em>ma&#703;&acirc;d</em>) to
 God.<sup>[<a href="notes.html#note-40" id="ref-40">40</a>]</sup></p>
 
<p>
F&acirc;r&acirc;b&icirc; does not seem to know about the metaphysics
of the <em>Republic</em>, and in any case it would not give him what
he needs. He fills in the content of the metaphysics from elsewhere,
from <em>Metaphysics</em> XII as he would like it to be, guided by
later Greek interpreters&mdash;Themistius&rsquo; commentary, and texts
of Plotinus and Proclus in their Arabic adaptations. This goes beyond
the actual <em>Metaphysics</em> XII both in that it infers to God as a
first cause of existence rather than of motion, and in that it
includes a downward way from God to the beings that derive their
existence from
 him.<sup>[<a href="notes.html#note-41" id="ref-41">41</a>]</sup>
 F&acirc;r&acirc;b&icirc; is also much more systematic than Aristotle,
in the manner of a <em>kal&acirc;m</em> treatise, in showing that God
is simple, i.e., free from all the different modes of composition, and
is unique and has no contrary (all things that <em>Metaphysics</em>
XII does briefly say), and in going through a whole series of
attributes of God. It is plausible that both treatises are directed to
potential princely patrons, perhaps after F&acirc;r&acirc;bi&rsquo;s
departure from Baghdad for Aleppo and Damascus late in his life.
F&acirc;r&acirc;b&icirc; would be trying to break <em>falsafa</em> out
of its Christian (or Ism&acirc;&#703;&icirc;l&icirc;) ghetto and to
present it as a &ldquo;religious science&rdquo; superior to
<em>kal&acirc;m</em>, not exclusively Muslim but suited for Muslim
needs: F&acirc;r&acirc;b&icirc; presents <em>falsafa</em> as giving
the content of the ruler&rsquo;s or his adviser&rsquo;s religious
knowledge, and implicitly presents himself as an adviser to
 princes.<sup>[<a href="notes.html#note-42" id="ref-42">42</a>]</sup>
 Thus both the <em>Perfect City</em> and the <em>Political Regime</em>
are supposed to be intelligible to a non-specialist audience. In
neither case does F&acirc;r&acirc;bi show himself struggling with a
difficult Greek model, and while he draws on his technical analyses of
being and unity from the <em>Book of Letters</em> and <em>On the
One</em>, this technical substructure is tastefully concealed. The
<em>Political Regime</em> seems to stay closer to
F&acirc;r&acirc;b&icirc;&rsquo;s Greek
 models,<sup>[<a href="notes.html#note-43" id="ref-43">43</a>]</sup>
 and may thus be the earlier of the two texts, while in the
<em>Perfect City</em> he seems to have more fully digested those
models and to be presenting the results in a simpler and more
independent form, concentrating on the elements more central to
presenting <em>falsafa</em> as a &ldquo;religious science&rdquo; to a
contemporary Muslim audience. But some passages remain verbally
identical or almost identical in the two
 treatises.<sup>[<a href="notes.html#note-44" id="ref-44">44</a>]</sup></p>
 
<p>
Both treatises put human beings and their societies in an Aristotelian
cosmological context, which F&acirc;r&acirc;b&icirc; describes in some
detail. Humans and other kinds of animals, and also plants, are
composites of some kind of soul (including, for humans, a rational
soul) with a body composed out of the four sublunar elements, earth
and water and air and fire; the whole sublunar world is governed,
ultimately by God, but proximately by a series of nested heavenly
spheres (each moved by an incorporeal intelligence) and by the
&ldquo;active intelligence&rdquo; which is a source both of
intellectual cognition to the human rational soul and of intelligible
order to the sublunar world. But in what follows I will discuss only
the strictly metaphysical parts of these texts, not the cosmology or
the theories of the human soul, prophecy, or society. I will mainly
follow the <em>Perfect City</em>, while noting some interesting
differences in the <em>Political Regime</em>. The <em>Political
Regime</em> in general seems more interested in classification and
comparison. The human soul is introduced by being compared to various
higher and lower things, and the way it achieves its intended
perfection is compared to the ways they do. Likewise, God is
introduced, in the prologue to the <em>Political Regime</em>, on a
list of six kinds of incorporeal &ldquo;principles&rdquo; of physical
things, and his causality is compared with the modes of causality of
these other
 principles.<sup>[<a href="notes.html#note-45" id="ref-45">45</a>]</sup></p>
 
<p>
The <em>Perfect City</em> sweeps away this introductory framework, and
starts directly with the thesis-statement, &ldquo;The first being
[<em>mawj&ucirc;d</em>] is the first cause of existence
[<em>wuj&ucirc;d</em>] to all other beings
[<em>mawj&ucirc;d&acirc;t</em>]&rdquo;.
F&acirc;r&acirc;b&icirc;&rsquo;s strategy is to argue that there is a
unique &ldquo;first being&rdquo;, and then to derive its attributes,
including that it produces other things, and indeed produces
everything else either directly or indirectly; in the process he hopes
to have shown that this first being has enough of the traditional
attributes of God, suitably reinterpreted, that the readers will
acknowledge it as God. The <em>Perfect City</em> never once uses the
word &ldquo;God&rdquo;, and this is surely a deliberate strategy. We
cannot validly deduce &ldquo;God exists&rdquo;, or &ldquo;God is
F&rdquo; for any value of F, unless we have at least one premise
containing the term &ldquo;God&rdquo;, and no such premises are
available. Especially in Islam it is very common to refer to God, not
by the name &ldquo;God&rdquo;, but by one of his attributes, and
F&acirc;r&acirc;b&icirc; in the <em>Perfect City</em> consistently
uses &ldquo;the First&rdquo;, one of the standard Qur&#702;&acirc;nic
attributes (Q
 57:3).<sup>[<a href="notes.html#note-46" id="ref-46">46</a>]</sup></p>
 
<p>
F&acirc;r&acirc;b&icirc; does not accompany the initial thesis of the
<em>Perfect City</em>, &ldquo;The first being [<em>mawj&ucirc;d</em>]
is the first cause of existence [<em>wuj&ucirc;d</em>] to all other
beings [<em>mawj&ucirc;d&acirc;t</em>]&rdquo;, by any explicit proof.
What is his strategy for convincing the reader to accept it? On the
face of it, there are several ways in which this thesis could be
falsified. There might be no first being, because every being has
another being prior to it, <em>ad infinitum</em>. Or there might be
many beings each of which is &ldquo;first&rdquo; in the weak sense
that it has nothing prior to it; in which case no being will be
&ldquo;first&rdquo; in the strong sense that it is prior to everything
other than itself. (We might also want clarification of what
priority-relation F&acirc;r&acirc;b&icirc; is talking about. He does
not explicitly say, but he seems to mean roughly what Aristotle calls
priority in being by contrast with priority in time and priority in
definition. <em>X</em> is prior to <em>Y</em> in being if <em>X</em>
can exist without <em>Y</em> existing but not <em>vice versa</em>, or
if neither can exist without the other existing but <em>X</em> is the
cause of <em>Y</em>&rsquo;s existing.) If there is some <em>X</em>
which is &ldquo;first&rdquo; in the strong sense that it is prior to
everything other than itself, F&acirc;r&acirc;b&icirc; seems to think
it will be clear that <em>X</em> is the first cause of existence,
either immediately or by a chain of intermediate causes, to any other
being <em>Y</em>, because every being other than the first will have
some cause (distinct from itself) of its existence, and because, if
(as F&acirc;r&acirc;b&icirc; assumes) there can be no circles or
infinite regresses of such causes, the chain of its causes can only
terminate in the first being <em>X</em>. F&acirc;r&acirc;b&icirc; says
nothing here about the infinite regress problem (although he is
certainly aware of the issue, and we can make plausible guesses about
why he thinks the objectionable infinite regresses do not
 arise).<sup>[<a href="notes.html#note-47" id="ref-47">47</a>]</sup>
 But he has a clear (although not obviously successful) strategy for
showing that there cannot be many things each of which is
&ldquo;first&rdquo; in the weak sense that it has nothing prior to it,
and therefore nothing which is prior to everything other than itself.
F&acirc;r&acirc;b&icirc; does not <em>immediately</em> draw this
conclusion: rather, it is supposed to follow from a series of
inferences he makes about what anything that is &ldquo;first&rdquo;
must be like.</p>

<p>
F&acirc;r&acirc;b&icirc;&rsquo;s general strategy is (1) to argue that
anything that is &ldquo;first&rdquo; must not have any kind of cause,
since any such cause would be prior to it and it would not be first,
and that it has no privation or potentiality (either of which would
imply dependence on something prior); then (2) to infer that since it
has no cause it must be <em>simple</em>, i.e., that it is
&ldquo;one&rdquo; in the sense of not having any of the different
kinds of internal composition (e.g., out of matter and form, genus and
differentia, or physically extended parts); then (3) to infer from its
simplicity and non-dependence that it has no partner and no contrary,
i.e., that it is &ldquo;one&rdquo; in the sense of being unique; (4)
then to infer from its negative attributes (especially its
immateriality) to its being
 intelligence<sup>[<a href="notes.html#note-48" id="ref-48">48</a>]</sup>
 and to the kind of intelligence it is, and then to derive its other
positive attributes from its being this kind of intelligence (or
simply to reduce the other attributes to its being this kind of
intelligence); and finally (5) to infer from its simplicity to the
only possible way that it can generate something outside itself. Since
we know that there are things other than the First, and since anything
other than the First must derive its being directly or indirectly from
the First, it will follow that the First does immediately generate at
least one thing, a &ldquo;Second&rdquo;; and F&acirc;r&acirc;b&icirc;
will try to sketch how the First either directly or indirectly causes
all the main types of constituents of the world.
F&acirc;r&acirc;b&icirc;&rsquo;s transitions from the First&rsquo;s
simplicity to its uniqueness, from its negative attributes to its
being intelligence, and from its intrinsic attributes to its producing
something outside it, are all high-risk moments, and will all be
challenged by other Arabic thinkers.</p>

<p>
We will concentrate here on the stages of argument up through the
uniqueness of the First, with a few comments at the end on how
F&acirc;r&acirc;b&icirc; hopes to get to its being intelligence (and
to what kind of intelligence it is) and to its generating a Second.
Sometimes F&acirc;r&acirc;b&icirc; just states his conclusions without
explicit argument, and sometimes he suggests what premisses the
conclusion is supposed to follow from, while leaving it to the reader
to figure out <em>how</em> it is supposed to follow. It is usually not
too hard to fill in a broadly plausible argument. But the obvious ways
of doing this, not drawing on any technical Farabian metaphysical
notions, are often disappointingly vague. We may be able to get more
precise, using notions from the <em>Book of Letters</em> and <em>On
the One</em> which F&acirc;r&acirc;b&icirc;&rsquo;s terminology here
points back to.</p>

<p>
At a first stab: F&acirc;r&acirc;b&icirc; argues that, if something is
&ldquo;first&rdquo; in the sense that nothing is prior to it, it
cannot be dependent on anything for its existence or for its
continuation in existence. Therefore it has existed without beginning
and will exist without end, and has no potentiality for not existing.
It has no efficient cause, but also no material cause: if it had a
material cause, its matter would be prior to it, and presumably it
would also depend on an efficient cause to turn its matter into it. It
is less obvious how F&acirc;r&acirc;b&icirc; wants to infer that it is
perfect, with no deficiency or privation, but perhaps the thought is
that if it were deprived of F, it would have to be of such a kind that
it <em>could</em> be F, and therefore it (or its matter) would be
potentially F. And F&acirc;r&acirc;b&icirc; apparently thinks he can
conclude, not just that a first being has no potentiality for not
existing, but that it has no potentiality for any predicate that it
does not have by its
 essence:<sup>[<a href="notes.html#note-49" id="ref-49">49</a>]</sup>
 perhaps his reason is that if it were potentially F, it would depend
on something else which is actually F to make it actually F, and this
other thing would be prior to it. F&acirc;r&acirc;b&icirc; also says
that a first being has no <em>final</em> cause, and while he
officially says here only that there is no final cause for its
<em>existence</em>, he also thinks that there is no final cause that
it aims to achieve through its <em>activities</em>, again because it
would be in potentiality to some perfection that it does not have by
its essence. It also has no form, because nothing can have a form
unless it also has an underlying matter, which has already been
excluded. And F&acirc;r&acirc;b&icirc; adds another argument, that</p>

<blockquote>

<p>
if it had a form, its essence [<em>dh&acirc;t</em>] would be composed
out of matter and form, and if it were so then its constitution
[<em>qiw&acirc;m</em>] would be through its two parts out of which it
is composed, and its existence [<em>wuj&ucirc;d</em>] would have a
cause. (Walzer 1985, 58,2&ndash;5</p>
</blockquote>

<p>
This allows him to generalize from the case of matter and form to
other kinds of constituents: as he says when he comes back to this
issue after the uniqueness arguments,</p>

<blockquote>

<p>
it is not divisible in account [Arabic <em>qawl</em> = Greek
<em>logos</em>] into things by which it is
 substantified,<sup>[<a href="notes.html#note-50" id="ref-50">50</a>]</sup>
 since it is impossible that each part of the account which explicates
its meaning should signify a part of what it is substantified by. For
if it were so, the parts by which it is substantified would be causes
of its existence [<em>wuj&ucirc;d</em>] in the way that the meanings
which the parts of a thing&rsquo;s definition signify are causes of
the existence of the thing defined, and in the way that the matter and
the form are causes of the existence of what is composed out of them;
and this is impossible for it, since it is first and its existence has
no cause at all. And if it is not divisible by these divisions, it is
even further from being divisible by divisions of quantity or the
other ways of being divided. (Walzer 1985, 66,8&ndash;68,1)</p>
</blockquote>

<p>
So any kind of composition is incompatible with its being first, since
each of its components would be prior to it and would be a (partial)
cause of its existence; we could also argue that the components would
need a cause to unify them, and that this cause would cause the
existence of the composite.</p>

<p>
F&acirc;r&acirc;b&icirc; gives a series of arguments for the
conclusions (central from a Muslim point of view) that a First can
have no partner and no contrary. He does not actually use the word
&ldquo;partner&rdquo; here, but uses phrases like &ldquo;nothing other
than it can have the existence [<em>wuj&ucirc;d</em>] that it
has&rdquo;. While F&acirc;r&acirc;b&icirc; gives a number of arguments
for these conclusions, we can reconstruct perhaps the central
arguments as follows. To conclude that, if <em>X</em> is first, no
other being <em>Y</em> can have the same existence that <em>X</em>
has, F&acirc;r&acirc;b&icirc; says that, if this were so, <em>X</em>
and <em>Y</em> would not differ, and so would be the same thing, not
two things. But what justifies the claim that <em>X</em> and
<em>Y</em> would not differ? F&acirc;r&acirc;b&icirc; says,</p>

<blockquote>

<p>
if there were a difference between them, then that by which they
differ would be other than what they share, and the thing by which
each of them differs from the other would be a part of that by which
their existence is constituted, and what they share would be the other
part: so each of them would be divided in account, and each of its
parts would be a cause of the constitution of its essence, and so it
would not be first. (Walzer 1985, 58,13&ndash;60,3)</p>
</blockquote>

<p>
An obvious objection is that although <em>X</em>, being first, must be
simple, <em>Y</em> might not be: perhaps <em>X</em> is wholly
constituted by what <em>X</em> and <em>Y</em> share, but <em>Y</em> is
only partially constituted by this common element and is partially
constituted by something else. F&acirc;r&acirc;b&icirc; considers this
objection and replies that in that case</p>

<blockquote>

<p>
the existence of the latter is not the existence of the former, rather
the essence of the former is simple and indivisible and the essence of
the latter is divisible, and therefore the latter has two parts by
which it is constituted, and therefore its existence has a cause, and
therefore its existence is inferior to the existence of the former and
deficient in comparison with it, and therefore it is not existence in
the first rank, (Walzer 1985, 60,9&ndash;13)</p>
</blockquote>

<p>
contrary to the hypothesis that <em>Y</em> has the same existence that
<em>X</em> has.</p>

<p>
F&acirc;r&acirc;b&icirc; gives two arguments that, if <em>X</em> is
first, it cannot have a contrary <em>Y</em>. Both arguments turn on a
definition of &ldquo;contrary&rdquo;: <em>X</em> and <em>Y</em> are
contrary if they cannot be together in the same place or substratum,
so that <em>X</em> is present in some place or substratum through
<em>Y</em>&rsquo;s being absent from it, and <em>X</em> is absent from
a place or substratum through <em>Y</em>&rsquo;s being present in it.
On the basis of this definition, Far&acirc;b&icirc; argues, first,
that if the First, <em>X</em>, were contrary to <em>Y</em>, then
<em>X</em>&rsquo;s being (in some place or substratum, or being at
all) would be conditioned on <em>Y</em>&rsquo;s absence, and therefore
<em>X</em>&rsquo;s substance would not be sufficient to explain
<em>X</em>&rsquo;s continuing to exist, or <em>X</em>&rsquo;s existing
at all: so, F&acirc;r&acirc;b&icirc; says, <em>X</em>&rsquo;s
constitution [<em>qiw&acirc;m</em>] would not be in <em>X</em>&rsquo;s
substance (alone), but would be through something else, and so
<em>X</em> would not be first. Second, <em>X</em> and <em>Y</em> would
have to have something common that is receptive of both of them, so
that this common thing would persist in being and <em>X</em> and
<em>Y</em> would succeed each other in it, and so this common thing
would be prior to them and neither of them would be first. These
arguments are recognizably developments of Aristotle&rsquo;s arguments
in <em>Metaphysics</em> XII against there being a pair of contrary
first principles like Empedocles&rsquo; Love and Strife, although
Aristotle relies on the premiss that the first principle is pure
actuality, while F&acirc;r&acirc;b&icirc; makes relatively little use
of the notion of actuality and relies on the premisses that the first
principle is simple and that it does not depend on anything else for
its
 existence.<sup>[<a href="notes.html#note-51" id="ref-51">51</a>]</sup>
 F&acirc;r&acirc;b&icirc;&rsquo;s conclusion that the First has no
contrary is not simply a special case of his conclusion that the First
has no partner, or as he says that &ldquo;nothing other than it can
have the existence [<em>wuj&ucirc;d</em>] that it has&rdquo;, since he
does not assume that contraries would have the same existence or would
be members of the same species or genus.</p>

<p>
But it would be unfair to summarize F&acirc;r&acirc;b&icirc;&rsquo;s
arguments by saying</p>

<blockquote>

<p>
the First must have nothing to be prior to it, therefore it must be
simple; so there cannot be two Firsts, since if there were they would
have something in common and something that distinguishes them, and so
they (or at least one of them) would not be simple.</p>
</blockquote>

<p>
This argument seems open to an immediate objection: why would they
have to have anything in common, except that they are both first, in
the sense that neither of them has anything prior to it? And being
&ldquo;first&rdquo; in this sense is a mere negation&mdash;indeed
merely the negation of a relation to something else&mdash;and so
firstness would not be a <em>constituent</em> of the thing that is
first, and so would not threaten its simplicity. And, while it is not
clear that F&acirc;r&acirc;b&icirc; has an adequate reply to this
objection, his argument is more sophisticated than this quick summary
would suggest, and its extra sophistication may give him more
resources to deal with objections, including the objection that
F&acirc;r&acirc;b&icirc; has not ruled out the possibility of infinite
regresses and that there may be no First, or that there could be a
First and also other things independent of the First if the chains of
their causes go back <em>ad infinitum</em> without leading to a
First.</p>

<p>
It should be clear already that F&acirc;r&acirc;b&icirc;&rsquo;s
argument in the <em>Perfect City</em> uses the word
&ldquo;existence&rdquo; [<em>wuj&ucirc;d</em>] a great deal, in
contexts where it is not obviously necessary. Why say that &ldquo;the
first being is the first cause of existence to all other beings&rdquo;
and not just &ldquo;the first being is the cause of all other
beings&rdquo;? Why say &ldquo;nothing other than it can have the
existence that it has&rdquo; rather than &ldquo;nothing other than it
is first&rdquo; or &ldquo;nothing other than it is in the same species
or genus as it&rdquo;? Why say that if <em>X</em> and <em>Y</em> are
similar in one respect and different in another respect,</p>

<blockquote>

<p>
the thing by which each of them differs from the other would be a part
of that by which their existence is constituted, and what they share
would be the other part: so each of them would be divided in account,
and each of its parts would be a cause of the constitution of its
essence, and so it would not be first</p>
</blockquote>

<p>
rather than &ldquo;the thing by which each of them differs from the
other would be a part of it, and what they share would be the other
part, and then its parts would be prior to it, and so it would not be
first&rdquo;?</p>

<p>
What does it mean, for F&acirc;r&acirc;b&icirc;, to say that
<em>X</em> is the cause of existence to <em>Y</em>, or that <em>X</em>
is the existence of <em>Y</em>, or that <em>X</em> enters into the
constitution [<em>qiw&acirc;m</em>] of <em>Y</em> or is part of that
by which the existence of <em>Y</em> is constituted? At first blush,
the first sentence of the <em>Perfect City</em>, &ldquo;the first
being [<em>mawj&ucirc;d</em>] is the first cause of existence
[<em>wuj&ucirc;d</em>] to all other beings
[<em>mawj&ucirc;d&acirc;t</em>]&rdquo;, seems to be taking the
position of al-Kind&icirc; that F&acirc;r&acirc;b&icirc; had
criticized in the <em>Book of Letters</em>, according to which the
first being, God, would be a separately existing existence-itself,
such that everything else would come to exist by participating in it:
things would exist [would be <em>mawj&ucirc;d</em>] through an
existence [<em>wuj&ucirc;d</em>] as they are white though a whiteness,
and God would be that existence. Is he here, in the <em>Perfect
City</em>, slipping into the kind of popularizing philosophy that he
had criticized through a logical syntax of language in the <em>Book of
Letters</em>? An immediate response is that
F&acirc;r&acirc;b&icirc;&rsquo;s position in the <em>Perfect City</em>
is not the same as Kind&icirc;&rsquo;s, since F&acirc;r&acirc;b&icirc;
does not say that God is the existence of anything else. But we would
still want to know how God is the cause of the existence of other
things, and more generally what it means to say that <em>X</em> is the
cause of the existence of <em>Y</em>, and what role this plays in
F&acirc;r&acirc;b&icirc;&rsquo;s argument in the <em>Perfect
City</em>. And F&acirc;r&acirc;b&icirc;&rsquo;s positive theory in the
<em>Book of Letters</em> gives us resources for understanding
this.</p>

<p>
As we saw in
 <a href="#FaraSensBeinMawjCorrSensExisWuju">Section 3.4</a>,
 on F&acirc;r&acirc;b&icirc;&rsquo;s analysis in the <em>Book of
Letters</em> there are two main senses of being
[<em>mawj&ucirc;d</em>], with corresponding senses of existence
[<em>wuj&ucirc;d</em>]. If &ldquo;being&rdquo; [<em>mawj&ucirc;d</em>]
means &ldquo;being outside the mind as it is inside the mind&rdquo;,
then the subject of which is predicated is a thought in the mind (a
concept or judgment), and its existence [<em>wuj&ucirc;d</em>] is its
relation to something extramental, and this existence holds univocally
of all true thoughts. Clearly this cannot be what
F&acirc;r&acirc;b&icirc; means in the <em>Perfect City</em>&mdash;it
would be pointless to ask, in this sense, whether something else has
the same existence [<em>wuj&ucirc;d</em>] that the First has. On the
other hand, if &ldquo;<em>mawj&ucirc;d</em>&rdquo; means &ldquo;being
circumscribed by a quiddity outside the mind&rdquo;, then the subject
of which it is predicated is a thing really existing outside the mind,
and, according to <em>Book of Letters</em> I,89, its corresponding
<em>wuj&ucirc;d</em> is either its quiddity or part of its quiddity.
Interpreting <em>wuj&ucirc;d</em> as quiddity does not make sense of
the <em>Perfect City</em>&rsquo;s question whether anything else has
the same <em>wuj&ucirc;d</em> as the First: it would be trivially true
that no two distinct things could have the same quiddity, or, if we
say that the quiddity of a thing is just its form without its matter,
it would still be trivially true that no two distinct
<em>immaterial</em> things could have the same quiddity. But
&ldquo;part of a quiddity&rdquo; works, particularly if we reflect on
what kind of part of the quiddity of <em>X</em> could be called the
<em>wuj&ucirc;d</em> of <em>X</em>, and why. As we saw in
 <a href="#FaraSensBeinMawjCorrSensExisWuju">Section 3.4</a>,
 F&acirc;r&acirc;b&icirc; in the <em>Book of Letters</em>, following
Aristotle&rsquo;s <em>Metaphysics</em> VII,17, analyzes
<em>X</em>&rsquo;s existence [<em>wuj&ucirc;d</em> = <em>ousia</em> in
Aristotle&rsquo;s Greek] as the cause of the fact that <em>X</em>
exists, and, in order to search for this cause as a middle term, tries
to reanalyze the existential judgment &ldquo;<em>X</em> exists&rdquo;
as a predicative judgment, something like &ldquo;<em>Y</em> is
<em>X</em>&rdquo; where <em>Y</em> is the <em>per se</em> subject of
<em>X</em>. If <em>X</em> is entirely simple, then &ldquo;<em>X</em>
exists&rdquo; cannot be reanalyzed in this way, but in this case there
is no cause of the fact that <em>X</em> exists, and <em>X</em>&rsquo;s
existence [<em>wuj&ucirc;d</em>] is identical to <em>X</em> without
remainder. In cases where <em>X</em> can be analyzed into a subject
and a predicate, one meaning of &ldquo;<em>X</em> exists&rdquo; is
that there is a middle term explaining why the predicate belongs to
the subject: and this middle term (not the linguistic expression but
the reality it signifies) is one of the things that can be called
&ldquo;the existence [<em>wuj&ucirc;d</em>] of <em>X</em> by which it
is constituted&rdquo; or &ldquo;the cause of existence to
<em>X</em>&rdquo; or &ldquo;a part by which its existence [is
constituted]&rdquo;. In this sense the interposition of the earth
between the sun and the moon is a partial existence
[<em>wuj&ucirc;d</em>] of eclipse, or a part of the quiddity of
eclipse which is a cause of existence to eclipse, or a cause of the
constitution of
 eclipse.<sup>[<a href="notes.html#note-52" id="ref-52">52</a>]</sup>
 Since the First is entirely simple, its quiddity cannot be spelled
out into a definition, and so the First&rsquo;s existence is identical
to the First without remainder, and there is no way that two simple
things can share the same existence. But the First is a &ldquo;cause
of existence&rdquo; to a Second, or is &ldquo;part of that by which
the existence of the Second is constituted&rdquo;, and similar
expressions, if the First enters as a cause into the real causal
definition of the Second, which it does, since (as we will see) the
Second is constituted by its act of cognizing the First. This makes
sense of the different things F&acirc;r&acirc;b&icirc; says in the
<em>Perfect City</em> about <em>X</em> being the cause of existence to
<em>Y</em>, or <em>X</em> being a part of the constitution
[<em>qiw&acirc;m</em>] of <em>Y</em>, of <em>X</em> and <em>Y</em>
sharing the same existence. It also helps to show what the extra
content is to saying &ldquo;<em>X</em> is the cause of existence to
<em>Y</em>&rdquo; rather than just &ldquo;<em>X</em> is the cause of
<em>Y</em>&rdquo;, and helps to explain
F&acirc;r&acirc;b&icirc;&rsquo;s ground for his assumption that there
is a First, i.e., that there is not an infinite regress of causes of
existence: if <em>X</em> is the cause of <em>Y</em>, <em>X</em> counts
as the cause of existence to <em>Y</em> only if <em>X</em> would be
mentioned in a causal definition of <em>Y</em>, i.e., if it is
essential to <em>Y</em> to be caused by <em>X</em>, so that a
<em>Y</em> not caused by <em>X</em> would not really be a <em>Y</em>.
If there were an infinite regress of causes of existence to
<em>X</em>, it would follow that the causal definition of <em>X</em>
would be infinitely long, which F&acirc;r&acirc;b&icirc; presumably
regards as absurd, as does Aristotle in <em>Metaphysics</em> II,2.
There may well be an infinite regress of causes of
<em>coming-to-be</em>, e.g., the infinite chain of my ancestors, but
because these are not causes of <em>existence</em>, which would enter
into the quiddity of the effect and so would be mentioned in its
scientific definition, they do not lead to the absurdity of an
infinitely long definition.</p>

<p>
As we saw in
 <a href="#FaraSensBeinMawjCorrSensExisWuju">Section 3.4</a>,
 <em>Book of Letters</em> I,92 sketches out a program for finding a
chain of causes of existence, where each cause enters into the
quiddity of its effect and has a stronger claim to the title of
&ldquo;being&rdquo; [<em>mawj&ucirc;d</em>]. A substance is a cause of
existence to the accidents proper to it, and enters into their
quiddity, but then there will be a hierarchy of causes of existence
within the category of substance itself, until we reach some first
substance, &ldquo;whether this is one or more than one&rdquo;, which
has a stronger claim to the title of &ldquo;being&rdquo; than all
other substances, and <em>a fortiori</em> than accidents.</p>

<blockquote>

<p>
And if something is discovered outside all these categories which is
the cause of the realization of the quiddity of the most fundamental
thing in this category [i.e., the category of substance], then this is
more deserving to be called &ldquo;being&rdquo;
[<em>mawj&ucirc;d</em>] than the most perfect thing in this category,
and this is the first cause of existence [<em>wuj&ucirc;d</em>] to the
most perfect thing in this category, and this most perfect thing [sc.
within the category of substance] is the cause in the quiddity of the
other things in this category, and what is in this category is the
cause in the quiddity of the other categories: thus the beings, where
what is meant by &ldquo;being&rdquo; is what has a quiddity outside
the soul, are ordered by this order. (<em>Book of Letters</em>
 I,92)<sup>[<a href="notes.html#note-53" id="ref-53">53</a>]</sup></p>
 </blockquote>

<p>
F&acirc;r&acirc;b&icirc; in the <em>Perfect City</em> and
<em>Political Regime</em> claims to have shown that there is indeed
exactly one such first being, which enters as an essential cause into
the quiddities of other things. The claim is not that the First acts
on each quiddity, from &ldquo;outside&rdquo; the quiddity, to give
that quiddity actual existence, but rather that whatever
<em>immediately</em> depends on the First is essentially constituted
by its act of cognizing the First, so that a full account of what the
Second is necessarily involves the First; and lower things are
essentially constituted by their relations to these higher things, and
so are essentially dependent on the First.</p>

<p>
The <em>Perfect City</em> and <em>Political Regime</em> make
particularly striking use of F&acirc;r&acirc;b&icirc;&rsquo;s
&ldquo;general&rdquo; metaphysical treatises, the <em>Book of
Letters</em> and <em>On the One</em>, in their accounts of the senses
in which the First is <em>one</em>. The <em>Perfect City</em> and
<em>Political Regime</em> go through a list of attributes of God, and
try to show that (and in what sense) each of them belongs to the
First, and from a Muslim point of view one of God&rsquo;s most
important attributes is that he is <em>one</em>&mdash;first in the
sense that there is no other god, and then also in the sense that he
contains no internal multiplicity. The <em>Perfect City</em> marks
several senses in which the First is &ldquo;one&rdquo;. It is one in
that no other being shares its species of existence (66,5&ndash;7),
and it is one in that it is &ldquo;undivided&rdquo; or
&ldquo;indivisible&rdquo;, into quantitative parts or any other kind
of parts (68,2&ndash;6); but then, finally,</p>

<blockquote>

<p>
if the First is indivisible in its substance then the existence by
which it is circumscribed [<em>yan&#7717;&acirc;zu</em>] from
existences other than it cannot be other than [the existence] by which
it exists [is <em>mawj&ucirc;d</em>] in itself, and therefore it is
circumscribed from what is other than it through a unity which is its
essence [i.e., through a unity which it <em>is</em>, not through a
unity distinct from itself]. For one of the meanings of unity is the
specific existence [<em>wuj&ucirc;d
 kh&acirc;&#7779;&#7779;</em>]<sup>[<a href="notes.html#note-54" id="ref-54">54</a>]</sup>
 by which each being is circumscribed from what is other than it: this
is that by which every being is called one inasmuch as it exists [is
<em>mawj&ucirc;d</em>] in respect of the existence which specifies it,
and this is the meaning of &ldquo;one&rdquo; which is coextensive with
existence. So the First is one in this way too, and is more deserving
of the name and meaning of &ldquo;one&rdquo; than any one other than
it.</p>
</blockquote>

<p>
Here the <em>Perfect City</em> is relying on the conclusion of the
<em>Book of Letters</em> that &ldquo;circumscribed by its
quiddity&rdquo; is one of the meanings of &ldquo;being&rdquo; and the
conclusion of the <em>On the One</em> that &ldquo;circumscribed by its
quiddity&rdquo; is one of the meanings of &ldquo;one&rdquo;, and using
these conclusions to interpret Aristotle&rsquo;s claim in
<em>Metaphysics</em> IV,2 that &ldquo;being&rdquo; and
&ldquo;one&rdquo; are mutually entailing. Any being <em>X</em> has a
&ldquo;specific existence&rdquo; which &ldquo;circumscribes it&rdquo;,
i.e., distinguishes it from all other things, and it is <em>one</em>
in the sense that it is uniquely specified by this existence. If
<em>X</em> is a member of a species, then <em>X</em>&rsquo;s
&ldquo;specific existence&rdquo; might include the matter or the place
or other accidental attributes which distinguish <em>X</em> from other
members of the same species. But, F&acirc;r&acirc;b&icirc; is saying,
if <em>X</em> is the First and therefore indivisible in its substance,
it cannot have both a quiddity which it shares with other things and
then a distinct &ldquo;specific existence&rdquo; which distinguishes
it from those other things. So because it is <em>one</em> both as
&ldquo;unique&rdquo; and as &ldquo;indivisible&rdquo;, its unity, that
by which it is one, is completely identical with the quiddity by which
it exists [is a being]. Here, as with the other attributes which he
demonstrates of the First, F&acirc;r&acirc;b&icirc; is paralleling the
Mu&#703;tazilite pattern of asserting that, for any attribute F such
that we can say that God is F, the F-ness through which God is F is
identical with the divine essence. But F&acirc;r&acirc;b&icirc; claims
to have based his account of the First and its attributes on
demonstrations grounded in analyses of the meanings of being, unity,
intelligence and the other fundamental philosophical concepts;
whereas, F&acirc;r&acirc;b&icirc; would say, when the
Mu&#703;tazilites say that God is F through an F-ness which is
identical with his essence, and therefore is F in a different way from
creatures, this is bare assertion to save their theses that God is
simple and that he is nonetheless F, and does not rest on an analysis
of a special sense of F that applies to God and how it relates to more
ordinary senses of F. In the cases of being and unity, the special
metaphysics of the <em>Perfect City</em> and <em>Political Regime</em>
is supposed to rest on the general metaphysics of the <em>Book of
Letters</em> and <em>On the One, and</em> is supposed to vindicate
F&acirc;r&acirc;b&icirc;&rsquo;s claim that Aristotelian general
metaphysics, when properly understood, will give the path to a
scientific special metaphysics.</p>

<p>
We conclude by briefly sketching two further, and problematic, key
steps in the metaphysical section of the <em>Perfect City</em> and
<em>Political Regime</em>, namely F&acirc;r&acirc;b&icirc;&rsquo;s
argument that the First is both intelligence [<em>&#703;aql</em> =
Greek <em>nous</em>] and intelligible [<em>ma&#703;q&ucirc;l</em> =
<em>no&ecirc;ton</em>], and his argument that the First is a cause of
existence to other things, and immediately to a single Second, the
immaterial intelligence which moves the outermost sphere (in the
<em>Perfect City</em>), or to a small finite number of Seconds, the
immaterial intelligences which move the different heavenly spheres (in
the <em>Political Regime</em>). By arguing that the First is
intelligence and intelligible, F&acirc;r&acirc;b&icirc; tries to
derive versions of the attributes of knowledge and truth standardly
ascribed to God, and by arguing that it produces a Second he tries to
derive a version of the act of creation standardly ascribed to God.
But he is deriving radically stripped-down versions of these
attributes and acts, since the First directly knows only itself, and
directly creates only the Second (or a few Seconds), even if it may be
said as a consequence to indirectly know and create other things
too.</p>

<p>
F&acirc;r&acirc;b&icirc;&rsquo;s basic steps in arguing that the First
is intelligence and intelligible are the premisses that</p>

<blockquote>

<p>
what prevents the form from being intelligence and from actually
intellectually cognizing is the matter in which the thing exists</p>
</blockquote>

<p>
and that</p>

<blockquote>

<p>
what prevents the thing from being intelligible in actuality [or
&ldquo;from being intellectually cognized in actuality&rdquo;] and
from being by its substance intelligible [or &ldquo;intellectually
cognized&rdquo;] is also matter. (Walzer 1985, 70)</p>
</blockquote>

<p>
Since the First has no matter, it would follow that it is actually
intelligence and actually intellectually cognized.
F&acirc;r&acirc;b&icirc;&rsquo;s first premiss, that anything would be
intellectually cognizing if it did not have a matter blocking it,
initially seems strange and ill-motivated. But
F&acirc;r&acirc;b&icirc; would see the second premiss, that matter is
the obstacle to something&rsquo;s being intellectually cognized, as
grounded in an Aristotelian analysis of intellectual cognition: the
mind intellectually cognizes the form of a material thing precisely by
abstracting it from its matter, and if the object had no matter to
begin with, then there is nothing further to do to it and it is
already intellectually
 cognized.<sup>[<a href="notes.html#note-55" id="ref-55">55</a>]</sup>
 And F&acirc;r&acirc;b&icirc; apparently sees the first premiss as
following from the second: if <em>X</em> is intrinsically without
matter, it is actually intellectually cognized <em>intrinsically</em>,
and not through a relation to something else which would cognize it:
and this can only because it actually intellectually cognizes
<em>itself</em>, and does so intrinsically or essentially, not in
dependence on some other
 cause.<sup>[<a href="notes.html#note-56" id="ref-56">56</a>]</sup>
 Following this Aristotelian analysis, the First&rsquo;s act of
intellectually cognizing its object would not be an <em>accident</em>
of the First, but would be its essence; put the other way around, the
First would be an intelligence, not by being a power for
intellectually cognizing various objects, but by being an <em>act</em>
of cognizing its object, namely the First itself. So, as
F&acirc;r&acirc;b&icirc; says,</p>

<blockquote>

<p>
that it is intelligence [or &ldquo;intellectual cognition&rdquo;] and
that it is intellectually cognized and that it is intellectually
cognizing are all a single essence and a single undivided substance.
(Walzer 1985,
 70)<sup>[<a href="notes.html#note-57" id="ref-57">57</a>]</sup></p>
 </blockquote>

<p>
Or, as F&acirc;r&acirc;b&icirc; says in switching from the
Aristotelian language of &ldquo;intelligence&rdquo; to the
Qur&#702;&acirc;nic and <em>kal&acirc;m</em> language of God&rsquo;s
attribute of knowledge, the First&rsquo;s knowledge does not require
anything other than itself for it to know, and its knowledge is
identical with its essence (Walzer 1985, 72). This sounds like the
Mu&#703;tazilites in claiming to reconcile God&rsquo;s knowledge with
his simplicity. But while the Mu&#703;tazilites try to show how
God&rsquo;s knowledge can be simple and eternal despite God&rsquo;s
knowing a vast plurality of things, some of which change,
F&acirc;r&acirc;b&icirc; short-circuits the problem by saying that
God&rsquo;s knowledge is just knowledge of himself. Perhaps
F&acirc;r&acirc;b&icirc; would say that the problem just cannot be
solved if we assume that God is omniscient. Or perhaps he would say,
with Themistius (followed by many medieval philosophers), that God in
knowing himself also implicitly knows other things because he is a
<em>cause</em> of those other things.</p>

<p>
F&acirc;r&acirc;b&icirc; also applies his groundwork from the <em>Book
of Letters</em> to save the Qur&#702;&acirc;nic attribute that God is
&ldquo;true&rdquo; or &ldquo;truth&rdquo; [<em>al-&#7717;aqq</em>].
The First is &ldquo;truth&rdquo; [<em>&#7717;aq&icirc;qa</em>] in the
sense in which the <em>&#7717;aq&icirc;qa</em> of <em>X</em> is the
quiddity of <em>X</em>, i.e., the existence [<em>wuj&ucirc;d</em>]
which specifies <em>X</em> as distinct from all other things, which
might be expressed by the definition or the ultimate differentia of
<em>X</em>; and, as F&acirc;r&acirc;b&icirc; has already argued, there
is no distinction between the First itself and the existence by which
the First is distinguished from other things. Also, if <em>S</em>
thinks <em>X</em> in a way that corresponds to the way <em>X</em> is
in itself, <em>S</em>&rsquo;s thought of <em>X</em> can be called
&ldquo;true&rdquo; [<em>&#7717;aqq</em>], and <em>X</em> can also be
called true insofar as it corresponds to <em>S</em>&rsquo;s thought of
<em>X</em>. Since the First knows itself, it can be called
&ldquo;true&rdquo; in this sense through itself, apart from any
relation to anything outside itself; and because this is essential to
it, the &ldquo;truth&rdquo; [<em>&#7717;aq&icirc;qa</em>] through
which it is &ldquo;true&rdquo; in this sense is not anything other
than itself (Walzer 1985, 74). For the First to be &ldquo;truth&rdquo;
in this second sense seems to be equivalent to its being essentially
intellectually cognized.</p>

<p>
In passing from the First as intelligence to the First as causing
being, F&acirc;r&acirc;bi is passing, in <em>kal&acirc;m</em> terms,
from God&rsquo;s attributes to God&rsquo;s acts. His account of the
First as intelligence was perhaps less concerned to show that God has
knowledge, more concerned to show that God&rsquo;s knowledge is
identical with his essence, and to show in consequence the differences
between the way that God knows and the ways that other things know.
His account of the First as causing being to other things, or (in
<em>kal&acirc;m</em> terms) of God&rsquo;s act of creation, does not
attempt to deduce, starting from what we have shown about the First,
that it must create other things rather than remaining in isolation.
He does say that</p>

<blockquote>

<p>
when the First exists with the existence which it has, it necessarily
follows that there exist from it all the other beings whose existence
is not by human will and choice, with the existences which they have,
(Walzer 1985, 88,11&ndash;14)</p>
</blockquote>

<p>
but he gives no argument that the First&rsquo;s existence entails the
existence of other things. Rather, he seems to rely on the argument
that since other things in fact exist, their existence must ultimately
be caused by the First; his main concern is not to show <em>that</em>
the First causes the existence of other things, but to show
<em>how</em> it causes the existence of other things, and in
particular to show that that by which the First causes the existence
of other things is identical with its essence, just as that by which
the First knows is identical with its
 essence.<sup>[<a href="notes.html#note-58" id="ref-58">58</a>]</sup>
 As F&acirc;r&acirc;b&icirc; says, &ldquo;it is not divided into two
things, such that the substantiation of its essence is by one of them
and something else&rsquo;s arising from it is by the other&rdquo;
(Walzer 1985, 92,3&ndash;5): as he says a bit further down, the First
does not require an accident or a motion in itself in order for
something else to arise from it. (Nor is it affected or moved
<em>by</em> something else&rsquo;s arising from it, since it cannot be
affected or moved at all.) Nor, more generally, does the First require
<em>anything</em> other than its essence&mdash;whether an accident or
motion that would inhere in the First itself, or an external
instrument or material substrate that the First would cooperate with
in producing some effect&mdash;in order for something other than
itself to arise from it. The First does cooperate with external
instruments and material substrata in producing <em>some</em> of its
effects, and this is important for F&acirc;r&acirc;b&icirc; in
explaining how it can produce a plurality of effects, and how it can
produce more and less perfect effects, and how it can produce effects
which are connected or &ldquo;ordered&rdquo; rather than independent
of each other. But the First must be able to produce at least some
first effect without an instrument or substratum, or it would not be
able to produce anything at all, and in that first case the existence
of the First must be a sufficient cause of the existence of its
effect.</p>

<p>
F&acirc;r&acirc;b&icirc; gives no further explanation of how or why
the existence of <em>X</em> can be a sufficient cause of the existence
of <em>Y</em>. (He says that the existence of <em>Y</em>
&ldquo;emanates&rdquo; [using the root <em>f-y-&#7693;</em>] from the
existence of <em>X</em>, but this is just a technical term meaning
that <em>X</em>&rsquo;s existence, rather than some further act of
<em>X</em>, causes <em>Y</em> to exist; the term
&ldquo;emanation&rdquo; does not explain <em>how</em> this happens,
and F&acirc;r&acirc;b&icirc; does not pretend that it does.) He just
infers that this must happen in some cases, since more than one thing
exists. F&acirc;r&acirc;b&icirc;&rsquo;s situation is analogous to
Aristotle&rsquo;s in <em>Metaphysics</em> XII. After Aristotle has
argued that the existence of motion presupposes a first cause which is
essentially pure actuality, and which therefore cannot be changed or
moved, he faces the problem of explaining how such a cause can move
something else. Aristotle answers that while an eternally unchanging
cause cannot, by itself, cause changing motions, it can cause an
eternally constant motion (such as the eternal rotation of a heavenly
sphere around its axis) if it causes it as a <em>final</em> cause, as
an object desired by the object in motion. This leaves many
puzzles&mdash;why should this desire lead a heavenly sphere to move in
circles, how will that help it attain the desired object&mdash;but
Aristotle can say that since every other kind of causality is
impossible, this is what must be happening even if we don&rsquo;t
understand the details. F&acirc;r&acirc;b&icirc; faces a similar
difficulty in explanation, but he finds Aristotle&rsquo;s solution
unsatisfying, not so much because these details are missing, as
because it does not explain why the heavenly spheres, or their
incorporeal movers other than the First exist&mdash;at best, Aristotle
assumes that the incorporeal substances and the spheres exist, and
explains why the spheres move. F&acirc;r&acirc;b&icirc;, by contrast,
has undertaken to understand the First as a cause of
<em>existence</em>; and final causality, even if it is sufficient to
explain the motion of an already existent substance, does not seem
sufficient to explain the existence of substances other than the
First, either the heavenly spheres or their incorporeal movers. The
First must cause existence before it can cause motion, and in fact
F&acirc;r&acirc;b&icirc; does not make it a mover at all, but rather
says that it is responsible for the existence of something which is in
turn the first cause of motion. And if the First causes existence at
all, it must first cause the existence of at least one thing simply by
its own existence, not cooperating with any further attribute or
motion or instrument or matter. F&acirc;r&acirc;b&icirc; does not and
cannot say anything about <em>what the First does</em> to cause the
existence of something else (he does not say that it causes the
existence of something else by thinking that thing, or even that it
causes the existence of something else as a byproduct of thinking
itself); rather, he tries to describe how, and in what order, other
things are essentially dependent on the First.</p>

<p>
In the <em>Perfect City</em> F&acirc;r&acirc;b&icirc; says that the
First causes existence, immediately and without cooperation with an
instrument or matter, only to a single thing, the Second; in the
<em>Political Regime</em>, apparently, the First causes existence
immediately to several things, the Seconds. But in both treatises,
when he introduces his discussion of the First as the cause of
existence to other things, he does not start by singling out a Second
or Seconds. Rather, he starts by saying that &ldquo;the substance of
[the First] is a substance from which every existence emanates,
whatever this existence may be like, whether it is perfect or
deficient&rdquo;; (Walzer 1985,
 94),<sup>[<a href="notes.html#note-59" id="ref-59">59</a>]</sup>
 but he then immediately adds that &ldquo;when all the beings arise
from it, they are ordered in their ranks, and each being receives from
it the portion of existence which is due to it and the rank which is
due to it&rdquo;
 (ibid.).<sup>[<a href="notes.html#note-60" id="ref-60">60</a>]</sup>
 But then there is a problem why the First&rsquo;s single simple
existence, assuming that it causes the existence of something else,
should cause a plurality of beings receiving greater or lesser
&ldquo;portions&rdquo; of existence from it.
F&acirc;r&acirc;b&icirc;&rsquo;s answer to this problem seems to be
less developed in the <em>Political Regime</em> than in the
<em>Perfect City</em>. In the <em>Political Regime</em>, he says that
the Seconds (the intelligences that move the heavenly bodies), and
apparently also the &ldquo;active intelligence&rdquo; that governs the
sublunar world, &ldquo;have all received existence from the
First&rdquo; (Butterworth 2015, 46, #34, translation modified); other
things depend on the Seconds or the active intelligence for their
existence, and for this reason receive lesser portions of existence.
F&acirc;r&acirc;b&icirc; says here that the Seconds, like the First,
are such that their specific existence is sufficient for the existence
of something else to emanate from them (ibid.): each Second produces a
heavenly sphere composed of body and soul (it produces not merely the
<em>motion</em> but the <em>existence</em> of the sphere), and
sublunar substances depend for their existence both on the heavenly
spheres and on the active
 intelligence.<sup>[<a href="notes.html#note-61" id="ref-61">61</a>]</sup>
 The <em>Political Regime</em> says that the Seconds have different
ranks (Butterworth 2015, 46, #34) but it does not say anything to
explain why there should be many of them or why they should differ in
rank. In particular, it does not say that lower Seconds depend on
higher Seconds for their existence: each Second is described only as
producing a heavenly sphere, not as producing another Second, and as
far as we can tell each Second is produced immediately by the First
without cooperation with any other cause. However, in the <em>Perfect
City</em>, F&acirc;r&acirc;b&icirc; says that the First, immediately
and by itself alone, produces only a single Second (Walzer 1985, 100),
and that all other beings are produced by the First in conjunction
with instruments or material substrata, where these must be either the
Second or things which are produced by the First in conjunction with
the Second. This allows F&acirc;r&acirc;b&icirc; to explain why there
should be a plurality of separate immaterial substances, and why they
should differ in rank: the Second which is immediately produced by the
First has a greater &ldquo;portion of existence&rdquo; than the Third
which depends essentially on the Second, and so on, and all of these
separate intelligences (the movers of the heavenly spheres and then
the active intelligence that governs the sublunar world) have greater
portions of existence than sublunar substances which essentially
depend on the heavenly spheres and on the active intelligence. Here
F&acirc;r&acirc;bi is following out the program of <em>Book of
Letters</em> I,92, discussed above, of finding a single first
substance (here the Second, i.e., the mover of the outermost heavenly
sphere) on which all other substances are essentially dependent, and
then tracing it back in turn to a single simple First: the causal
definition of any other substance, if made fully explicit, would have
to refer to the motion of the outermost sphere and to the Second as
its cause, and thus ultimately to the First. But
F&acirc;r&acirc;b&icirc; has the problem of explaining how a single
Second can be responsible for causing all this multiplicity of
essentially differing beings. The <em>Perfect City</em>, like the
<em>Political Regime</em>, stresses that the Seconds (or Second,
Third, and so on), like the First, are each an intelligence which is
essentially actually cognizing and is itself the object it cognizes,
and whose specific existence is sufficient for the existence of
something else to emanate from it; both treatises also stress that
these intelligences are also inferior to the First, notably in that
they do not have their full perfection purely in themselves, but only
through a relation to the First, namely through intellectually
cognizing the First. But if each of these intelligences, like the
First, immediately produces only a single being like itself, they will
not be able to explain the multiplicity and complexity of the beings
that arise indirectly from the First. In the <em>Political Regime</em>
apparently each of the Seconds produces just a single being, namely
the heavenly sphere it governs (although this sphere has some
complexity as a compound of body and soul, and although the active
intelligence that governs the sublunar world has more complex
effects), but in the <em>Perfect City</em> each of these intelligences
has to produce <em>two</em> beings, namely the heavenly sphere it
governs and the next
 intelligence.<sup>[<a href="notes.html#note-62" id="ref-62">62</a>]</sup>
 Thus</p>

<blockquote>

<p>
from the First emanates the existence of the Second, and this Second
too is a substance which is not embodied at all and is not in matter,
and it intellectually cognizes itself [or &ldquo;its essence&rdquo;]
and it intellectually cognizes the First, and its intellectual
cognition of itself is not something other than its essence; and by
its intellectually cognizing the First there follows necessarily from
it the existence of a Third, and by its being substantified by the
essence which is specific to it there follows necessarily from it the
existence of the first heaven. (Walzer 1985, 100)</p>
</blockquote>

<p>
So for the <em>Perfect City</em>, as in the <em>Political Regime</em>,
the Second, like the First, essentially cognizes itself, and there is
no distinction between its act of cognizing itself, the existence by
which it is substantially constituted, and that through which it gives
rise to the existence of the heavenly sphere it governs. But the
<em>Perfect City</em> can say that there is a distinction between this
intelligence&rsquo;s cognition <em>of itself</em>, which is essential
to it, and its cognition <em>of the First</em>, through which it
attains a perfection, by relation to something else, exceeding what it
has just by itself. Or perhaps it would be better to say that its
essence includes a relation to the First, and that its essence is
therefore compound, in something like the way that a species-essence
composed of genus and differentia is compound.
F&acirc;r&acirc;b&icirc; does not want to say that an immaterial
intelligence is composed of two beings
[<em>mawj&ucirc;d&acirc;t</em>], such as substance and accident or
matter and form, but he wants to say that it has two
<em>existences</em> [<em>wuj&ucirc;d&acirc;t</em>], that it
<em>is</em> in two ways or in a compound way. His wager in the
<em>Perfect City</em> is that he can explain this plurality of
existences in immaterial substances by the way in which they are
caused by the First, and that this plurality of existences will in
turn explain how these immaterial substances can give rise to the many
complex beings ultimately arise from the First.</p>
</div>

<div id="bibliography">

<h2 id="Bib">Bibliography</h2>

<h3 id="PrimSour">A. Primary sources</h3>

<h4 id="EditTextFara">A.1 Editions of texts by F&acirc;r&acirc;b&icirc;</h4>

<ul class="hanging">

<li><em>Falsafat Afla&#7789;&ucirc;n</em>, in Franz Rosenthal and
Richard Walzer (eds. and trs.), [Latin], <em>Alfarabius de Platonis
philosophia</em>, London: Warburg, 1943.</li>

<li><em>I&#7717;&#7779;&acirc;&#702; al-&#703;ul&ucirc;m</em>, in
&Aacute;ngel Gonz&aacute;lez Palencia (ed. and tr. [Spanish]),
<em>Al-Farabi: Cat&aacute;logo de las ciencias</em>, second edition,
Madrid: Consejo Superior de Investigaciones Cient&iacute;ficas,
1953.</li>

<li>[Kutsch &amp; Marrow 1960] <em>Shar&#7717;
al-F&acirc;r&acirc;b&icirc; li-Kit&acirc;b
Aris&#7789;&ucirc;&#7789;&acirc;l&icirc;s f&icirc;
l-&#703;Ib&acirc;ra</em> = <em>Alfarabi&rsquo;s Commentary on
Aristotle&rsquo;s PERI ERMHNEIA&Sigma; (De Interpretatione)</em>,
Wilhelm Kutsch and Stanley Marrow (eds.), Beirut: Imprimerie
Catholique, 1960.</li>

<li><em>Kit&acirc;b al-siy&acirc;sa al-madan&icirc;ya</em> =
<em>Alfarabi&rsquo;s The Political Regime</em>, Fauzi M. Najjar (ed.),
Beirut: Imprimerie Catholique, 1964.</li>

<li>[Mahdi 1968] <em>Kit&acirc;b al-alf&acirc;&#7827;
al-musta&#703;mala f&icirc; l-man&#7789;iq</em>, Muhsin Mahdi (ed.),
Beirut: Dar el-Mashreq, 1968.</li>

<li>[Mahdi 1969a] <em>Kit&acirc;b al-&#7717;ur&ucirc;f</em> =
<em>Alfarabi&rsquo;s Book of Letters</em>, Muhsin Mahdi (ed.), Beirut:
Dar el-Mashreq, 1969a. [Note that <em>Boook of Letters</em> is cited
by part and paragraph number followed, possibly, by page number and
line number.]</li>

<li>[Mahdi 1976] <em>Kit&acirc;b i&#7717;&#7779;&acirc;&#702;
al-&icirc;q&acirc;&#703;&acirc;t</em>, selections edited by Muhsin
Mahdi in &#703;Uthm&acirc;n Am&icirc;n (ed.),
<em>Nu&#7779;&ucirc;&#7779; falsaf&icirc;ya muhd&acirc;t il&acirc;
l-Dukt&ucirc;r Ibr&acirc;h&icirc;m Madk&ucirc;r</em>, Cairo: 1976, pp.
75&ndash;8.</li>

<li><em>Kit&acirc;b al-w&acirc;&#7717;id wa-l-wa&#7717;da</em> =
<em>Alfarabi&rsquo;s On One and Unity</em>, Muhsin Mahdi (ed.),
Casablanca: Toubkal, 1989.</li>

<li><em>Kit&acirc;b al-jam&#703; bayna ra&#702;ay
al-&#7717;ak&icirc;mayn</em>, in Cecilia Martini Bonadeo, (ed. and tr.
[Italian]), <em>al-F&acirc;r&acirc;b&icirc;: L&rsquo;armonia delle
opinioni dei due sapienti: il divino Platone e Aristotele</em>, Pisa:
Plus, 2008.</li>
</ul>

<h4 id="EditEarlArabPhilText">A.2 Editions of earlier Arabic philosophical texts</h4>

<ul class="hanging">

<li><em>Oeuvres philosophiques et scientifiques
d&rsquo;al-Kind&icirc;</em>, Jean Jolivet and Roshdi Rashed, (ed. and
tr. [French]), 2 vols., Leiden: Brill, 1997.</li>
</ul>

<h4 id="TranTextFara">A.3 Translations of texts by F&acirc;r&acirc;b&icirc;</h4>

<ul class="hanging">

<li>Bertolacci, Amos (tr.), 2006a, &ldquo;On the Aims of the
Metaphysics&rdquo;, in Bertolacci 2006b, 66&ndash;72.</li>

<li>Bu&#269;an, Daniel (tr.), 1999, <em>Abu Nasr Al-Farabi: Knjiga o
slovima</em>, Zagreb: Demetra. Croatian translation of the <em>Book of
Letters</em>.</li>

<li>Butterworth, Charles E. (tr.), 2001, <em>Alfarabi: The Political
Writings: &ldquo;Selected Aphorisms&rdquo; and Other Texts</em>,
Ithaca, NY: Cornell University Press. Contains the <em>Selected
Aphorisms</em>, <em>Book of Religion</em>, <em>The Harmonization of
the Two Opinions of the Two Sages: Plato the Divine and
Aristotle</em>, and selections from the <em>Enumeration of the
Sciences</em>.</li>

<li>&ndash;&ndash;&ndash; (tr.), 2015, <em>Alfarabi: The Political
Writings, Volume II: &ldquo;Political regime&rdquo; and &ldquo;Summary
of Plato&rsquo;s laws&rdquo;</em>, Ithaca, NY: Cornell University
Press</li>

<li>Gonz&aacute;lez Palencia, &Aacute;ngel (ed. and tr. [Spanish]),
1953, <em>Al-Farabi: Cat&aacute;logo de las ciencias</em>, second
edition, Madrid: Consejo Superior de Investigaciones
Cient&iacute;ficas.</li>

<li>Khalidi, Muhammad Ali, 2005, <em>Medieval Islamic Philosophical
Writings</em>, Cambridge: Cambridge University Press. Contains a
partial English translation of the <em>Book of Letters</em>, pp.
1&ndash;26.</li>

<li>McGinnis, Jon and David C. Reisman, 2007, <em>Classical Arabic
Philosophy: An Anthology of Sources</em>, Indianapolis, IN: Hackett.
Contains translations of <em>On the Aims of the Metaphysics</em>,
<em>On Intelligence</em>, and part of the <em>Political
Regime</em>.</li>

<li>Mahdi, Muhsin (tr.), 1969b, <em>Alfarabi&rsquo;s philosophy of
Plato and Aristotle</em>, revised edition, Ithaca, NY: Cornell
University Press. Contains the <em>Attainment of Happiness</em>,
<em>Philosophy of Plato</em>, and <em>Philosophy of
Aristotle</em>.</li>

<li>Martini Bonadeo, Cecilia (ed. and tr. [Italian]), 2008,
<em>al-F&acirc;r&acirc;b&icirc;: L&rsquo;armonia delle opinioni dei
due sapienti: il divino Platone e Aristotele</em>, Pisa: Plus.</li>

<li>Rosenthal, Franz, 1975, <em>The Classical Heritage in Islam</em>,
London: Routledge. Contains a translation of <em>On the Appearance of
Philosophy</em>, pp. 50&ndash;51</li>

<li>Rosenthal, Franz and Richard Walzer (ed. and tr. [Latin]), 1943,
<em>Alfarabius de Platonis philosophia</em>, London: Warburg</li>

<li>T&uuml;rker, &Ouml;mer (tr.), 2008, <em>Harfler Kitab&#305;:
Kit&acirc;bu&rsquo;l-Hur&ucirc;f</em>, Istanbul: Litera
Yay&#305;nc&#305;l&#305;k. Turkish translation of the <em>Book of
Letters</em>.</li>

<li>Walzer, Richard (ed. and tr.), 1985, <em>Al-Farabi on the Perfect
State: Ab&ucirc; Na&#7779;r al-F&acirc;r&acirc;b&icirc;&rsquo;s
Mab&acirc;di&#702; &Acirc;r&acirc;&#702; Ahl al-Mad&icirc;na
al-F&acirc;dila</em>, Oxford: Clarendon Press.</li>

<li>Zimmermann, F.W. (tr. [with book-length introduction]), 1981,
<em>Al-Farabi&rsquo;s Commentary and Short Treatise on
Aristotle&rsquo;s De interpretatione</em>, London: Published for the
British Academy by Oxford University Press</li>
</ul>

<h4 id="TranEarlArabPhilTextGreeTextSurvArab">A.4 Translations of earlier Arabic philosophical texts, and a Greek text surviving in Arabic/Hebrew</h4>

<ul class="hanging">

<li>Adamson, Peter and Peter E. Pormann (trs), 2012, <em>The
Philosophical Works of Al-Kind&icirc;</em>, Oxford: Oxford University
Press.</li>

<li>Elamrani-Jamal, Abdelali, 1983, <em>Logique
aristot&eacute;licienne et grammaire arabe</em>, Paris: Vrin. Contains
a French translation of the debate between Ab&ucirc; Bishr Matt&acirc;
and al-S&icirc;r&acirc;f&icirc;, pp. 149&ndash;63.</li>

<li>Jolivet, Jean and Roshdi Rashed (ed. and tr. [French]), 1997,
<em>Oeuvres philosophiques et scientifiques
d&rsquo;al-Kind&icirc;</em>, Leiden: Brill</li>

<li>Madelung, Wilferd and Paul Walker, 1999, <em>The Advent of the
Fatimids: A Contemporary Shi&#703;i Witness</em>, London: Tauris</li>

<li>Margoliouth, D.S., 1905, &ldquo;The Discussion between Abu Bishr
Matta and Abu Sa&#703;id al-Sirafi on the Merits of Logic and
Grammar&rdquo;, <em>Journal of the Royal Asiatic Society</em>, 37(1):
79&ndash;129. doi:10.1017/S0035869X00032706</li>

<li>Meyrav, Yoav (tr.), 2020, <em>Themistius: On Aristotle Metaphysics
12</em>, London: Bloomsbury.</li>
</ul>

<h3 id="BSecoSour">B. Secondary sources</h3>

<ul class="hanging">

<li>Abed, Shukri B., 1991, <em>Aristotelian Logic and the Arabic
Language in Alf&acirc;r&acirc;b&icirc;</em>, Albany, NY: SUNY
Press.</li>

<li>Adamson, Peter, 2002, <em>The Arabic Plotinus: A Philosophical
Study of the Theology of Aristotle</em>, London: Duckworth.</li>

<li>Bertolacci, Amos, 2005, &ldquo;On the Arabic Translations of
Aristotle&rsquo;s <em>Metaphysics</em>&rdquo;, <em>Arabic Sciences and
Philosophy</em>, 15(2): 241&ndash;275.
doi:10.1017/S0957423905000196</li>

<li>&ndash;&ndash;&ndash;, 2006b, <em>The Reception of
Aristotle&rsquo;s Metaphysics in Avicenna&rsquo;s Kit&acirc;b
al-&Scaron;if&acirc;&#702;: A Milestone of Western Metaphysics</em>,
Leiden: Brill.</li>

<li>D&eacute;carie, Vianney, 1961, <em>L&rsquo;objet de la
m&eacute;taphysique selon Aristote</em>, Paris: Vrin.</li>

<li>Diebler, St&eacute;phane, 2005, &ldquo;Cat&eacute;gories,
conversation et philosophie chez al-F&acirc;r&acirc;b&icirc;&rdquo;,
in <em>Les cat&eacute;gories et leur histoire</em>, Otto Bruun and
Lorenzo Corti (eds.), Paris: Vrin, pp. 275&ndash;305.</li>

<li>Druart, Th&eacute;r&egrave;se-Anne, 2007,
&ldquo;Al-F&acirc;r&acirc;b&icirc;, the Categories, Metaphysics, and
the <em>Book of Letters</em>&rdquo;, <em>Medioevo: Rivista di storia
della filosofia medievale</em>, 32: 15&ndash;37.</li>

<li>Galston, Miriam, 2015, &ldquo;The Puzzle of Alfarabi&rsquo;s
Parallel Works&rdquo;, <em>The Review of Politics</em>, 77(4):
519&ndash;543. doi:10.1017/S003467051500056X</li>

<li>Gutas, Dimitri, 1999a, &ldquo;The &lsquo;Alexandria to
Baghdad&rsquo; Complex of Narratives: a Contribution to the Study of
Philosophical and Medical Historiography Among the Arabs&rdquo;,
<em>Documenti e Studi sulla Tradizione Filosofica Medievale</em>, 10:
155&ndash;93.</li>

<li>&ndash;&ndash;&ndash;, 1999b, &ldquo;F&acirc;r&acirc;b&icirc; i.
Biography&rdquo;, <em>Encyclopedia Iranica</em>, Vol. IX, Fasc. 2, pp.
208&ndash;213; current version
 [<a href="https://www.iranicaonline.org/articles/farabi-i" target="other">Gutas 1999b available online</a>]</li>
 
<li>Janos, Damien, 2012, <em>Method, Structure, and Development in
al-Farabi&rsquo;s Cosmology</em> (Islamic Philosophy, Theology and
Science. Texts and Studies, 85), Leiden: Brill.
doi:10.1163/9789004217324</li>

<li>&ndash;&ndash;&ndash;, 2016,
&ldquo;Al-F&#257;r&#257;b&#299;&rsquo;s (d. 950) On the One and
Oneness: Some Preliminary Remarks on Its Structure, Contents, and
Theological Implications&rdquo;, in <em>The Oxford Handbook of Islamic
Philosophy</em>, Khaled El-Rouayheb and Sabine Schmidtke (eds),
Oxford: Oxford University Press, pp. 101&ndash;28.</li>

<li>Menn, Stephen, 2008, &ldquo;Al-F&#257;r&#257;b&#299;&rsquo;s
<em>Kit&#257;b al-&#7716;ur&#363;f</em> and His Analysis of the Senses
of Being&rdquo;, <em>Arabic Sciences and Philosophy</em>, 18(1):
59&ndash;97. doi:10.1017/S0957423908000477</li>

<li>&ndash;&ndash;&ndash;, 2011, &ldquo;F&acirc;r&acirc;b&icirc; in
the Reception of Avicenna&rsquo;s Metaphysics: Averroes against
Avicenna on Being and Unity&rdquo;, in <em>The Arabic, Hebrew and
Latin Reception of Avicenna&rsquo;s Metaphysics</em>, Dag Hasse and
Amos Bertolacci (eds), Berlin: De Gruyter, pp. 51&ndash;96.
doi:10.1515/9783110215762.51</li>

<li>Rashed, Marwan, 2009, &ldquo;On the Authorship of the Treatise
<em>On the Harmonization of the Opinions of the Two Sages</em>
Attributed to al-F&#257;r&#257;b&#299;&rdquo;, <em>Arabic Sciences and
Philosophy</em>, 19(1): 43&ndash;82.
doi:10.1017/S0957423909000587</li>

<li>Rudolph, Ulrich, 2008, &ldquo;Reflections on
al-F&acirc;r&acirc;b&icirc;&rsquo;s <em>Mab&acirc;di&#702;
&acirc;r&acirc;&#702; ahl al-ma&#7693;&icirc;na
al-f&acirc;dila</em>&rdquo;, in <em>In the Age of
al-F&acirc;r&acirc;b&icirc;: Arabic Philosophy in the Fourth/Tenth
Century</em>, Peter Adamson (ed.), London: Warburg Institute, pp.
1&ndash;14.</li>

<li>&ndash;&ndash;&ndash;, 2017, &ldquo;Ab&ucirc; Na&#7779;r
al-F&acirc;r&acirc;b&icirc;&rdquo;, in <em>Philosophy in the Islamic
World, Volume 1: 8th&ndash;10th Centuries</em>, Ulrich Rudolph,
Rotraud Hansberger, and Peter Adamson (eds), Rotraud Hansberger (tr),
Leiden: Brill, pp. 526&ndash;654.</li>

<li>Shiloah, Amnon, 1971, &ldquo;Trait&eacute;s de musique dans le Ms.
1705 de Manisa&rdquo;, <em>Israel Oriental Studies</em>, 1:
305&ndash;7.</li>

<li>Vallat, Philippe, 2004, <em>Farabi et l&rsquo;&eacute;cole
d&rsquo;Alexandrie</em>, Paris: Vrin.</li>

<li>Watt, John W., 2008, &ldquo;Al-F&acirc;r&acirc;b&icirc; and the
History of the Syriac Organon&rdquo;, in <em>Malphono w-Rabo
d-Malphone: Studies in Honor of Sebastian P. Brock</em>, George A.
Kiraz (ed.), Piscataway, NJ: Gorgias Press, pp. 703&ndash;731.</li>
</ul>
</div> 

<div id="academic-tools">

<h2 id="Aca">Academic Tools</h2>

<blockquote>
<table class="vert-top">
<tr>
<td><img src="../../symbols/sepman-icon.jpg" alt="sep man icon" /></td>
<td><a href="https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=al-farabi-metaphysics" target="other">How to cite this entry</a>.</td>
</tr>

<tr>
<td><img src="../../symbols/sepman-icon.jpg" alt="sep man icon" /></td>
<td><a href="https://leibniz.stanford.edu/friends/preview/al-farabi-metaphysics/" target="other">Preview the PDF version of this entry</a> at the
 <a href="https://leibniz.stanford.edu/friends/" target="other">Friends of the SEP Society</a>.</td>
</tr>

<tr>
<td><img src="../../symbols/inpho.png" alt="inpho icon" /></td>
<td><a href="https://www.inphoproject.org/entity?sep=al-farabi-metaphysics&amp;redirect=True" target="other">Look up topics and thinkers related to this entry</a>
 at the Internet Philosophy Ontology Project (InPhO).</td>
</tr>

<tr>
<td><img src="../../symbols/pp.gif" alt="phil papers icon" /></td>
<td><a href="https://philpapers.org/sep/al-farabi-metaphysics/" target="other">Enhanced bibliography for this entry</a>
at <a href="https://philpapers.org/" target="other">PhilPapers</a>, with links to its database.</td>
</tr>

</table>
</blockquote>


</div>

<div id="other-internet-resources">

<h2 id="Oth">Other Internet Resources</h2>

<p>[Please contact the author with suggestions.]</p>

</div>

<div id="related-entries">

<h2 id="Rel">Related Entries</h2>

<p>

 <a href="../al-farabi/index.html">al-Farabi</a> |
 <a href="../al-farabi-logic/index.html">al-Farabi: philosophy of logic and language</a> |
 <a href="../al-farabi-soc-rel/index.html">al-Farabi: philosophy of society and religion</a> |
 <a href="../al-farabi-psych/index.html">al-Farabi: psychology and epistemology</a> |
 <a href="../arabic-islamic-metaphysics/index.html">Arabic and Islamic Philosophy, disciplines in: metaphysics</a> |
 <a href="../aristotle-metaphysics/index.html">Aristotle, General Topics: metaphysics</a>

</p>

</div> 


</div><!-- #aueditable --><!--DO NOT MODIFY THIS LINE AND BELOW-->

<!-- END ARTICLE HTML -->

</div> <!-- End article-content -->

  <div id="article-copyright">
    <p>
 <a href="../../info.html#c">Copyright &copy; 2021</a> by

<br />
Stephen Menn
&lt;<a href="m&#97;ilto:stephen&#37;2emenn&#37;40mcgill&#37;2eca"><em>stephen<abbr title=" dot ">&#46;</abbr>menn<abbr title=" at ">&#64;</abbr>mcgill<abbr title=" dot ">&#46;</abbr>ca</em></a>&gt;
    </p>
  </div>

</div> <!-- End article -->

<!-- NOTE: article banner is outside of the id="article" div. -->
<div id="article-banner" class="scroll-block">
  <div id="article-banner-content">
    <a href="../../fundraising/index.html">
    Open access to the SEP is made possible by a world-wide funding initiative.<br />
    The Encyclopedia Now Needs Your Support<br />
    Please Read How You Can Help Keep the Encyclopedia Free</a>
  </div>
</div> <!-- End article-banner -->

    </div> <!-- End content -->

    <div id="footer">

      <div id="footer-menu">
        <div class="menu-block">
          <h4><i class="icon-book"></i> Browse</h4>
          <ul role="menu">
            <li><a href="../../contents.html">Table of Contents</a></li>
            <li><a href="../../new.html">What's New</a></li>
            <li><a href="https://plato.stanford.edu/cgi-bin/encyclopedia/random">Random Entry</a></li>
            <li><a href="../../published.html">Chronological</a></li>
            <li><a href="../../archives/index.html">Archives</a></li>
          </ul>
        </div>
        <div class="menu-block">
          <h4><i class="icon-info-sign"></i> About</h4>
          <ul role="menu">
            <li><a href="../../info.html">Editorial Information</a></li>
            <li><a href="../../about.html">About the SEP</a></li>
            <li><a href="../../board.html">Editorial Board</a></li>
            <li><a href="../../cite.html">How to Cite the SEP</a></li>
            <li><a href="../../special-characters.html">Special Characters</a></li>
            <li><a href="../../tools/index.html">Advanced Tools</a></li>
            <li><a href="../../contact.html">Contact</a></li>
          </ul>
        </div>
        <div class="menu-block">
          <h4><i class="icon-leaf"></i> Support SEP</h4>
          <ul role="menu">
            <li><a href="../../support/index.html">Support the SEP</a></li>
            <li><a href="../../support/friends.html">PDFs for SEP Friends</a></li>
            <li><a href="../../support/donate.html">Make a Donation</a></li>
            <li><a href="../../support/sepia.html">SEPIA for Libraries</a></li>
          </ul>
        </div>
      </div> <!-- End footer menu -->

      <div id="mirrors">
        <div id="mirror-info">
          <h4><i class="icon-globe"></i> Mirror Sites</h4>
          <p>View this site from another server:</p>
        </div>
        <div class="btn-group open">
          <a class="btn dropdown-toggle" data-toggle="dropdown" href="https://plato.stanford.edu/">
            <span class="flag flag-usa"></span> USA (Main Site) <span class="caret"></span>
            <span class="mirror-source">Philosophy, Stanford University</span>
          </a>
          <ul class="dropdown-menu">
            <li><a href="../../mirrors.html">Info about mirror sites</a></li>
          </ul>
        </div>
      </div> <!-- End mirrors -->
      
      <div id="site-credits">
        <p>The Stanford Encyclopedia of Philosophy is <a href="../../info.html#c">copyright &copy; 2021</a> by <a href="http://mally.stanford.edu/">The Metaphysics Research Lab</a>, Department of Philosophy, Stanford University</p>
        <p>Library of Congress Catalog Data: ISSN 1095-5054</p>
      </div> <!-- End site credits -->

    </div> <!-- End footer -->

  </div> <!-- End container -->

   <!-- NOTE: Script required for drop-down button to work (mirrors). -->
  <script>
    $('.dropdown-toggle').dropdown();
  </script>

</body>

<!-- Mirrored from seop.illc.uva.nl/entries/al-farabi-metaphysics/ by HTTrack Website Copier/3.x [XR&CO'2014], Wed, 22 Jun 2022 19:37:25 GMT -->
</html>
