<!DOCTYPE html>
<!--[if lt IE 7]> <html class="ie6 ie"> <![endif]-->
<!--[if IE 7]>    <html class="ie7 ie"> <![endif]-->
<!--[if IE 8]>    <html class="ie8 ie"> <![endif]-->
<!--[if IE 9]>    <html class="ie9 ie"> <![endif]-->
<!--[if !IE]> --> <html> <!-- <![endif]-->

<!-- Mirrored from seop.illc.uva.nl/entries/abu-bakr-al-razi/ by HTTrack Website Copier/3.x [XR&CO'2014], Wed, 22 Jun 2022 19:37:29 GMT -->
<head>
<meta name="viewport" content="width=device-width, initial-scale=1.0" />
<title>
Abu Bakr al-Razi (Stanford Encyclopedia of Philosophy)
</title>
<meta http-equiv="Content-Type" content="text/html; charset=utf-8" />
<meta name="robots" content="noarchive, noodp" />
<meta property="citation_title" content="Abu Bakr al-Razi" />
<meta property="citation_author" content="Adamson, Peter" />
<meta property="citation_publication_date" content="2021/05/19" />
<meta name="DC.title" content="Abu Bakr al-Razi" />
<meta name="DC.creator" content="Adamson, Peter" />
<meta name="DCTERMS.issued" content="2021-05-19" />
<meta name="DCTERMS.modified" content="2021-05-19" />

<!-- NOTE: Import webfonts using this link: -->
<link href="https://fonts.googleapis.com/css?family=Source+Sans+Pro:400,300,600,200&amp;subset=latin,latin-ext" rel="stylesheet" type="text/css" />

<link rel="stylesheet" type="text/css" media="screen,handheld" href="../../css/bootstrap.min.css" />
<link rel="stylesheet" type="text/css" media="screen,handheld" href="../../css/bootstrap-responsive.min.css" />
<link rel="stylesheet" type="text/css" href="../../css/font-awesome.min.css" />
<!--[if IE 7]> <link rel="stylesheet" type="text/css" href="../../css/font-awesome-ie7.min.css"> <![endif]-->
<link rel="stylesheet" type="text/css" media="screen,handheld" href="../../css/style.css" />
<link rel="stylesheet" type="text/css" media="print" href="../../css/print.css" />
<link rel="stylesheet" type="text/css" href="../../css/entry.css" />
<!--[if IE]> <link rel="stylesheet" type="text/css" href="../../css/ie.css" /> <![endif]-->
<script type="text/javascript" src="../../js/jquery-1.9.1.min.js"></script>
<script type="text/javascript" src="../../js/bootstrap.min.js"></script>

<!-- NOTE: Javascript for sticky behavior needed on article and ToC pages -->
<script type="text/javascript" src="../../js/jquery-scrolltofixed-min.js"></script>
<script type="text/javascript" src="../../js/entry.js"></script>

<!-- SEP custom script -->
<script type="text/javascript" src="../../js/sep.js"></script>
</head>

<!-- NOTE: The nojs class is removed from the page if javascript is enabled. Otherwise, it drives the display when there is no javascript. -->
<body class="nojs article" id="pagetopright">
<div id="container">
<div id="header-wrapper">
  <div id="header">
    <div id="branding">
      <div id="site-logo"><a href="../../index.html"><img src="../../symbols/sep-man-red.png" alt="SEP logo" /></a></div>
      <div id="site-title"><a href="../../index.html">Stanford Encyclopedia of Philosophy</a></div>
    </div>
    <div id="navigation">
      <div class="navbar">
        <div class="navbar-inner">
          <div class="container">
            <button class="btn btn-navbar collapsed" data-target=".collapse-main-menu" data-toggle="collapse" type="button"> <i class="icon-reorder"></i> Menu </button>
            <div class="nav-collapse collapse-main-menu in collapse">
              <ul class="nav">
                <li class="dropdown open"><a id="drop1" href="#" class="dropdown-toggle" data-toggle="dropdown" role="button"><i class="icon-book"></i> Browse</a>
                  <ul class="dropdown-menu" role="menu" aria-labelledby="drop1">
                    <li><a href="../../contents.html">Table of Contents</a></li>
                    <li><a href="../../new.html">What's New</a></li>
                    <li><a href="https://plato.stanford.edu/cgi-bin/encyclopedia/random">Random Entry</a></li>
                    <li><a href="../../published.html">Chronological</a></li>
                    <li><a href="../../archives/index.html">Archives</a></li>
                  </ul>
                </li>
                <li class="dropdown open"><a id="drop2" href="#" class="dropdown-toggle" data-toggle="dropdown" role="button"><i class="icon-info-sign"></i> About</a>
                  <ul class="dropdown-menu" role="menu" aria-labelledby="drop2">
                    <li><a href="../../info.html">Editorial Information</a></li>
                    <li><a href="../../about.html">About the SEP</a></li>
                    <li><a href="../../board.html">Editorial Board</a></li>
                    <li><a href="../../cite.html">How to Cite the SEP</a></li>
                    <li><a href="../../special-characters.html">Special Characters</a></li>
                    <li><a href="../../tools/index.html">Advanced Tools</a></li>
                    <li><a href="../../contact.html">Contact</a></li>
                  </ul>
                </li>
                <li class="dropdown open"><a id="drop3" href="#" class="dropdown-toggle" data-toggle="dropdown" role="button"><i class="icon-leaf"></i> Support SEP</a>
                  <ul class="dropdown-menu" role="menu" aria-labelledby="drop3">
                    <li><a href="../../support/index.html">Support the SEP</a></li>
                    <li><a href="../../support/friends.html">PDFs for SEP Friends</a></li>
                    <li><a href="../../support/donate.html">Make a Donation</a></li>
                    <li><a href="../../support/sepia.html">SEPIA for Libraries</a></li>
                  </ul>
                </li>
              </ul>
            </div>
          </div>
        </div>
      </div>
    </div>
    <!-- End navigation -->
    
    <div id="search">
      <form id="search-form" method="get" action="https://seop.illc.uva.nl/search/searcher.py">
        <input type="search" name="query" placeholder="Search SEP" />
        <div class="search-btn-wrapper"><button class="btn search-btn" type="submit"><i class="icon-search"></i></button></div>
      </form>
    </div>
    <!-- End search --> 
    
  </div>
  <!-- End header --> 
</div>
<!-- End header wrapper -->

<div id="content">

<!-- Begin article sidebar -->
<div id="article-sidebar" class="sticky">
  <div class="navbar">
    <div class="navbar-inner">
      <div class="container">
        <button class="btn btn-navbar" data-target=".collapse-sidebar" data-toggle="collapse" type="button"> <i class="icon-reorder"></i> Entry Navigation </button>
        <div id="article-nav" class="nav-collapse collapse-sidebar in collapse">
          <ul class="nav">
            <li><a href="#toc">Entry Contents</a></li>
            <li><a href="#Bib">Bibliography</a></li>
            <li><a href="#Aca">Academic Tools</a></li>
            <li><a href="https://leibniz.stanford.edu/friends/preview/abu-bakr-al-razi/">Friends PDF Preview <i class="icon-external-link"></i></a></li>
            <li><a href="https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=abu-bakr-al-razi">Author and Citation Info <i class="icon-external-link"></i></a> </li>
            <li><a href="#pagetopright" class="back-to-top">Back to Top <i class="icon-angle-up icon2x"></i></a></li>
          </ul>
        </div>
      </div>
    </div>
  </div>
</div>
<!-- End article sidebar --> 

<!-- NOTE: Article content must have two wrapper divs: id="article" and id="article-content" -->
<div id="article">
<div id="article-content">

<!-- BEGIN ARTICLE HTML -->


<div id="aueditable"><!--DO NOT MODIFY THIS LINE AND ABOVE-->

<h1>Abu Bakr al-Razi</h1><div id="pubinfo"><em>First published Wed May 19, 2021</em></div>

<div id="preamble">

<p>
Ab&#363; Bakr al-R&#257;z&#299; (865&ndash;925 CE, 251&ndash;313 AH)
was one of the greatest figures in the history of medicine in the
Islamic tradition, and one of its most controversial philosophers.
While we have ample surviving evidence for his medical thought, his
philosophical ideas mostly have to be pieced together on the basis of
reports found in other authors, who are often hostile to him. This
concerns especially his notorious critique of religion, and his
teaching that the cosmos is produced through the interaction of five
&ldquo;eternal principles&rdquo;, namely God, Soul, matter, time, and
place. We do however have direct access to one branch of his
philosophy, namely ethics, represented by a work of advice called
<em>The Spiritual Medicine</em> and a briefer rejoinder to his
critics, <em>The Philosophical Way of Life</em>. (Note that Ab&#363;
Bakr is not to be confused with other philosophers from the same city
of Rayy, who are also called al-R&#257;z&#299;: the most famous of
these is Fakhr al-D&#299;n al-R&#257;z&#299;, who wrote several
centuries later.)</p>

</div> 

<div id="toc"><!--Entry Contents-->

<ul>
<li><a href="#LifeWork">1. Life and Works</a></li>
<li><a href="#FiveEterPrin">2. The Five Eternal Principles</a></li>
<li><a href="#Ethi">3. Ethics</a></li>
<li><a href="#MediDoub">4. Medicine and the <em>Doubts</em></a></li>
<li><a href="#ReliProp">5. Religion and Prophecy</a></li>
<li><a href="#Lega">6. Legacy</a></li>
<li><a href="#Bib">Bibliography</a>
	<ul>
	<li><a href="#PrimSourTran">Primary sources and translations</a></li>
	<li><a href="#SecoSour">Secondary Sources</a></li>
	</ul>
	</li>
<li><a href="#Aca">Academic Tools</a></li>
<li><a href="#Oth">Other Internet Resources</a></li>
<li><a href="#Rel">Related Entries</a></li>
</ul>

<!--Entry Contents-->

<hr />

</div>

<div id="main-text">

<h2 id="LifeWork">1. Life and Works</h2>

<p>
Ab&#363; Bakr Mu&#7717;ammad ibn Zakariyy&#257;&#702;
al-R&#257;z&#299; made his fame mostly as a doctor. As his name
&ldquo;al-R&#257;z&#299;&rdquo; indicates, he hailed from the Persian
city of Rayy, near modern-day Tehran. His biographers report that he
ran a hospital there, and another in Baghdad. He received patronage
from Ab&#363; &#7778;&#257;li&#7717; al-Man&#7779;&#363;r (d. 914),
the governor of Rayy, to whom al-R&#257;z&#299; dedicated a
substantial medical treatise, <em>The Book for
al-Man&#7779;&#363;r</em>. We have a variety of anecdotes about
al-R&#257;z&#299;&rsquo;s medical practice, some found in his own
works and some in his medieval biographers, for instance that
al-R&#257;z&#299; would deal only with patients whose condition
stumped his students. We also know, because he tells us himself, that
he suffered from eye problems and a hand injury from copious reading,
copying, and writing.</p>

<p>
This latter piece of information is found in <em>The Philosophical Way
of Life</em>, which is a good first text to read by al-R&#257;z&#299;
(Arabic edition in al-R&#257;z&#299;
 <a href="#bib-RF">RF</a>;
 English translation in al-R&#257;z&#299;
 <a href="#bib-PWL">PWL</a>).
 In it he rebuts accusations that he is a hypocrite for claiming to
model his lifestyle on that of Socrates, when in fact Socrates was
rigorously ascetic and al-R&#257;z&#299; is not (see Strohmaier 1974).
Al-R&#257;z&#299; responds by saying that reports of Socrates&rsquo;
asceticism, which unbeknownst to him go back to a confusion in the
sources between Socrates and Diogenes the Cynic, do not tell the whole
story. In fact Socrates adopted a lifestyle of moderation as he
matured, and it is this model that al-R&#257;z&#299; imitates.</p>

<p>
This is one of only two complete surviving works by al-R&#257;z&#299;
devoted solely to a philosophical topic; the other one also deals with
ethics. This is <em>The Spiritual Medicine</em> (Arabic edition in
al-R&#257;z&#299; RF; English translation in al-R&#257;z&#299;
 <a href="#bib-SPR">SPR</a>
 and for discussion Adamson 2016), a longer book of ethical advice
presented to his patron al-Man&#7779;&#363;r as a complement to the
aforementioned medical treatise. Here al-R&#257;z&#299; offers
treatment for the soul, following on his overview of treatments for
the body (Adamson 2019). Apart from this, the most significant
surviving work for his philosophy is his <em>Doubts about Galen</em>
(Arabic critical edition and translation by Koetschet in
al-R&#257;z&#299;
 <a href="#bib-DG">DG</a>).
 Al-R&#257;z&#299; considered Galen the greatest of medical
authorities, but on the basis of Galen&rsquo;s own critical attitude
towards esteemed predecessors, felt free to critique weak points in
the extensive corpus of Galenic works that had been translated into
Arabic. While a number of these points naturally concern medicine, the
<em>Doubts</em> also touches on a wide range of philosophical issues,
as discussed below.</p>

<p>
Beyond this, the extant writings have to do mostly with medicine,
including a number of smaller treatises, like a celebrated text on the
difference between smallpox and measles (English translation in
al-R&#257;z&#299;
 <a href="#bib-SM">SM</a>), and the by no means small <em>Comprehensive Book</em>, a
staggeringly huge collection of notes on medicine that was compiled by
al-R&#257;z&#299;&rsquo;s students after his death. The
<em>Comprehensive Book</em> is sometimes said to present
al-R&#257;z&#299;&rsquo;s &ldquo;case notes&rdquo;. But, while it is
true that he reports on his own medical experiences, the work is more
accurately described as a collection of excerpts from Greek and Arabic
medical sources. When he does introduce &ldquo;case notes&rdquo; this
is to provide counterexamples and amplifications for the textual
evidence (Savage-Smith 2012). Broadly speaking, despite his often
harsh diatribe against Galen&rsquo;s failures in the <em>Doubts</em>,
al-R&#257;z&#299;&rsquo;s own medical theories fall broadly within the
Galenic framework, and thus deploy such standard concepts as the four
humors, the natural powers of the body, and the role of
<em>pneuma</em> in explaining animal sensation and motion.</p>

<p>
A final group of works that come down to us from al-R&#257;z&#299;
discuss alchemy (Ruska 1935). He was evidently a practicing alchemist
and describes in detail a wide variety of chemical procedures, all
aimed towards the goal of manufacturing valuable minerals and stones,
or likenesses thereof. It may be that al-R&#257;z&#299;&rsquo;s
atomist theory of matter provided him with a basis for understanding
these processes. Chemical transformation would involve breaking down
complex substances to more primitive particles and then recombining
them in other proportions to produce the desired result (Kraus
1942&ndash;3: vol. 2, 10&ndash;11; Adamson 2021: 96&ndash;98).</p>

<p>
Beyond these extant works we have reports on the full range of
al-R&#257;z&#299;&rsquo;s writings by later authors who recorded lists
of their titles. These confirm that he wrote much on medicine,
philosophy, and alchemy, as well as mathematics, logic, and poetry.
Most eye-catching here, though, are works in which he discussed
religion and, especially, prophecy. The latter bear titles like <em>On
the Tricks of Supposed Prophets</em> and <em>On the Necessity of the
Prophetic Mission</em>. That could just show that he was concerned to
refute the claims of spurious prophets, while accepting the legitimacy
of true prophets. But in reports by still other authors, we are given
a picture of al-R&#257;z&#299; as a fundamentally anti-religious
author who rejected all revelation and prophecy. This is especially
the case with al-R&#257;z&#299;&rsquo;s contemporary, also from Rayy,
Ab&#363; &#7716;&#257;tim al-R&#257;z&#299; (d. 934). In a treatise
called <em>The Proofs of Prophecy</em>, Ab&#363; &#7716;&#257;tim
recounts face-to-face debates he had with al-R&#257;z&#299; and then
summarizes, and elaborately refutes, a treatise by al-R&#257;z&#299;
that supposedly sought to unmask the falsehoods of all revelatory
religious traditions (see
 <a href="#bib-AHR">AHR</a>
 in the bibliography).</p>

<p>
Along with Ab&#363; &#7716;&#257;tim, two other sources are crucial
for reconstructing al-R&#257;z&#299;&rsquo;s cosmology. These are
Na&#7779;&#299;r-e Khosraw (d. 1088), who explained this cosmology in
order to refute it in his Persian work <em>Provision for the
Traveler</em> (hereafter
 <a href="#bib-NK">NK</a>,
 selective trans. into Arabic in al-R&#257;z&#299; RF), and yet
another al-R&#257;z&#299;, this time the famous theologian-philosopher
Fakhr al-D&#299;n al-R&#257;z&#299; (d. 1210), in his <em>Exalted
Topics</em> (hereafter
 <a href="#bib-FDR">FDR</a>).
 From these and a few other sources, we can piece together the details
of a remarkable account of the creation of the world, which invokes
five factors that have always existed and come together to produce the
cosmos: God, Soul, matter, time, and place. Ab&#363; &#7716;&#257;tim
and Na&#7779;&#299;r-e Khosraw both present this as an appalling
departure from Islam, since it involves postulating four eternal
principles alongside God.</p>

<h2 id="FiveEterPrin">2. The Five Eternal Principles</h2>

<p>
Some reports suggest that al-R&#257;z&#299; saw his five principles as
having a systematic structure: God and Soul are active and alive,
matter passive and non-living, and time and place neither active, nor
passive, nor alive. But the scheme does not seem to be motivated by
its ability to satisfy all logical possibilities. Rather,
al-R&#257;z&#299; argues specifically for each of the five principles.
God&rsquo;s existence is demonstrated on the basis of the good design
of the universe; more contentious are the other four.</p>

<p>
While the Soul is invoked as the source of life in bodies, its primary
function in al-R&#257;z&#299;&rsquo;s philosophy is to facilitate a
distinctive theodicy. The presence of great suffering in the world,
alongside the aforementioned good design of that world, shows that it
cannot have been created directly by God. Furthermore,
al-R&#257;z&#299; is concerned with a traditional argument against the
eternity of the universe, namely that a perfectly wise and rational
God could not arbitrarily choose a moment for the universe to begin
existing. Both problems are solved by postulating a Soul which is
&ldquo;foolish&rdquo; where God is wise. The Soul conceives of a
desire or even passion (<em>&#703;ishq</em>) to be &ldquo;mixed&rdquo;
with matter, which initiates the process of the world&rsquo;s
creation. God intervenes to make the world as good as it can be, but
our bodily life is still inevitably full of pain.</p>

<p>
One question that arises here is why God would not prevent the Soul
from mixing with matter, if this is such a bad idea.
Al-R&#257;z&#299;&rsquo;s explanation is that God allows it to happen
as a learning experience for the Soul (Goodman 1975). God bestows upon
the Soul the gift of reason or intellect (<em>&#703;aql</em>), and
Soul can use this to realize that it should be working to free itself
from its unwise bond with matter (Druart 1996). We have reports of
parables used by al-R&#257;z&#299; to explain this. A wise father
might allow his inexperienced child to venture to a dangerous country,
but send with him a good advisor (namely the intellect; Fakhr
al-D&#299;n al-R&#257;z&#299;, FDR: vol. 4, 416). Similarly, a wise
father might allow his foolish child to go into an alluring garden
full of thorns and stinging insects, so as to teach the child a lesson
(Ab&#363; &#7716;&#257;tim al-R&#257;z&#299;, AHR: 18&ndash;19). This
theodicy points the way towards a conception of our ultimate end,
namely to escape from the material world, achieving
&ldquo;liberation&rdquo; through moderate lifestyle and the practice
of philosophy.</p>

<p>
As for matter, time, and place, these principles are required in order
that the universe may be created at all (for an overview see Fakhry
1968). First, al-R&#257;z&#299; thinks that there must already be some
material before the cosmos exists, out of which it is constructed. As
N&#257;&#7779;ir-e Khosraw (NK: 75) complains, al-R&#257;z&#299;
believed that creation <em>ex nihilo</em> was impossible. He argued
for this on the grounds that we constantly see things being produced
through lengthy processes of development, even though instantaneous
manifestation would be far easier and involve less suffering: he gives
the example of the need for childbirth and growth to maturity. His
point is that God would not cause this to happen, if He could just
make humans exist from nothing. Time and place are needed for an
analogous reason. Time cannot be created, since creation must occur
<em>at</em> a time, and place cannot be created, because there would
already need to be somewhere to put it.</p>

<p>
Al-R&#257;z&#299;&rsquo;s conception of matter is unusual among
<em>fal&#257;sifa</em>, that is, thinkers of the Islamic world who
respond primarily to the Greek philosophical tradition. More or less
all of them, from al-Kind&#299; (d. after 870) to
al-F&#257;r&#257;b&#299; (d. 950), Ibn S&#299;n&#257; (Avicenna, d.
1037), and Ibn Rushd (Averroes, d. 1198), endorse a broadly
Aristotelian understanding of bodies as potentially subject to
indefinite division. By contrast, al-R&#257;z&#299; is an atomist
(Pines 1936 [1997], Baffioni 1982, Langermann 2009). He believes that
the four elements (or possibly five: our sources are not clear as to
whether he thinks the heavens are constituted from a distinct fifth
element) differ in their properties because of variations in the ratio
of atoms to void. Thus earth, which has little or no void in it, is
dark, cold, dense, and moves downward; fire is luminous, hot, subtle,
and moves upward. Actually these are not strictly
&ldquo;elements&rdquo; but only the most basic compounds of atoms,
which are truly fundamental. Though contemporary Islamic theologians
were also atomists (Dhanani 1994), al-R&#257;z&#299;&rsquo;s theory
differs from theirs in some respects, and we know that he debated the
topic of matter with a theologian named
al-Mi&#7779;ma&#703;&#299;.</p>

<p>
Al-R&#257;z&#299; referred to atoms as &ldquo;absolute
(<em>mu&#7789;laq</em>) matter&rdquo;, a locution echoed in his
characterizations of the last two principles, namely &ldquo;absolute
time&rdquo; and &ldquo;absolute place&rdquo;. These are also known,
respectively, as &ldquo;eternity (<em>dahr</em>)&rdquo; or
&ldquo;duration (<em>mudda</em>)&rdquo; and &ldquo;void
(<em>khal&#257;&#702;</em>)&rdquo;. As we learn from the report of the
debate with Ab&#363; &#7716;&#257;tim, al-R&#257;z&#299; was concerned
to stress the independence of time and place from bodies, that is,
from composites of atoms (Ab&#363; &#7716;&#257;tim al-R&#257;z&#299;,
AHR: 12). Time in itself is simply eternal duration, with events
(including the creation of the world) and motions happening within
that duration. Similarly, place in itself is an infinite void, into
which the bounded physical cosmos is placed. As already explained,
void also exists (at least at the microscopic level) within the
cosmos, since its admixture into bodies explains the variation between
the elements.</p>

<p>
Al-R&#257;z&#299;&rsquo;s theories may be usefully contrasted to those
of Aristotle; we know he was familiar with Aristotle&rsquo;s
<em>Physics</em> because he tells us as much in his <em>Philosophical
Way of Life</em>. For Aristotle, time and place are dependent or
supervenient phenomena: place is the inner boundary of the body that
contains the body that is in place, while time is the number of
motion. Al-R&#257;z&#299; by contrast makes space-time independent.
For instance he proposed a thought experiment that, if the universe
were taken away, its place would remain (a similar idea is proposed by
Philoponus <em>in Phys.</em> 574, translated in Philoponus
 <a href="#bib-CPV">CPV</a>:
 36). However his attitude towards Aristotelian physics is more
nuanced than straightforward rejection (Adamson 2021: ch.5). For he
accepts that one may speak of &ldquo;relative&rdquo; time and place,
which would be the time and place of a particular motion and
particular body, respectively. For example a year would be a
demarcated segment of eternal duration that measures the sun&rsquo;s
motion along the ecliptic, while the place of a ball would be the
limit of the region of void occupied by the ball. Likewise,
al-R&#257;z&#299; includes the Aristotelian elements, earth, water,
air, fire, and perhaps ether, in his cosmology but does not accept
that these are fundamental. As just seen, the real
&ldquo;element&rdquo; that underlies them is atomic.</p>

<p>
Thus Aristotle managed to articulate genuine principles of physics,
but only &ldquo;relative&rdquo; ones that need to be understood within
a more basic framework. It was Plato who, in al-R&#257;z&#299;&rsquo;s
opinion, had gotten closest to putting forward that framework.
Ab&#363; &#7716;&#257;tim says that al-R&#257;z&#299; told him as
much: &ldquo;what Plato says is hardly different from what I believe
concerning time, and this, according to me, is the best thing that has
been said about it&rdquo; (Ab&#363; &#7716;&#257;tim
al-R&#257;z&#299;, AHR: 13). The text he must have in mind is
Plato&rsquo;s <em>Timaeus</em>, which he would have known through the
intermediary of Galen (see Galen,
 <a href="#bib-CTP">CTP</a>
 for the Arabic translation of his paraphrase of the dialogue). The
<em>Timaeus</em> likewise postulates a pre-existing matter that is
formed into the cosmos; it can also be read as suggesting that time
and place in some sense pre-exist the cosmos. Furthermore, Plato puts
forward an atomic theory in the <em>Timaeus</em>. In fact,
al-R&#257;z&#299; rises to the defense of that theory in <em>Doubts
about Galen</em> (al-R&#257;z&#299;, DG: &sect;15.1-6). So there is
good reason to believe that al-R&#257;z&#299; was modeling his
cosmology primarily on Plato&rsquo;s, as he understood it, albeit with
adjustments.</p>

<p>
On the other hand, Na&#7779;&#299;r-e Khosraw tells us that
al-R&#257;z&#299; plagiarized this whole theory from his teacher,
&#298;r&#257;nshahr&#299;. He is an obscure figure whose works are
lost, though al-B&#299;r&#363;n&#299; (d. ca. 1050) does speak of him
as an expert in astronomy and the diversity of religions. Another
witness, Ab&#363; l-Ma&#703;&#257;l&#299; (fl. 1092), has
&#298;r&#257;nshahr&#299; claiming to have been a prophet who had
received revelation from an angel, like the Prophet Muhammad did. He
reports that for &#298;r&#257;nshahr&#299;, all religions put forth a
single teaching, an idea which might be thought to resonate with
al-R&#257;z&#299;&rsquo;s own irenic, rationalist approach to
revelation. If Na&#7779;&#299;r-e Khosraw is right to trace the Razian
cosmology to this shadowy teacher, then perhaps we should think of
al-R&#257;z&#299;&rsquo;s project as a creative fusion of
&#298;r&#257;nshahri&rsquo;s ideas and Plato&rsquo;s.</p>

<h2 id="Ethi">3. Ethics</h2>

<p>
From the foregoing discussion of al-R&#257;z&#299;&rsquo;s theodicy it
may seem obvious that his ethical teaching would focus on the goal of
liberation from the body and its concerns. But as mentioned already,
his <em>Philosophical Way of Life</em> defends a lifestyle of
moderation, and distances itself from outright asceticism.
Furthermore, in this text he says that bodily pleasure may licitly be
sought so long as one does not transgress what he calls a &ldquo;limit
past which one may not go&rdquo;. This limit dictates that we should
partake of no pleasures</p>

<blockquote>

<p>
that can be attained only by engaging in evildoing, murder, and in
general anything that displeases God, when the judgment of intellect
and justice is that it is unnecessary. All else is permitted.
(al-R&#257;z&#299;, RF: 106&ndash;7)</p>
</blockquote>

<p>
On the other hand, in the <em>Spiritual Medicine</em> he seems to take
a dim view of pleasures, and offers advice for resisting the allure of
food, drink, sex, and luxury. One point made in both works is that it
is a violation of reason to enjoy things that entail more pain than
pleasure in the long run, like overeating. In the <em>Spiritual
Medicine</em> al-R&#257;z&#299; tells the story of how he chastized a
man who gobbled down a plate of dates, warning him that it would lead
to illnesses, and thus &ldquo;many times more pain than the pleasure
you have had&rdquo; (al-R&#257;z&#299;, RF: 71).</p>

<p>
Two interpretations have been offered to explain
al-R&#257;z&#299;&rsquo;s position on pleasure. According to Lenn E.
Goodman (1971, 1999, followed by Groff 2014), al-R&#257;z&#299; was
defending an Epicurean ethic in which pleasure should be maximized. On
this account, his rationale for moderation is that it is the way to
have the most pleasure: going too far with pleasures turns out to be
more painful in the long run. This interpretation has been criticized
by Adamson (2008a, 2021), on the grounds that it ignores
al-R&#257;z&#299;&rsquo;s own theory of pleasure. According to this
theory, which is clearly based on the <em>Timaeus</em>, pleasure can
be had only as the result of a process of removing a harmful state.
For example, drinking is pleasant because it eliminates thirst. On
this account of pleasure, as Plato himself pointed out, hedonism is an
attempt to win at a zero-sum game: you can only have pleasure to the
extent that you have suffered pain, or at least harm. (Not all harm is
felt as pain, just as not all restoration is felt as pleasure, because
only fast changes are noticeable.) Furthermore, al-R&#257;z&#299; says
himself in the <em>Doubts about Galen</em> (DG: &sect;7.7) that
pleasure is <em>not</em> the good to be sought in itself, which is a
direct rejection of the sort of hedonism adopted in Epicureanism.</p>

<p>
On this latter reading, much of al-R&#257;z&#299;&rsquo;s advice for
readers focuses on helping non-philosophers work towards a moderate
lifestyle, which will prepare them for the more serious and important
undertaking of adopting a &ldquo;philosophical way of life&rdquo; that
will ultimately lead to liberation from the body. Al-R&#257;z&#299;
himself seems to accept this distinction between
&ldquo;pre-philosophical&rdquo; and &ldquo;philosophical&rdquo; ethics
(Druart 1997, Adamson 2016), for example in the aforementioned passage
about the glutton who loves dates. Al-R&#257;z&#299; says he
threatened the man with stomach aches and illness because</p>

<blockquote>

<p>
this and other such remarks are of more benefit to someone who has not
engaged in philosophical training than proofs built on philosophical
principles.</p>
</blockquote>

<p>
As for the truly philosophical life, it resides in the Platonic ideal
of imitating God (<em>Theaetetus</em> 176b), realized through the
pursuit of wisdom and justice towards all living things. In a
remarkable passage of the <em>Philosophical Way of Life</em>,
al-R&#257;z&#299; stresses the importance of not mistreating beasts of
burden and other non-rational animals (Adamson 2012). This would
explain the &ldquo;upper limit&rdquo; placed on the pursuit of
justice: that limit does not derive from the need to maximize pleasure
and minimize pain, but from the injunction to avoid &ldquo;displeasing
God&rdquo; by engaging in injustice.</p>

<p>
In more recent publications this interpretive dispute seems to be
moving towards agreement. Goodman (2015) now concedes that
al-R&#257;z&#299;, unlike Epicurus, does not make pleasure the highest
good and sole criterion in ethics. He does however adopt a therapeutic
approach to ethics, which is characteristic of Epicureanism, as of
course is the advice to avoid things that bring pain than pleasure all
things considered. Adamson accepts this (2021: 6), but suggests that
the resonances with Epicureanism may rather reflect a more general
reception of Hellenistic ethics by al-R&#257;z&#299;, again through
the intermediary of Galen (see also Bar-Asher 1989).</p>

<h2 id="MediDoub">4. Medicine and the <em>Doubts</em></h2>

<p>
As yet, al-R&#257;z&#299;&rsquo;s extensive medical corpus has barely
been explored with a view to its philosophical significance. An
account of the human body and its primary organs in the <em>Spiritual
Life</em>&mdash;here ascribed to Plato&mdash;echoes what he says on
this topic in medical works (Adamson 2021: 57&ndash;58). His view,
following both Galen and the <em>Timaeus</em>, is that humans have
three general powers or faculties (<em>quwan</em>), the rational,
animal or irascible, and vegetative or desiderative, associated
respectively with the brain, heart, and liver. The rational soul is
not really seated in the brain, as the other two faculties are seated
in their organs; it uses the brain only as an instrument. In medical
contexts al-R&#257;z&#299; makes the same three organs to be the seats
of these powers, albeit that the power in the brain is instead called
&ldquo;psychic (<em>nafs&#257;n&#299;</em>)&rdquo;, perhaps to
acknowledge the fact that its powers of voluntary self-motion and
sensation also belong to irrational animals.</p>

<p>
Al-R&#257;z&#299;&rsquo;s views on medical epistemology are also
Galenic, and presuppose that the best doctor should understand the
human body at a theoretical level while also drawing on a wealth of
experience (Pormann 2008). This provides a methodological context for
understanding the aforementioned <em>Comprehensive Book</em>, which as
mentioned collects book-learning on medical theory, but uses
al-R&#257;z&#299;&rsquo;s own empirical observations to confirm or
disconfirm those theories.</p>

<p>
But the most rewarding medical text for philosophical readers is
<em>Doubts about Galen.</em> Or rather, it should be said that this
work deals with a range of philosophical, as well as medical, issues,
including the relation between soul and body, vision, atomism, and
pleasure (see the ample introduction by Koetschet in
al-R&#257;z&#299;, DG). Regarding the first of these issues,
al-R&#257;z&#299; criticizes Galen for suggesting that the soul is
entirely dependent on bodily states or &ldquo;temperament&rdquo;, that
is, the mixture of the body&rsquo;s constituents. As in the
<em>Spiritual Medicine</em>, he defends Plato&rsquo;s idea that the
rational part of the soul only uses the brain as an &ldquo;instrument
(<em>&#257;la</em>)&rdquo;, and that injury to the brain impedes
rational function only in the way that damage to a flute would make it
harder for the flute player to perform (al-R&#257;z&#299;, DG:
&sect;21.4). When it comes to vision, al-R&#257;z&#299; strikes a less
Platonist note, since he rejects Galen&rsquo;s
&ldquo;extramissionist&rdquo; theory, which is in part inspired by
Plato&rsquo;s <em>Timaeus</em>. According to Galen, spirit
(<em>pneuma</em>) is sent forth from the eyes and transforms air,
making it into an instrument for contacting the visual object
(Ierodiakonou 2014). Instead, al-R&#257;z&#299; defends the view that
incorporeal images are sent from the seen object and arrive at the eye
(Koetschet 2017a).</p>

<p>
One of the more elaborate philosophical discussions in the <em>Doubts
about Galen</em> comes early in the work, and is devoted to the
eternity of the world (this section is translated in PWL).
Al-R&#257;z&#299; here takes issue with Galen&rsquo;s suggestion that
empirical observation shows that the world was not created after not
existing. Galen&rsquo;s idea, based on a passage in Aristotle (<em>On
the Heavens</em> 1.3, 270b11&ndash;16), is that the universe seems to
be unchanging in its general features. If it is unchanging then it is
not liable to corruption, and what is incorruptible is also
ungenerable. Thus the universe has always existed, and always will.
Al-R&#257;z&#299; has little difficulty poking holes in this argument:
he points out that the universe could be unchanging for a long time,
and then be destroyed all at once, like a glass being smashed or a
building collapsing when previously solid ground under it gives way
(al-R&#257;z&#299;, DG: &sect;2.3). Furthermore, the incorruptibility
of the universe would not be guaranteed by its lacking a natural
tendency to decay. One also needs to rule out that there is some
external cause that could destroy it (al-R&#257;z&#299;, DG:
&sect;2.5). As often in the <em>Doubts</em>, al-R&#257;z&#299; is here
not trying to show that Galen&rsquo;s conclusion is wrong&mdash;though
in this case, we know that he thinks it is wrong&mdash;but that the
argument offered for the conclusion is not sufficient. Ironically,
this seems to be in accord with Galen&rsquo;s own original intention.
Galen&rsquo;s argument is taken from his <em>On Demonstration</em> and
was actually offered as an example of a proof that is <em>not</em>
demonstrative (Koetschet 2015). Al-R&#257;z&#299; is either being
remarkably contentious, or has lost sight of the context of the
argument: he even accuses Galen of being inconsistent, as he elsewhere
states that it cannot be proven whether or not the universe is
eternal.</p>

<h2 id="ReliProp">5. Religion and Prophecy</h2>

<p>
If the five eternal theory was considered problematic by
contemporaries and later authors, al-R&#257;z&#299;&rsquo;s views on
religion were considered utterly outrageous and heretical. In his
<em>Proofs of Prophecy</em>, Ab&#363; &#7716;&#257;tim selectively
quotes and paraphrases from a work by al-R&#257;z&#299; on this topic,
and presents him as having flatly denied the validity of prophetic
revelation. Accepting this evidence as more or less reliable, some
modern-day scholars have celebrated al-R&#257;z&#299; as a
&ldquo;freethinker&rdquo; comparable with such daringly unorthodox
thinkers as Ibn al-R&#257;wand&#299; (Urvoy 1996, Stroumsa 1999), or
even as having had pagan sympathies (Vallat 2015a, 2015b, 2016).
Against this, Fakhr al-D&#299;n al-R&#257;z&#299; quotes our
al-R&#257;z&#299; as having offered interpretations of the
Qur&#702;&#257;n, which were designed to show that this revelatory
text and indeed the whole history of prophecy was in agreement with
his own philosophy (this evidence is presented and discussed in Rashed
2000, 2008). The bio-bibliographical tradition is also ambiguous in
its evidence. For instance al-B&#299;r&#363;n&#299;, who clearly
admired al-R&#257;z&#299;, admits that he made foolish and obstinate
remarks about religion and prophecy. But another broadly favorable
witness, Ibn Ab&#299; U&#7779;aybi&#703;a, says that a supposed work
attacking religion was perhaps written by &ldquo;malicious enemies of
al-R&#257;z&#299; and ascribed to him&rdquo; (for references, see
Adamson 2021: 11).</p>

<p>
The most ample, if not necessarily trustworthy, evidence is found in
Ab&#363; &#7716;&#257;tim. He says that in face-to-face debate,
al-R&#257;z&#299; argued against prophecy on the grounds that it would
be unjust to single out only some people for knowledge that is useful
by everyone. Furthermore, appointing only a certain few as religious
leaders (<em>im&#257;m</em>s) would lead to dissension between their
followers (Ab&#363; &#7716;&#257;tim, AHR: 1). Followers of religious
law are guilty of the cardinal intellectual sin of the Islamic world,
<em>taql&#299;d</em>, which means uncritically adopting beliefs on the
basis of authority (AHR: 24). Instead, al-R&#257;z&#299; argues, God
gives reason (<em>&#703;aql</em>) to everyone, and in this respect
everyone is created equal, able to determine for themselves what goals
they should be pursuing. Furthermore, Ab&#363; &#7716;&#257;tim tells
us about a range of more specific religious teachings rejected by
al-R&#257;z&#299; in his book against prophecy, such as
anthropomorphic descriptions of God and the possibility of miracles,
including the inimitability of the Qur&#702;&#257;n
(<em>i&#703;j&#257;z</em>).</p>

<p>
In several respects this teaching on prophecy fits well with what we
know of al-R&#257;z&#299;&rsquo;s philosophy more generally. It
invokes the idea that reason is given to the soul as a gift from God,
something confirmed in other sources and suggested at the beginning of
al-R&#257;z&#299;&rsquo;s <em>Spiritual Medicine</em>. Furthermore,
Ab&#363; &#7716;&#257;tim has al-R&#257;z&#299; arguing that God would
not send prophets because this is an unreasonable and overly difficult
way to achieve His goals (Ab&#363; &#7716;&#257;tim, AHR: 1;
131&ndash;2). Why not just give everyone the ability to figure things
out for themselves? This same premise that God only proceeds in the
most rational way is also important in his theodicy as we know it from
other sources, as seen above. Furthermore the critique of
<em>taql&#299;d</em>, while admittedly commonplace, does sound like it
could come from al-R&#257;z&#299;: his irreverent approach to Galen
bears witness to a similar independence of mind, albeit in a very
different context.</p>

<p>
On the other hand, the evidence presented by Fakhr al-D&#299;n casts
serious doubt on the notion that al-R&#257;z&#299; was openly hostile
to the Islamic revelation. And this is backed up by evidence internal
to al-R&#257;z&#299;&rsquo;s own surviving works, for instance
acknowledgment of the preeminent value of &ldquo;books sent by
God&rdquo; in <em>Doubts about Galen</em> (al-R&#257;z&#299;, DG:
&sect;2.1). At a minimum it seems clear that al-R&#257;z&#299; was a
forthright rationalist, who believed that the truth of a revelatory
text would necessarily accord with the truth discoverable by human
reason. But that position would not be so remarkable: it is shared
from other philosophers of the Islamic world, from al-Kind&#299; to
al-F&#257;r&#257;b&#299; to Ibn Rushd. The question is whether
al-R&#257;z&#299; went further and insisted that revelation is
useless, or even counterproductive, as claimed by Ab&#363;
&#7716;&#257;tim.</p>

<p>
Recent material brought to light by Philippe Vallat (2015a, 2015b,
2016) could confirm this interpretation. It would show that
al-R&#257;z&#299; said in debate with a theologian named Ab&#363;
Q&#257;sim al-Balkh&#299;, also called al-Ka&#703;b&#299;, that
&ldquo;prophets are unnecessary, because we have reason which
suffices, assuming that prophecy is in accordance with reason&rdquo;
(on al-Ka&#703;b&#299; in general see El Omari 2016; and on their
debate Rashed 2000, Shihadeh 2006: 103). It has however been argued
that Vallat&rsquo;s new evidence cannot convincingly be linked to the
debate between al-Ka&#703;b&#299; and al-R&#257;z&#299;, who is never
named in these texts (Adamson 2021: 148&ndash;151). A different
approach would be to read Ab&#363; &#7716;&#257;tim as having
distorted al-R&#257;z&#299;&rsquo;s position, which may have been a
more targeted attack on schismatic and controversialist groups
including the Ism&#257;&#703;&#299;l&#299; branch of Islam to which
Ab&#363; &#7716;&#257;tim belonged. Ism&#257;&#703;&#299;lism is
characterized by its insistence on the need for a religious leader or
<em>im&#257;m</em> to guide the faithful to a true understanding of
Islam. It may have been this doctrine, and not prophecy more
generally, that al-R&#257;z&#299; attacked, as a signal example of the
dangers of <em>taql&#299;d</em> (Mohaghegh 1970: 160&ndash;1; Adamson
2021: 147).</p>

<h2 id="Lega">6. Legacy</h2>

<p>
Whatever the case, there is no doubt that the
Ism&#257;&#703;&#299;l&#299;s were especially hostile to
al-R&#257;z&#299;. Alongside Ab&#363; &#7716;&#257;tim
al-R&#257;z&#299; and the aforementioned Na&#7779;&#299;r-e Khosraw,
who was also an Ism&#257;&#703;&#299;l&#299;, one may mention another
representative of this group named &#7716;am&#299;d al-D&#299;n
al-Kirm&#257;n&#299; (d. after 1020), who attacked
al-R&#257;z&#299;&rsquo;s ethical teachings (&#7716;am&#299;d
al-D&#299;n al-Kirm&#257;n&#299;, see
 <a href="#bib-HDK">HDK</a>
 in bibliography). This is not to say that only
Ism&#257;&#703;&#299;l&#299; authors are critical of
al-R&#257;z&#299;, though. Another opponent, who polemicizes against
al-R&#257;z&#299;&rsquo;s cosmology and apparent belief in the
possibility of transmigration (al-R&#257;z&#299;, RF: 174), is the
Andalusian jurist and philosopher Ibn &#7716;azm. Also in the Western
Islamic world, Maimonides includes a diatribe against the Razian
theodicy in his <em>Guide for the Perplexed</em> (GP: &sect;3.12).
Though Ibn &#7716;azm associates other thinkers with
al-R&#257;z&#299;&rsquo;s teachings (al-R&#257;z&#299;, RF: 170 and
174) it does not seem that his daring ideas gained much traction among
later philosophers. Perhaps the most productive engagement with the
five eternal theory is found in Fakhr al-D&#299;n al-R&#257;z&#299;.
He gives a fair hearing to al-R&#257;z&#299;&rsquo;s account of place
and time, and adopts a similar view on the question of time in
particular (Adamson and Lammer 2020).</p>

<p>
In his primary vocation of medicine, too, al-R&#257;z&#299; had his
critics, including Ibn S&#299;n&#257;, his only rival for the title of
most influential figure in the Islamic medical tradition. In an
epistolary exchange with al-B&#299;r&#363;n&#299;, Ibn S&#299;n&#257;
says that al-R&#257;z&#299; overreached his competence in both
philosophy and medicine (&ldquo;he exceeded his abilities when lancing
abscesses and examining urine and feces&rdquo;, quoted at
al-R&#257;z&#299;, RF: 290). Al-R&#257;z&#299;&rsquo;s project in
<em>Doubts</em> was also deemed presumptuous by later medical writers,
who composed refutations of the work. Nonetheless,
al-R&#257;z&#299;&rsquo;s works were widely consulted by doctors in
the Islamic world, and he had a wide diffusion in the Latin speaking
world under the name &ldquo;Rhazes&rdquo;. This began in the medieval
period and persisted through the Renaissance, with sixty-seven printed
editions of his works before 1700 (Hasse 2016: 8). No less an
authority than Vesalius edited an older translation of
al-R&#257;z&#299;&rsquo;s <em>Book for al-Man&#7779;&#363;r</em>, and
al-R&#257;z&#299;&rsquo;s medical writings were on the teaching
syllabus at Bologna, the most important university in Europe for
medical training (Siriasi 1990: 131 and 178). The independent-minded
Girolamo Cardano, who in personality and diversity of interests was in
some ways the heir of Galen and al-R&#257;z&#299;, praised the latter
as one of several doctors from the Islamic world who had improved upon
Galenic medicine through empirical observation (<em>experimentum</em>)
(Siriasi 1997: 60). More recently, al-R&#257;z&#299; has been praised
for his innovative approach and for breakthroughs in the history of
medicine, for example by investigating differential diagnosis
(Iskandar 1962) and using a control group to test the efficacy of a
drug (Pormann 2008). Thus al-R&#257;z&#299; the doctor has had a more
illustrious posthumous career than al-R&#257;z&#299; the
philosopher.</p>
</div>

<div id="bibliography">

<h2 id="Bib">Bibliography</h2>

<h3 id="PrimSourTran">Primary sources and translations</h3>

<h4>Works by Ab&#363; Bakr Muhammad al-R&#257;z&#299;</h4>

<table class="cellpad-small cell-rl vert-top">
<tbody>
<tr>
  <td id="bib-RF">[RF]</td>
  <td>al-R&#257;z&#299;, 1939, <em>Ras&#257;&#702;il falsafiyya</em>
(<em>The Philosophical Way of Life</em>), Paul Kraus (ed.), Cairo:
Paul Barbey.</td> </tr>
<tr>
  <td id="bib-SPR">[SPR]</td>
  <td>Rhazes, <em>The Spiritual Physick of Rhazes</em>, Arthur J.
Arberry (trans.), London: John Murray, 1950.</td> </tr>
<tr>
  <td id="bib-SM">[SM]</td>
  <td>Rhazes, <em>A Treatise on the Small-Pox and Measles</em>,
William Alexander Greenhill (trans.), London: Sydenham Society, 1848.
 [<a href="https://archive.org/details/39002086344042.med.yale.edu/page/n5/mode/2up" target="other">available online</a>]</td>
 </tr>
<tr>
  <td id="bib-PWL">[PWL]</td>
  <td>al-R&#257;z&#299;, selections from several works, in
<em>Classical Arabic Philosophy: an Anthology of Sources</em>, Jon
McGinnis and David C. Reisman (trans.), Indianapolis, IN: Hackett,
2007, 36&ndash;43.</td> </tr>
<tr>
  <td id="bib-DG">[DG]</td>
  <td>al-R&#257;z&#299;, Ab&#363; Bakr, <em>Doutes sur Galien</em>
(Scientia Graeco-Arabica, 25), Pauline Koetschet (ed./trans.), Berlin:
de Gruyter, 2019. Arabic critical edition with French
translation.</td> </tr> </tbody>
</table>

<h4>Works by other authors</h4>

<table class="cellpad-small cell-rl vert-top">
<tbody>
<tr>
  <td id="bib-AHR">[AHR]</td>
  <td>Ab&#363; &#7716;&#257;tim al-R&#257;z&#299;, <em>The Proofs of
Prophecy: A Parallel English-Arabic Text</em> (<em>A&#699;l&#257;m
al-nub&#363;wah</em>), Tarif Khalidi, Provo, UT: Brigham Young
University Press, 2011.</td> </tr>

<tr>
  <td>&bullet;</td>
  <td>Ab&#363; H&#257;tim al-R&#257;z&#299;, 1989, &ldquo;Le temps,
l&rsquo;espace et la gen&egrave;se du monde selon Ab&#363; Bakr
al-R&#257;z&#299;. Pr&eacute;sentation et traduction des chapitres I,
3&ndash;4 du <em>Kit&#257;b al-nubuwwa</em> d&rsquo;Ab&#363;
H&#257;tim al-R&#257;z&#299;&rdquo;, Brion, Fabienne (trans.),
<em>Revue philosophique de Louvain</em>, 87(74): 139&ndash;164.</td>
</tr>

<tr>
  <td id="bib-FDR">[FDR]</td>
  <td>Fakhr al-D&#299;n al-R&#257;z&#299;, <em>al-Ma&#7789;&#257;lib
al-&#703;&#257;liya</em>, A.&#7716;. Al-Saqq&#257; (ed.), 9 vols,
Beirut: D&#257;r al-Kit&#257;b al-&#703;Arab&#299;, 1987.</td> </tr>
<tr>
  <td id="bib-inphys">[<em>In Phys.</em>]</td>
  <td>Philoponus, John, 517, <em>Commentary on Aristotle&rsquo;s
&lsquo;Physics&rsquo;</em>, H. Vitelli (ed.), <em>Commentaria in
Aristotelem Graeca</em> [<em>CAG</em>] XVI&ndash;XVII, Berlin: Reimer,
1887&ndash;88.</td> </tr>
<tr>
  <td id="bib-CPV">[CPV]</td>
  <td>&ndash;&ndash;&ndash;, &ldquo;Corollaries on Place and
Void&rdquo;, translated by David Furley in <em>Philoponus:
&ldquo;Corollaries on Place and Void&rdquo;, with Simplicius:
&ldquo;Against Philoponus on the Eternity of the World&rdquo;</em>,
David Furley and Christian Wildberg (trans.), London: Bloomsbury,
1991.</td> </tr>
<tr>
  <td id="bib-CTP">[CTP]</td>
  <td>Galen, <em>Compendium Timaei Platonis</em>, Paul Kraus and
Richard Walzer, London: Warburg Institute, 1951.</td> </tr>
<tr>
  <td id="bib-HDK">[HDK]</td>
  <td>&#7716;amid al-Din al-Kirm&#257;ni, <em>al-Aqw&#257;l
al-dhahabiyya</em>, ed. S. al-S&#257;wi, Tehran: Anjuman-e
Sh&#257;hansh&#257;h&#299;-e Falsafa-e &#298;r&#257;n, 1977.</td>
</tr>
<tr>
  <td id="bib-NK">[NK]</td>
  <td>N&#257;&#7779;ir-e Khosraw, 2014, <em>Z&#257;d
al-mus&#257;fir</em> (<em>Provision for the Traveler</em>),
Tehran.</td> </tr>
<tr>
  <td>[GP]</td>
  <td>Maimonides, <em>The Guide of the Perplexed</em>, trans. S.
Pines, Chicago: University of Chicago Press, 1963.</td> </tr> </tbody>
</table>

<h3 id="SecoSour">Secondary Sources</h3>

<ul class="hanging">

<li>Adamson, Peter, 2008a, &ldquo;Platonic Pleasures in Epicurus and
al-R&#257;z&#299;&rdquo;, in Adamson 2008b: 71&ndash;94.</li>

<li>&ndash;&ndash;&ndash; (ed.), 2008b <em>In the Age of
al-F&#257;r&#257;b&#299;: Arabic Philosophy in the Fourth/Tenth
Century</em>, London: Warburg Institute.</li>

<li>&ndash;&ndash;&ndash;, 2012, &ldquo;Ab&#363; Bakr
al-R&#257;z&#299; on Animals&rdquo;, <em>Archiv f&uuml;r Geschichte
der Philosophie</em>, 94(3): 249&ndash;273.
doi:10.1515/agph-2012-0011</li>

<li>&ndash;&ndash;&ndash;, 2016, &ldquo;Ab&#363; Bakr
al-R&#257;z&#299; (d. 925), <em>The Spiritual Medicine</em>&rdquo;, in
<em>The Oxford Handbook of Islamic Philosophy</em>, Khaled El-Rouayheb
and Sabine Schmitdke (eds), Oxford: Oxford University Press,
63&ndash;82.</li>

<li>&ndash;&ndash;&ndash;, 2019, &ldquo;Health in Arabic Ethical
Works&rdquo;, in <em>Health: a History</em>, Peter Adamson (ed.), New
York: Oxford University Press, 103&ndash;135.
doi:10.1093/oso/9780199916429.003.0006</li>

<li>&ndash;&ndash;&ndash;, 2021, <em>Great Medieval Thinkers:
al-R&#257;z&#299;</em>, New York: Oxford University Press.</li>

<li>Adamson, Peter and Andreas Lammer, 2020, &ldquo;Fakhr al-D&#299;n
al-R&#257;z&#299;&rsquo;s Platonist Account of the Essence of
Time&rdquo;, in <em>Philosophical Theology in Islam: The Later
Ash&#703;ar&#299; Tradition</em>, Ayman Shihadeh and Jan Thiele
(eds.), Leiden: Brill, 95&ndash;122.</li>

<li>Baffioni, Carmela, 1982, <em>Atomismo e antiatomismo nel pensiero
islamico</em>, Naples: Istituto universitario orientale.</li>

<li>Bar-Asher, Meir M., 1989, &ldquo;Quelques aspects de
l&rsquo;&eacute;thique d&rsquo;Ab&#363; Bakr al-R&#257;z&#299; et ses
origines dans l&rsquo;oeuvre de Galien&rdquo;, 2 parts, <em>Studia
Islamica</em>, 69: 5&ndash;38; 70: 119&ndash;147.</li>

<li>Daiber, Hans, 2016, &ldquo;Ab&#363; Bakr al-R&#257;z&#299;&rdquo;,
in <em>Philosophy in the Islamic World:
8<sup>th</sup>&ndash;10<sup>th</sup> Centuries</em>, Ulrich Rudolph,
Rotraud Hansberger, and Peter Adamson (eds.), Leiden: Brill,
381&ndash;420.</li>

<li>Dhanani, Alnoor, 1994, <em>The Physical Theory of Kal&#257;m:
Atoms, Space and Void in Basrian Mu&#703;tazil&#299; Cosmology</em>,
Leiden: Brill.</li>

<li>Druart, Th&eacute;r&egrave;se-Anne, 1996, &ldquo;Al-Razi&rsquo;s
Conception of the Soul: Psychological Background to his Ethics&rdquo;,
<em>Medieval Philosophy and Theology</em>, 5(2): 245&ndash;263.
 [<a href="https://hdl.handle.net/1813/56631" target="other">Druart 1996 available online</a>]</li>
 
<li>&ndash;&ndash;&ndash;, 1997, &ldquo;The Ethics of al-Razi
(865&ndash;925?)&rdquo;, <em>Medieval Philosophy and Theology</em>,
6(1): 47&ndash;71.
 [<a href="https://hdl.handle.net/1813/56638" target="other">Druart 1997 available online</a>]</li>
 
<li>&ndash;&ndash;&ndash;, 2003, &ldquo;Alrazi&rdquo;, in <em>A
Companion to Philosophy in the Middle Ages</em>, Jorge J. E. Gracia
and Timothy B. Noone (eds.), Oxford: Blackwell, 136&ndash;37.
doi:10.1002/9780470996669.ch20</li>

<li>El Omari, Racha, 2016, <em>The Theology of Ab&#363; l-Q&#257;sim
al-Balkh&#299;/al-Ka&#703;b&#299; (d.319/931)</em>, Leiden:
Brill.</li>

<li>Fakhry, Majid, 1968, &ldquo;A Tenth-Century Arabic Interpretation
of Plato&rsquo;s Cosmology&rdquo;, <em>Journal of the History of
Philosophy</em>, 6(1): 15&ndash;22.</li>

<li>Goodman, Lenn Evan, 1971, &ldquo;The Epicurean Ethic of Muhammad
Ibn Zakariya&rsquo; Ar-Razi&rdquo;, <em>Studia Islamica</em>, 34:
5&ndash;26. doi:10.2307/1595324</li>

<li>&ndash;&ndash;&ndash;, 1975, &ldquo;R&#257;z&#299;&rsquo;s Myth of
the Fall of Soul: its Function in his Philosophy&rdquo;, in <em>Essays
on Islamic Philosophy and Science</em>, George Fadlo Hourani (ed.),
Albany, NY: SUNY Press, 25&ndash;40.</li>

<li>&ndash;&ndash;&ndash;, 1999, &ldquo;R&#257;z&#299; and
Epicurus&rdquo;, in <em>Jewish and Islamic Philosophy:
Crosspollinations in the Classical Age</em>, Lenn E. Goodman (ed.),
Edinburgh: Edinburgh University Press, 35&ndash;67.</li>

<li>&ndash;&ndash;&ndash;, 2015, &ldquo;How Epicurean was
R&#257;z&#299;?&rdquo;, <em>Studia graeco-arabica</em>, 5:
247&ndash;280.
 [<a href="https://learningroads.cfs.unipi.it/wp-content/uploads/2015/10/10-SGA_V_2015_GOODMAN.pdf" target="other">Goodman 2015 available online</a>]</li>
 
<li>Groff, Peter S., 2014, &ldquo;Leaving the Garden:
Al-R&#257;z&#299; and Nietzsche as Wayward Epicureans&rdquo;,
<em>Philosophy East and West</em>, 64(4): 983&ndash;1017.
doi:10.1353/pew.2014.0084</li>

<li>Hasse, Dag Nikolaus, 2016, <em>Success and Suppression: Arabic
Sciences and Philosophy in the Renaissance</em>, Cambridge, MA:
Harvard University Press.</li>

<li>Ierodiakonou, Katerina, 2014, &ldquo;On Galen&rsquo;s Theory of
Vision&rdquo;, in <em>Philosophical Themes in Galen</em> (Bulletin of
the Institute of Classical Studies Supplements), Peter Adamson,
Rotraud Hansberger, and James Wilberding (eds.), London: Institute of
Classical Studies, 235&ndash;247.</li>

<li>Iskandar, Albert Zaki, 1962, &ldquo;<em>Al-R&#257;z&#299;,
al-&#7788;ab&#299;b al-Ikl&#299;n&#299;k&#299;</em>&rdquo;,
<em>Al-Mashreq</em> 56: 217&ndash;82; English translation by Zakia and
Peter E. Pormann in <em>Islamic Medical and Scientific Tradition,
Critical Concepts in Islamic Studies</em>, 4 vols, Peter E. Pormann
(ed.), London: 2011, vol. 1, 207&ndash;253.</li>

<li>Koetschet, Pauline, 2015, &ldquo;Galien, al-R&#257;z&#299;, et
l&rsquo;&eacute;ternit&eacute; du monde. Les fragment du trait&eacute;
<em>Sur la D&eacute;monstration</em> IV, dans les <em>Doutes sur
Galien</em>&rdquo;, <em>Arabic Sciences and Philosophy</em>, 25(2):
167&ndash;198. doi:10.1017/S0957423915000016</li>

<li>&ndash;&ndash;&ndash;, 2017a, &ldquo;Ab&#363; Bakr
al-R&#257;z&#299; on Vision&rdquo;, in <em>Philosophy and Medicine in
the Formative Period of Islam</em>, Peter Adamson and Peter E. Pormann
(eds.), London: Warburg Institute, 170&ndash;189.</li>

<li>&ndash;&ndash;&ndash;, 2017b, &ldquo;Ab&#363; Bakr
al-R&#257;z&#299; et le signe: fragment retrouv&eacute; d&rsquo;un
trait&eacute; logique perdu&rdquo;, <em>Arabic Sciences and
Philosophy</em>, 27(1): 75&ndash;114.
doi:10.1017/S0957423916000102</li>

<li>Kraus, Paul, 1942&ndash;3, <em>J&#257;bir Ibn
&#7716;ayy&#257;n</em>, 2 vols, Cairo: Institut d'arch&eacute;ologie
orientale.</li>

<li>Langermann, Y. Tzvi, 2009, &ldquo;Islamic Atomism and the Galenic
Tradition&rdquo;, <em>History of Science</em>, 47(3): 277&ndash;295.
doi:10.1177/007327530904700302</li>

<li>Lucchetta, Giulio A., 1987, <em>La natura e la sfera: la scienza
antica e le sue metafore nella critica di R&#257;z&#299;</em>, Lecce:
Milella.</li>

<li>Mohaghegh, Mahd&#299;, 1970, <em>Fils&#363;f-i-Rayy</em>,
Tehran: Intish&#257;r&#257;t-e Anjuman-e &#256;&#7791;&#257;r-e
Mill&#299;.</li>

<li>&ndash;&ndash;&ndash;, 1973, &ldquo;Al-R&#257;z&#299; f&#299;
al-&#7788;ibb al-R&#363;h&#257;n&#299;&rdquo;, <em>Ma&#703;&#257;rif
Isl&#257;m&#299;</em>, 14: 30&ndash;63.</li>

<li>Pines, Shlomo, 1936 [1997], <em>Beitr&auml;ge zur islamischen
Atomenlehre</em>, Berlin: Heine. Translated as <em>Studies in Islamic
Atomism</em>, Michael Schwarz (ed.), Jerusalem: Magnes.</li>

<li>Pormann, Peter E., 2008, &ldquo;Medical Methodology and Hospital
Practice: the Case of Fourth-/Tenth-Century Baghdad&rdquo;, in Adamson
2008b: 95&ndash;118.</li>

<li>Rashed, Marwan, 2000, &ldquo;Ab&#363; Bakr al-R&#257;z&#299; et le
<em>kal&#257;m</em>&rdquo;, <em>MIDEO</em>, 24: 39&ndash;54.
 [<a href="https://alkindi.ideo-cairo.org/manifestation/75369" target="other">Rashed 2000 available online</a>]</li>
 
<li>&ndash;&ndash;&ndash;, 2008, &ldquo;Ab&#363; Bakr
al-R&#257;z&#299; et la proph&eacute;tie&rdquo;, <em>MIDEO</em>, 27:
169&ndash;182.
 [<a href="https://alkindi.ideo-cairo.org/manifestation/211468" target="other">Rashed 2008 available online</a>]</li>
 
<li>Ruska, Julius, 1935, &ldquo;Die Alchemie
Ar-R&#257;z&#299;&rsquo;s.&rdquo;, <em>Der Islam</em>, 22(4):
281&ndash;319. doi:10.1515/islm.1935.22.4.281</li>

<li>Savage-Smith, Emilie, 2012, &ldquo;The Working Files of Rhazes:
Are the <em>J&#257;mi&#702;</em> and the <em>&#7716;&#257;w&#299;</em>
Identical?&rdquo; in <em>Medieval Arabic Thought: Essays in Honour of
Fritz Zimmermann</em>, Rotraud Hansberger, M. Afifi al-Akiti and
Charles Burnett (eds.), London: Warburg Institute, 163&ndash;180.</li>

<li>Shihadeh, Ayman, 2006, <em>The Teleological Ethics of Fakhr
al-D&#299;n al-R&#257;z&#299;</em>, Leiden: Brill.</li>

<li>Siriasi, Nancy G., 1990, <em>Medieval and Early Renaissance
Medicine: an Introduction to Knowledge and Practice</em>, Chicago:
Chicago University Press.</li>

<li>&ndash;&ndash;&ndash;, 1997 <em>The Clock and the Mirror: Girolamo
Cardano and Renaissance Medicine</em>, Princeton, NJ: Princeton
University Press.</li>

<li>Strohmaier, Gotthard, 1974, &ldquo;Die arabische Sokrateslegende
und ihre Urspr&uuml;nge&rdquo;, in <em>Studia Coptica</em>, Peter
Nagel (ed.), Berlin: Akademie, 121&ndash;136.</li>

<li>Stroumsa, Sarah, 1999, <em>Freethinkers of Medieval Islam: Ibn
al-R&#257;wand&#299;, Ab&#363; Bakr al-R&#257;z&#299;, and their
Impact on Islamic Thought</em>, Leiden: Brill.</li>

<li>Urvoy, Dominique, 1996, <em>Les penseurs libres dans l&rsquo;Islam
classique</em>, Paris: Michel.</li>

<li>Vallat, Philippe, 2015a, &ldquo;La chute de l&rsquo;homme,
fondement de l&rsquo;anthropologique, du religieux et du politique.
Les enseignement &lsquo;rhaziens&rsquo; d&rsquo;une comparaison entre
th&eacute;ologies islamique (sunnite) et chretienne (arabe et
latine)&rdquo;, in <em>L&rsquo;ordre social et les religions</em>
(<em>Studia Arabica</em> 25), Versailles: &Eacute;ditions de Paris,
197&ndash;273.</li>

<li>&ndash;&ndash;&ndash;, 2015b, &ldquo;Between Hellenism, Islam, and
Christianity: Ab&#363; Bakr al-R&#257;z&#299; and His Controversies
with Contemporary Mu&#703;tazilite Theologians as Reported by the
Ash&#703;arite Theologian and Philosopher Fakhr al-D&#299;n
al-R&#257;z&#299;&rdquo;, in <em>Ideas in Motion in Baghdad and
Beyond: Philosophical and Theological Exchanges between Christians and
Muslims in the Third/Ninth and Fourth/Tenth Centuries</em>, Damien
Janos (ed.), Leiden: Brill, 178&ndash;220.</li>

<li>&ndash;&ndash;&ndash;, 2016, &ldquo;Can Man Assess God&rsquo;s
Goodness? A Controversy Between Ab&#363; Bakr al-R&#257;z&#299; (d.
925) and Mu&#703;tazil&#299; Theologians&rdquo;, <em>MIDEO</em>, 31:
213&ndash;251.
 [<a href="https://journals.openedition.org/mideo/881" target="other">Vallat 2016 available online</a>]</li>
 </ul>

</div> 

<div id="academic-tools">

<h2 id="Aca">Academic Tools</h2>

<blockquote>
<table class="vert-top">
<tr>
<td><img src="../../symbols/sepman-icon.jpg" alt="sep man icon" /></td>
<td><a href="https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=abu-bakr-al-razi" target="other">How to cite this entry</a>.</td>
</tr>

<tr>
<td><img src="../../symbols/sepman-icon.jpg" alt="sep man icon" /></td>
<td><a href="https://leibniz.stanford.edu/friends/preview/abu-bakr-al-razi/" target="other">Preview the PDF version of this entry</a> at the
 <a href="https://leibniz.stanford.edu/friends/" target="other">Friends of the SEP Society</a>.</td>
</tr>

<tr>
<td><img src="../../symbols/inpho.png" alt="inpho icon" /></td>
<td><a href="https://www.inphoproject.org/entity?sep=abu-bakr-al-razi&amp;redirect=True" target="other">Look up topics and thinkers related to this entry</a>
 at the Internet Philosophy Ontology Project (InPhO).</td>
</tr>

<tr>
<td><img src="../../symbols/pp.gif" alt="phil papers icon" /></td>
<td><a href="https://philpapers.org/sep/abu-bakr-al-razi/" target="other">Enhanced bibliography for this entry</a>
at <a href="https://philpapers.org/" target="other">PhilPapers</a>, with links to its database.</td>
</tr>

</table>
</blockquote>

</div>

<div id="other-internet-resources">

<h2 id="Oth">Other Internet Resources</h2>

<ul>

 <li><a href="https://historyofphilosophy.net/al-razi" target="other">Episode on al-R&#257;z&#299;</a>
 in the History of Philosophy podcast.</li>
</ul>

</div>

<div id="related-entries">

<h2 id="Rel">Related Entries</h2>

<p>

 <a href="../arabic-islamic-natural/index.html">Arabic and Islamic Philosophy, disciplines in: natural philosophy and natural science</a> |
 <a href="../arabic-islamic-greek/index.html">Arabic and Islamic Philosophy, historical and methodological topics in: Greek sources</a> |
 <a href="../arabic-islamic-influence/index.html">Arabic and Islamic Philosophy, historical and methodological topics in: influence of Arabic and Islamic Philosophy on the Latin West</a> |
 <a href="../galen/index.html">Galen</a> |
 <a href="../ibn-sina/index.html">Ibn Sina [Avicenna]</a> |
 <a href="../philoponus/index.html">Philoponus</a>

</p>

</div> 

</div><!-- #aueditable --><!--DO NOT MODIFY THIS LINE AND BELOW-->

<!-- END ARTICLE HTML -->

</div> <!-- End article-content -->

  <div id="article-copyright">
    <p>
 <a href="../../info.html#c">Copyright &copy; 2021</a> by

<br />
<a href="https://www.philosophie.uni-muenchen.de/lehreinheiten/philosophie_6/personen/adamson/index.html" target="other">Peter Adamson</a>
&lt;<a href="m&#97;ilto:peter&#37;2eadamson&#37;40lrz&#37;2euni-muenchen&#37;2ede"><em>peter<abbr title=" dot ">&#46;</abbr>adamson<abbr title=" at ">&#64;</abbr>lrz<abbr title=" dot ">&#46;</abbr>uni-muenchen<abbr title=" dot ">&#46;</abbr>de</em></a>&gt;
    </p>
  </div>

</div> <!-- End article -->

<!-- NOTE: article banner is outside of the id="article" div. -->
<div id="article-banner" class="scroll-block">
  <div id="article-banner-content">
    <a href="../../fundraising/index.html">
    Open access to the SEP is made possible by a world-wide funding initiative.<br />
    The Encyclopedia Now Needs Your Support<br />
    Please Read How You Can Help Keep the Encyclopedia Free</a>
  </div>
</div> <!-- End article-banner -->

    </div> <!-- End content -->

    <div id="footer">

      <div id="footer-menu">
        <div class="menu-block">
          <h4><i class="icon-book"></i> Browse</h4>
          <ul role="menu">
            <li><a href="../../contents.html">Table of Contents</a></li>
            <li><a href="../../new.html">What's New</a></li>
            <li><a href="https://plato.stanford.edu/cgi-bin/encyclopedia/random">Random Entry</a></li>
            <li><a href="../../published.html">Chronological</a></li>
            <li><a href="../../archives/index.html">Archives</a></li>
          </ul>
        </div>
        <div class="menu-block">
          <h4><i class="icon-info-sign"></i> About</h4>
          <ul role="menu">
            <li><a href="../../info.html">Editorial Information</a></li>
            <li><a href="../../about.html">About the SEP</a></li>
            <li><a href="../../board.html">Editorial Board</a></li>
            <li><a href="../../cite.html">How to Cite the SEP</a></li>
            <li><a href="../../special-characters.html">Special Characters</a></li>
            <li><a href="../../tools/index.html">Advanced Tools</a></li>
            <li><a href="../../contact.html">Contact</a></li>
          </ul>
        </div>
        <div class="menu-block">
          <h4><i class="icon-leaf"></i> Support SEP</h4>
          <ul role="menu">
            <li><a href="../../support/index.html">Support the SEP</a></li>
            <li><a href="../../support/friends.html">PDFs for SEP Friends</a></li>
            <li><a href="../../support/donate.html">Make a Donation</a></li>
            <li><a href="../../support/sepia.html">SEPIA for Libraries</a></li>
          </ul>
        </div>
      </div> <!-- End footer menu -->

      <div id="mirrors">
        <div id="mirror-info">
          <h4><i class="icon-globe"></i> Mirror Sites</h4>
          <p>View this site from another server:</p>
        </div>
        <div class="btn-group open">
          <a class="btn dropdown-toggle" data-toggle="dropdown" href="https://plato.stanford.edu/">
            <span class="flag flag-usa"></span> USA (Main Site) <span class="caret"></span>
            <span class="mirror-source">Philosophy, Stanford University</span>
          </a>
          <ul class="dropdown-menu">
            <li><a href="../../mirrors.html">Info about mirror sites</a></li>
          </ul>
        </div>
      </div> <!-- End mirrors -->
      
      <div id="site-credits">
        <p>The Stanford Encyclopedia of Philosophy is <a href="../../info.html#c">copyright &copy; 2021</a> by <a href="http://mally.stanford.edu/">The Metaphysics Research Lab</a>, Department of Philosophy, Stanford University</p>
        <p>Library of Congress Catalog Data: ISSN 1095-5054</p>
      </div> <!-- End site credits -->

    </div> <!-- End footer -->

  </div> <!-- End container -->

   <!-- NOTE: Script required for drop-down button to work (mirrors). -->
  <script>
    $('.dropdown-toggle').dropdown();
  </script>

</body>

<!-- Mirrored from seop.illc.uva.nl/entries/abu-bakr-al-razi/ by HTTrack Website Copier/3.x [XR&CO'2014], Wed, 22 Jun 2022 19:37:29 GMT -->
</html>
