<!DOCTYPE html>
<!--[if lt IE 7]> <html class="ie6 ie"> <![endif]-->
<!--[if IE 7]>    <html class="ie7 ie"> <![endif]-->
<!--[if IE 8]>    <html class="ie8 ie"> <![endif]-->
<!--[if IE 9]>    <html class="ie9 ie"> <![endif]-->
<!--[if !IE]> --> <html> <!-- <![endif]-->

<!-- Mirrored from seop.illc.uva.nl/entries/al-ghazali/ by HTTrack Website Copier/3.x [XR&CO'2014], Wed, 22 Jun 2022 19:37:28 GMT -->
<head>
<meta name="viewport" content="width=device-width, initial-scale=1.0" />
<title>
al-Ghazali (Stanford Encyclopedia of Philosophy)
</title>
<meta http-equiv="Content-Type" content="text/html; charset=utf-8" />
<meta name="robots" content="noarchive, noodp" />
<meta property="citation_title" content="al-Ghazali" />
<meta property="citation_author" content="Griffel, Frank" />
<meta property="citation_publication_date" content="2007/08/14" />
<meta name="DC.title" content="al-Ghazali" />
<meta name="DC.creator" content="Griffel, Frank" />
<meta name="DCTERMS.issued" content="2007-08-14" />
<meta name="DCTERMS.modified" content="2020-05-08" />

<!-- NOTE: Import webfonts using this link: -->
<link href="https://fonts.googleapis.com/css?family=Source+Sans+Pro:400,300,600,200&amp;subset=latin,latin-ext" rel="stylesheet" type="text/css" />

<link rel="stylesheet" type="text/css" media="screen,handheld" href="../../css/bootstrap.min.css" />
<link rel="stylesheet" type="text/css" media="screen,handheld" href="../../css/bootstrap-responsive.min.css" />
<link rel="stylesheet" type="text/css" href="../../css/font-awesome.min.css" />
<!--[if IE 7]> <link rel="stylesheet" type="text/css" href="../../css/font-awesome-ie7.min.css"> <![endif]-->
<link rel="stylesheet" type="text/css" media="screen,handheld" href="../../css/style.css" />
<link rel="stylesheet" type="text/css" media="print" href="../../css/print.css" />
<link rel="stylesheet" type="text/css" href="../../css/entry.css" />
<!--[if IE]> <link rel="stylesheet" type="text/css" href="../../css/ie.css" /> <![endif]-->
<script type="text/javascript" src="../../js/jquery-1.9.1.min.js"></script>
<script type="text/javascript" src="../../js/bootstrap.min.js"></script>

<!-- NOTE: Javascript for sticky behavior needed on article and ToC pages -->
<script type="text/javascript" src="../../js/jquery-scrolltofixed-min.js"></script>
<script type="text/javascript" src="../../js/entry.js"></script>

<!-- SEP custom script -->
<script type="text/javascript" src="../../js/sep.js"></script>
</head>

<!-- NOTE: The nojs class is removed from the page if javascript is enabled. Otherwise, it drives the display when there is no javascript. -->
<body class="nojs article" id="pagetopright">
<div id="container">
<div id="header-wrapper">
  <div id="header">
    <div id="branding">
      <div id="site-logo"><a href="../../index.html"><img src="../../symbols/sep-man-red.png" alt="SEP logo" /></a></div>
      <div id="site-title"><a href="../../index.html">Stanford Encyclopedia of Philosophy</a></div>
    </div>
    <div id="navigation">
      <div class="navbar">
        <div class="navbar-inner">
          <div class="container">
            <button class="btn btn-navbar collapsed" data-target=".collapse-main-menu" data-toggle="collapse" type="button"> <i class="icon-reorder"></i> Menu </button>
            <div class="nav-collapse collapse-main-menu in collapse">
              <ul class="nav">
                <li class="dropdown open"><a id="drop1" href="#" class="dropdown-toggle" data-toggle="dropdown" role="button"><i class="icon-book"></i> Browse</a>
                  <ul class="dropdown-menu" role="menu" aria-labelledby="drop1">
                    <li><a href="../../contents.html">Table of Contents</a></li>
                    <li><a href="../../new.html">What's New</a></li>
                    <li><a href="https://plato.stanford.edu/cgi-bin/encyclopedia/random">Random Entry</a></li>
                    <li><a href="../../published.html">Chronological</a></li>
                    <li><a href="../../archives/index.html">Archives</a></li>
                  </ul>
                </li>
                <li class="dropdown open"><a id="drop2" href="#" class="dropdown-toggle" data-toggle="dropdown" role="button"><i class="icon-info-sign"></i> About</a>
                  <ul class="dropdown-menu" role="menu" aria-labelledby="drop2">
                    <li><a href="../../info.html">Editorial Information</a></li>
                    <li><a href="../../about.html">About the SEP</a></li>
                    <li><a href="../../board.html">Editorial Board</a></li>
                    <li><a href="../../cite.html">How to Cite the SEP</a></li>
                    <li><a href="../../special-characters.html">Special Characters</a></li>
                    <li><a href="../../tools/index.html">Advanced Tools</a></li>
                    <li><a href="../../contact.html">Contact</a></li>
                  </ul>
                </li>
                <li class="dropdown open"><a id="drop3" href="#" class="dropdown-toggle" data-toggle="dropdown" role="button"><i class="icon-leaf"></i> Support SEP</a>
                  <ul class="dropdown-menu" role="menu" aria-labelledby="drop3">
                    <li><a href="../../support/index.html">Support the SEP</a></li>
                    <li><a href="../../support/friends.html">PDFs for SEP Friends</a></li>
                    <li><a href="../../support/donate.html">Make a Donation</a></li>
                    <li><a href="../../support/sepia.html">SEPIA for Libraries</a></li>
                  </ul>
                </li>
              </ul>
            </div>
          </div>
        </div>
      </div>
    </div>
    <!-- End navigation -->
    
    <div id="search">
      <form id="search-form" method="get" action="https://seop.illc.uva.nl/search/searcher.py">
        <input type="search" name="query" placeholder="Search SEP" />
        <div class="search-btn-wrapper"><button class="btn search-btn" type="submit"><i class="icon-search"></i></button></div>
      </form>
    </div>
    <!-- End search --> 
    
  </div>
  <!-- End header --> 
</div>
<!-- End header wrapper -->

<div id="content">

<!-- Begin article sidebar -->
<div id="article-sidebar" class="sticky">
  <div class="navbar">
    <div class="navbar-inner">
      <div class="container">
        <button class="btn btn-navbar" data-target=".collapse-sidebar" data-toggle="collapse" type="button"> <i class="icon-reorder"></i> Entry Navigation </button>
        <div id="article-nav" class="nav-collapse collapse-sidebar in collapse">
          <ul class="nav">
            <li><a href="#toc">Entry Contents</a></li>
            <li><a href="#Bib">Bibliography</a></li>
            <li><a href="#Aca">Academic Tools</a></li>
            <li><a href="https://leibniz.stanford.edu/friends/preview/al-ghazali/">Friends PDF Preview <i class="icon-external-link"></i></a></li>
            <li><a href="https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=al-ghazali">Author and Citation Info <i class="icon-external-link"></i></a> </li>
            <li><a href="#pagetopright" class="back-to-top">Back to Top <i class="icon-angle-up icon2x"></i></a></li>
          </ul>
        </div>
      </div>
    </div>
  </div>
</div>
<!-- End article sidebar --> 

<!-- NOTE: Article content must have two wrapper divs: id="article" and id="article-content" -->
<div id="article">
<div id="article-content">

<!-- BEGIN ARTICLE HTML -->


<div id="aueditable"><!--DO NOT MODIFY THIS LINE AND ABOVE-->

<h1>al-Ghazali</h1><div id="pubinfo"><em>First published Tue Aug 14, 2007; substantive revision Fri May 8, 2020</em></div>

<div id="preamble">

<p>
Al-Ghaz&acirc;l&icirc; (<em>c</em>.1056&ndash;1111) was one of the
most prominent and influential philosophers, theologians, jurists, and
mystics of Sunni Islam. He was active at a time when Sunni theology
had just passed through its consolidation and entered a period of
intense challenges from Shiite Ism&acirc;&rsquo;&icirc;lite theology
and the Arabic tradition of Aristotelian philosophy
(<em>falsafa</em>). Al-Ghaz&acirc;l&icirc; understood the importance
of <em>falsafa</em> and developed a complex response that rejected and
condemned some of its teachings, while it also allowed him to accept
and apply others. Al-Ghaz&acirc;l&icirc;&rsquo;s critique of twenty
positions of <em>falsafa</em> in his <em>Incoherence of the
Philosophers</em> (<em>Tah&acirc;fut al-fal&acirc;sifa</em>) is a
significant landmark in the history of philosophy as it advances the
nominalist critique of Aristotelian science developed later in 14th
century Europe. On the Arabic and Muslim side
al-Ghaz&acirc;l&icirc;&rsquo;s acceptance of demonstration
(<em>apodeixis</em>) led to a much more refined and precise discourse
on epistemology and a flowering of Aristotelian logics and
metaphysics. With al-Ghaz&acirc;l&icirc; begins the successful
introduction of Aristotelianism or rather Avicennism into Muslim
theology. After a period of appropriation of the Greek sciences in the
translation movement from Greek into Arabic and the writings of the
<em>fal&acirc;sifa</em> up to Avicenna (Ibn S&icirc;n&acirc;,
<em>c</em>.980&ndash;1037), philosophy and the Greek sciences were
&ldquo;naturalized&rdquo; into the discourse of <em>kal&acirc;m</em>
and Muslim theology (Sabra 1987). Al-Ghaz&acirc;l&icirc;&rsquo;s
approach to resolving apparent contradictions between reason and
revelation was accepted by almost all later Muslim theologians and
had, via the works of Averroes (Ibn Rushd, 1126&ndash;98) and Jewish
authors, a significant influence on Latin medieval thinking.</p>
</div>

<div id="toc">
<!--Entry Contents-->

<ul>

 <li><a href="#Lif">1. Life</a></li>
 
 <li><a href="#AlGhaRepFalTea">2. Al-Ghaz&acirc;l&icirc;&rsquo;s Reports of the <em>fal&acirc;sifa</em>&rsquo;s Teachings</a></li>
 
 <li><a href="#AlGhaRefFalIsm">3. Al-Ghaz&acirc;l&icirc;&rsquo;s &ldquo;Refutations&rdquo; of <em>falsafa</em> and Ism&acirc;&rsquo;&icirc;lism</a></li>
 
 <li><a href="#PlaFalIsl">4. The Place of <em>Falsafa</em> in Islam</a></li>
 
 <li><a href="#EthRevRelSci">5. The Ethics of the <em>Revival of the Religious Sciences</em></a></li>
 
 <li><a href="#CosRevRelSci">6. Cosmology in the <em>Revival of the Religious Sciences</em></a></li>
 
 <li><a href="#CauAlGha">7. Causality in al-Ghaz&acirc;l&icirc;</a>
 
<ul>

 <li><a href="#OccVerSecCau">7.1 Occasionalism versus Secondary Causality</a></li>
 
 <li><a href="#17tDisInc">7.2 The 17th Discussion of the <em>Incoherence</em></a></li>
 
 <li><a href="#TwoDifConMod">7.3 Two Different Concepts of the Modalities</a></li>
 
 <li><a href="#CumPosOccSecCau">7.4 The Cum-Possibility of Occasionalism and Secondary Causality</a></li>
 </ul></li>

 <li><a href="#Bib">Bibliography</a>
 
<ul>

 <li><a href="#PriTex">Primary Texts</a></li>
 
 <li><a href="#SecLit">Secondary Literature</a></li>
 </ul></li>

 <li><a href="#Aca">Academic Tools</a></li>
 
 <li><a href="#Oth">Other Internet Resources</a></li>
 
 <li><a href="#Rel">Related Entries</a></li>
 </ul>
<!--Entry Contents-->

<hr />
</div>

<div id="main-text">

<h2><a name="Lif">1. Life</a></h2>

<p>
Later Muslim medieval historians say that Ab&ucirc; H&acirc;mid
Muhammad ibn Muhammad al-Ghaz&acirc;l&icirc; was born in 1058 or 1059
in Tabar&acirc;n-T&ucirc;s (15 miles north of modern Meshed, NE Iran),
yet notes about his age in his letters and his autobiography indicate
that he was born in 1055 or 1056 (Griffel 2009, 23&ndash;25).
Al-Ghaz&acirc;l&icirc; received his early education in his hometown of
Tus together with his brother Ahmad (<em>c.</em>1060&ndash;1123 or
1126) who became a famous preacher and Sufi scholar. Muhammad went on
to study with the influential Ash&rsquo;arite theologian
al-Juwayn&icirc; (1028&ndash;85) at the Niz&acirc;miyya Madrasa in
nearby Nishapur. This brought him in close contact with the court of
the Grand-Seljuq Sultan Maliksh&acirc;h (reg. 1071&ndash;92) and his
grand-vizier Niz&acirc;m al-Mulk (1018&ndash;92). In 1091 Niz&acirc;m
al-Mulk appointed al-Ghaz&acirc;l&icirc; to the prestigious
Niz&acirc;miyya Madrasa in Baghdad. In addition to being a confidante
of the Seljuq Sultan and his court in Isfahan, he now became closely
connected to the caliphal court in Baghdad. He was undoubtedly the
most influential intellectual of his time, when in 1095 he suddenly
gave up his posts in Baghdad and left the city. Under the influence of
Sufi literature al-Ghaz&acirc;l&icirc; had begun to change his
lifestyle two years before his departure (Griffel 2009, 67). He
realized that the high ethical standards of a virtuous religious life
are not compatible with being in the service of sultans, viziers, and
caliphs. Benefiting from the riches of the military and political
elite implies complicity in their corrupt and oppressive rule and will
jeopardize one&rsquo;s prospect of redemption in the afterlife. When
al-Ghaz&acirc;l&icirc; left Baghdad in 1095 he went to Damascus and
Jerusalem and vowed at the tomb of Abraham in Hebron never again to
serve the political authorities or teach at state-sponsored schools.
He continued to teach, however, at small schools (singl.
<em>z&acirc;wiya</em>) that were financed by private donations. After
performing the pilgrimage in 1096, al-Ghaz&acirc;l&icirc; returned via
Damascus and Baghdad to his hometown T&ucirc;s, where he founded a
small private school and a Sufi convent
(<em>kh&acirc;nq&acirc;h</em>). In 1106, at the beginning of the 6th
century in the Muslim calendar, al-Ghaz&acirc;l&icirc; broke his vow
and returned to teaching at the state-sponsored Niz&acirc;miyya
Madrasa in Nishapur, where he himself had been a student. To his
followers he justified this step with the great amount of theological
confusion among the general public and pressure from authorities at
the Seljuq court (al-Ghaz&acirc;l&icirc; 1959a, 45&ndash;50 = 2000b,
87&ndash;93). Al-Ghaz&acirc;l&icirc; regarded himself as one of the
renewers (singl. <em>muhy&icirc;</em>) of religion, who, according to
a <em>had&icirc;th</em>, will come every new century. In Nishapur,
al-Ghaz&acirc;l&icirc;&rsquo;s teaching activity at the
Niz&acirc;miyya madrasa led to a controversy that was triggered by
opposition to his teachings, particularly those in his most widely
read work, <em>The Revival of the Religious Sciences</em>, and by
accusations that these show a distinct influence from
<em>falsafa</em>. Al-Ghaz&acirc;l&icirc; was summoned to defend
himself in front of the Seljuq governor Sanjar (d. 1157). The latter,
however, acquitted him from all charges and supported his teaching
activity in Nishapur (Garden 2014: 143&ndash;168). On this occasion,
al-Ghaz&acirc;l&icirc; again asked to be released from his obligations
at the Niz&acirc;miyya madrasa, a request that was denied. All this
time, he continued to teach at his <em>z&acirc;wiya</em> in T&ucirc;s
where he died in December 1111 (Griffel 2009, 20&ndash;59).</p>

<h2><a name="AlGhaRepFalTea">2. Al-Ghaz&acirc;l&icirc;&rsquo;s Reports of the <em>fal&acirc;sifa</em>&rsquo;s Teachings</a></h2>

<p>
After having already made a name for himself as a competent author of
legal works, al-Ghaz&acirc;l&icirc; published around 1095 a number of
books where he addresses the challenges posed by <em>falsafa</em> and
by the theology of the Ism&acirc;&rsquo;&icirc;lite Shiites. The
movement of <em>falsafa</em> (from Greek: <em>philosoph&iacute;a</em>)
resulted from the translation of Greek philosophical and scientific
literature into Arabic from the 8th to the early 10th centuries. The
Arabic philosophers (<em>fal&acirc;sifa</em>) were heirs to the
late-antique tradition of understanding the works of Aristotle in
Neoplatonic terms. In philosophy the translators from Greek into
Arabic focused on the works of Aristotle and although some distinctly
Neoplatonic texts were translated into Arabic&mdash;most notably the
pseudo-Aristotelian <em>Theology</em>, a compilation from
Plotinus&rsquo; <em>Enneads</em>&mdash;the most significant
Neoplatonic contributions reached the Arabs by way of commentaries on
the works of the Stagirite (Wisnovsky 2003, 15). <em>Falsafa</em> was
a movement where Christians, Muslims, and even pagan authors
participated. After the 12th century it would also include Jewish
authors. For reasons that will become apparent, al-Ghaz&acirc;l&icirc;
focused his comments on the Muslim <em>fal&acirc;sifa</em>. In the
early 10th century al-F&acirc;r&acirc;b&icirc; (d. 950) had developed
a systemic philosophy that challenged key convictions held by Muslim
theologians, most notably the creation of the world in time and the
original character of the information God reveals to prophets.
Following Aristotle, al-F&acirc;r&acirc;b&icirc; taught that the world
has no beginning in the past and that the celestial spheres, for
instance, move from pre-eternity. Prophets and the revealed religions
they bring articulate the same insights that philosophers express in
their teachings, yet the prophets use the method of symbolization to
make this wisdom more approachable for the ordinary people. Avicenna
continued al-F&acirc;r&acirc;b&icirc;&rsquo;s approach and developed
his metaphysics and his prophetology to a point where it offers
comprehensive explanations of God&rsquo;s essence and His actions as
well as a psychology that gives a detailed account of how prophets
receive their knowledge and how they, for instance, perform miracles
that confirm their missions. Avicenna&rsquo;s philosophy offers
philosophical explanations of key Muslim tenets like God&rsquo;s unity
(<em>tawh&icirc;d</em>) and the central position of prophets among
humans.</p>

<p>
In his autobiography al-Ghaz&acirc;l&icirc; writes that during his
time at the Baghdad Niz&acirc;miyya he studied the works of the
<em>fal&acirc;sifa</em> for two years before he wrote his
<em>Incoherence of the Philosophers</em> in a third year
(Ghaz&acirc;l&icirc; 1959a, 18 = 2000b, 61). It is hardly credible,
however, that al-Ghaz&acirc;l&icirc; began to occupy himself with
<em>falsafa</em> only after he became professor at the Niz&acirc;miyya
in Baghdad. This account is apologetic and aims to reject the claim of
some of his critics that he had learned <em>falsafa</em> before his
own religious education was complete. Most probably he had become
acquainted with <em>falsafa</em> while studying with al-Juwayn&icirc;,
whose works already show an influence from Avicenna.
Al-Ghaz&acirc;l&icirc;&rsquo;s response to Aristotelianism, the
<em>Incoherence of the Philosophers</em>, is a masterwork of
philosophical literature and may have been decades in the making. It
is accompanied by works where al-Ghaz&acirc;l&icirc; provides faithful
reports of the philosophers&rsquo; teachings. Two of those works have
come down to us. The first is an almost complete fragment of a long
book where al-Ghaz&acirc;l&icirc; copies or paraphrases passages from
the works of philosophers and combines them to a comprehensive report
about their teachings in metaphysics (Griffel 2006, al-Akiti 2009).
The fragment unfortunately bears no title. The second work, the
<em>Doctrines of the Philosophers</em> (<em>Maq&acirc;sid
al-fal&acirc;sifa</em>, on the translation of the title see Shihadeh
2011, 90&ndash;92), is a loosely adapted Arabic translation of the
parts on logics, metaphysics, and the natural sciences in
Avicenna&rsquo;s Persian work <em>Philosophy for
&lsquo;Al&acirc;&rsquo; al-Dawla</em> (<em>D&acirc;nishnamah-yi
Al&acirc;&rsquo;&icirc;</em>) (Janssens 1986). Previously it has been
assumed that the <em>Doctrines of the Philosophers</em> was written as
a preparatory study to his major work, the <em>Incoherence.</em> This
can no longer be upheld. Both reports of al-Ghaz&acirc;l&icirc; stand
only in a very loose connection to the text of the <em>Incoherence of
the Philosophers</em>. The <em>Incoherence</em> and the
<em>Doctrines</em> use different terminologies and the latter presents
its material in ways that does not support the criticism in the
<em>Incoherence</em> (Janssens 2003, 43&ndash;45). The <em>Doctrines
of the Philosophers</em> may have been a text that was initially
unconnected to the <em>Incoherence</em> or that was generated after
the composition of the latter. Only its introduction and its brief
<em>explicit</em> create a connection to the refutation in the
<em>Incoherence</em>. These parts were almost certainly written (or
added) after the publication of the <em>Incoherence</em> (Janssens
2003, 45; Griffel 2006, 9&ndash;10).</p>

<p>
<em>The Doctrines of the Philosophers</em> was translated into Latin
in the third quarter of the 12th century and into Hebrew first in 1292
and at least another two times within the next fifty years. These
translations enjoyed much more success than the Arabic original.
Whereas in Arabic, numerous books that follow a similar goal of
presenting (and soon also improving) Avicenna&rsquo;s philosophical
system were composed during the 12th and 13th centuries, none of them
were translated into Latin and very few became available in Hebrew. In
the Latin as well as in the Hebrew traditions, translations of <em>The
Doctrines of the Philosophers</em> overshadowed all of
al-Ghaz&acirc;l&icirc;&rsquo;s other writings. The Latin translation,
sometimes referred to as <em>Summa theoricae philosophiae</em> or as
<em>Logica et philosophia Algazelis</em>, was the only book by
al-Ghaz&acirc;l&icirc; translated during the period of the
transmission of Arabic philosophy to Christian Europe (the part on
logic is edited in Lohr 1965, the two remaining parts on metaphysics
and the natural sciences in al-Ghaz&acirc;l&icirc; 1933). It was
translated by Dominicus Gundisalivi (Gundissalinus, d. <em>c.</em>
1190) of Toledo in collaboration with someone referred to as
&ldquo;Magister Iohannes&rdquo; (d. 1215), also known as Iohannes
Hispanus (or Hispalensis), probably an Arabized Christian (a Mozarab),
who was dean at the cathedral of Toledo in the 1180s and 1190s
(Burnett 1994). The two translators seem to have omitted the short
introduction and the <em>explicit</em> where the work is described as
an uncommitted report of the <em>fal&acirc;sifa</em>&rsquo;s
teachings. A small number of Latin manuscripts show signs that this
translation was revised during the 13th century (Lohr 1965, 229) and
in one case they preserve a Latin rendition of
al-Ghaz&acirc;l&icirc;&rsquo;s original introduction (edited in Salman
1935, 125&ndash;27). That, however, had next to no influence on the
text&rsquo;s reception (Salman 1935), and the version that circulated
among readers of Latin does not include al-Ghaz&acirc;l&icirc;&rsquo;s
distancing statements (al-Ghaz&acirc;l&icirc; 1506). The book thus
concealed its character as a report of Avicenna&rsquo;s teachings and
its author &ldquo;Algazel&rdquo; was considered a faithful follower of
Avicenna who had produced a masterful compendium of the latter&rsquo;s
philosophy. During the late 12th, the 13th, and the 14th centuries the
<em>Summa theoricae philosophiae</em> was a principal source on the
teachings of the Arabic philosophers in books by authors like Albert
the Great (d. 1280) and Thomas Aquinas (d. 1274) that were essential
to the development of the Latin philosophical tradition. The work was
still used sporadically in the 15h century and even more often in the
16th century (Minnema 2014; Alonso 1958; d&rsquo;Alverny 1986).
Al-Ghaz&acirc;l&icirc;&rsquo;s identification as one of them is
usually attributed to the limited knowledge of Latin scholars about
matters relating to the authors of the texts they read. The
assumption, however, that the <em>Doctrines of the Philosophers</em>
is not merely a report of the teachings of the <em>fal&acirc;sifa</em>
but rather represents al-Ghaz&acirc;l&icirc;&rsquo;s genuine positions
in philosophy is not limited to the Latin tradition. There are Arabic
manuscripts that attribute a text that is quite similar to the
<em>Doctrines of the Philosophers</em> to al-Ghaz&acirc;l&icirc;
without mentioning that the teachings therein are an uncommitted
report. The oldest of these manuscripts was produced at the beginning
of the 13th century at Maraghah, an important center of scholarship in
NW Iran and is available in facsimile (Pourjavady 2002, 2&ndash;62).
It shows that also in the Arabic tradition, the positions reported in
the <em>Doctrines of the Philosophy</em> were closely associated with
al-Ghaz&acirc;l&icirc;. The &ldquo;mis-identification&rdquo; of
al-Ghaz&acirc;l&icirc; as a follower of Avicenna may have its roots in
an attitude among some Arabic readers of al-Ghaz&acirc;l&icirc; who
saw in him a closer follower of the <em>fal&acirc;sifa</em> than the
mainstream Arabic tradition wished to acknowledge.</p>

<p>
In its several Hebrew versions, al-Ghaz&acirc;l&icirc;&rsquo;s
<em>Doctrines of the Philosophers</em> (known as <em>De&rsquo;&ocirc;t
ha-f&icirc;l&ocirc;s&ocirc;f&icirc;m</em> and <em>Kavvan&ocirc;t
ha-f&icirc;l&ocirc;s&ocirc;f&icirc;m</em>) was one of the most
widespread philosophical texts studied among Jews in Europe
(Steinschneider 1893, 1:296&ndash;326; Harvey 2001). The translator of
the first Hebrew version of 1292, the Jewish Averroist Isaac Albalag,
attached his own introduction and extensive notes to the text (Vajda
1960). This and the other two Hebrew translations attracted a great
number of commentators, including Moses Narboni (d. 1362), who was
active in southern France and Spain, and Moses Almosnino (d.
<em>c.</em>1580) of Thessalonica (Steinschneider 1893,
1:311&ndash;25). Al-Ghaz&acirc;l&icirc;&rsquo;s <em>Doctrines of the
Philosophers</em> was a very popular text up to the 16th century and
over 75 manuscripts of the Hebrew translations are extant (Eran 2007,
Harvey 2015: 289). Some Jewish scholars, like the 14th century Katalan
Hasdai Crescas, saw in this Avicennan text a welcome alternative to
the equally widespread teachings of Averroes (Harvey and Harvey 2002;
Harvey 2015: 300&ndash;302). In fact, by the 15th century the Hebrew
version of al-Ghaz&acirc;l&icirc;&rsquo;s <em>Doctrines of the
Philosophers</em> may have replaced Averroes as the most popular
source among Jews for the study of the Aristotelian natural sciences
(Harvey 2015: 289). Although the Hebrew translations make the
character of the work as a report clear, al-Ghaz&acirc;l&icirc;
was&mdash;as in the Latin tradition&mdash;regarded as a much closer
follower of <em>falsafa</em> than in the mainstream Arabic tradition.
The Hebrew tradition, for instance, makes widely available the
translation of a text ascribed to al-Ghaz&acirc;l&icirc; where the
author responds to questions about astronomy and cosmology that are
quite far from Ash&rsquo;arism and much closer to Aristotelianism
(Langermann 2011). This relatively widespread Hebrew text (edited and
translated in al-Ghaz&acirc;l&icirc; 1896), referred to as
<em>Teshuv&ocirc;t she&rsquo;al&ocirc;t</em>, &ldquo;Answers to
Questions,&rdquo; or more recently as the &ldquo;Hebrew
<em>Ajwiba</em>,&rdquo; exists in eleven Hebrew manuscripts (Harvey
2015: 298). Its Arabic original is known only from a very small number
of manuscripts, among them the one from Maraghah (Pourjavady 2002,
63&ndash;99). Accounts saying that al-Ghaz&acirc;l&icirc; taught
philosophical positions he had openly condemned in his
<em>Incoherence</em> were relatively widespread in Hebrew literature
(Marx 1935, 410, 422&ndash;24). Moses Narboni, for instance, believed
that al-Ghaz&acirc;l&icirc; used a stratagem to teach philosophy at a
time when it was, according to Narboni, officially prohibited. By
pretending to refute philosophy in his <em>Incoherence</em> he could
justify the writing of the <em>Doctrines</em>. The <em>Doctrines</em>
is therefore the main work on philosophy by al-Ghaz&acirc;l&icirc;,
Narboni suspected, while the <em>Incoherence</em> serves only the
function of legitimizing the former&rsquo;s publication by saying that
a refutation must rely on a thorough knowledge of what is to be
refuted (Chertoff 1952, part 2, 6&ndash;7). This tendency among Hebrew
authors to disentangle al-Ghaz&acirc;l&icirc; from the criticism of
philosophy expressed in his <em>Incoherence</em> led the Algerian
Jewish scholar Abraham Gavison (fl. 16th cent.) to report erroneously
that al-Ghaz&acirc;l&icirc; was the author of both <em>The</em>
<em>Incoherence of the Philosophers</em> as well as its repudiation
<em>The Incoherence of the Incoherence</em> (<em>Tah&acirc;fut
al-tah&acirc;fut</em>), a work in reality written by Averroes (Gavison
1748, fol. 135a). In addition to his <em>Doctrines</em>, his
<em>Incoherence</em>, which was translated in 1411, and the text known
as <em>Teshuv&ocirc;t she&rsquo;al&ocirc;t</em> (whose ascription to
al-Ghaz&acirc;l&icirc; is doubtful), at least two other works by
al-Ghaz&acirc;l&icirc; were translated into Hebrew: <em>Mishk&acirc;t
al-anw&acirc;r</em> and <em>M&icirc;z&acirc;n al-&rsquo;amal</em>
(Steinschneider 1893, 1:326&ndash;48, the text <em>Moznei
ha-&rsquo;iyyun&icirc;m</em> mentioned there is not by
al-Ghaz&acirc;l&icirc;). </p>

<h2><a name="AlGhaRefFalIsm">3. Al-Ghaz&acirc;l&icirc;&rsquo;s &ldquo;Refutations&rdquo; of <em>falsafa</em> and Ism&acirc;&rsquo;&icirc;lism</a></h2>

<p>
Al-Ghaz&acirc;l&icirc; describes the <em>Incoherence of the
Philosophers</em> as a &ldquo;refutation&rdquo; (<em>radd</em>) of the
philosophical movement (Ghaz&acirc;l&icirc; 1959a, 18 = 2000b, 61),
and this has contributed to the erroneous assumption that he opposed
Aristotelianism and rejected its teachings. His response to
<em>falsafa</em> was far more complex and allowed him to adopt many of
its teachings. The <em>fal&acirc;sifa</em> are convinced,
al-Ghaz&acirc;l&icirc; complains at the beginning of the
<em>Incoherence</em>, that their way of knowing by
&ldquo;demonstrative proof&rdquo; (<em>burh&acirc;n</em>) is superior
to theological knowledge drawn from revelation and its rational
interpretation. This conviction led &ldquo;a group&rdquo; among the
Muslim <em>fal&acirc;sifa</em> who disregard Islam and who neglect its
ritual duties and its religious law (<em>shar&icirc;&rsquo;a</em>). In
his <em>Incoherence</em> al-Ghaz&acirc;l&icirc; discusses twenty key
teachings of the <em>fal&acirc;sifa</em> and rejects the claim that
these teachings are demonstratively proven. In a detailed and
intricate philosophical discussion al-Ghaz&acirc;l&icirc; aims to show
that none of the arguments in favor of these twenty teachings fulfills
the high epistemological standard of demonstration
(<em>burh&acirc;n</em>) that the <em>fal&acirc;sifa</em> have set for
themselves. Rather, the arguments supporting these twenty convictions
rely upon unproven premises that are accepted only among the
<em>fal&acirc;sifa</em>, but are not established by reason. By showing
that these positions are supported by mere dialectical arguments
al-Ghaz&acirc;l&icirc; aims to demolish what he regarded was an
epistemological hubris on the side of the <em>fal&acirc;sifa</em>. In
the <em>Incoherence</em> he wishes to show that the
<em>fal&acirc;sifa</em> practice <em>taql&icirc;d</em>, meaning they
merely repeat these teachings from the founders of their movement
without critically examining them (Griffel 2005).</p>

<p>
The initial argument of the <em>Incoherence</em> focuses on
<em>apodeixis</em> and the demonstrative character of the arguments
refuted therein. While the book also touches on the truth of these
teachings, it &ldquo;refutes&rdquo; numerous positions whose truths
al-Ghaz&acirc;l&icirc; acknowledges or which he subscribed to in his
later works. In these cases al-Ghaz&acirc;l&icirc; wishes to show that
while these particular philosophical teachings are sound and true,
they are not demonstrated. The ultimate source of the
<em>fal&acirc;sifa</em>&rsquo;s knowledge about God&rsquo;s nature,
the human soul, or about the heavenly spheres, for instance, are the
revelations given to early prophets such as Abraham and Moses. Their
information made it into the books of the ancient philosophers who
falsely claimed that they gained these insights by reason alone.</p>

<p>
Among the twenty discussions of the <em>Incoherence</em>, sixteen are
concerned with positions held in the <em>fal&acirc;sifa</em>&rsquo;s
metaphysics (<em>il&acirc;hiyy&acirc;t</em>) and four with positions
that appear in their natural sciences
(<em>tab&icirc;&rsquo;iyy&acirc;t</em>). The 17th discussion on
causality will be analyzed below. The longest and most substantial
discussion is the first, which deals with Avicenna&rsquo;s and
al-F&acirc;r&acirc;b&icirc;&rsquo;s arguments in favor of the
world&rsquo;s pre-eternity (Hourani 1958, Marmura 1959).
Al-Ghaz&acirc;l&icirc; denies that this position can be
demonstratively proven and draws from arguments that were earlier
developed by anti-Aristotelian critics such as the Christian John
Philoponus (Yahy&acirc; l-Nahw&icirc;,
<em>c.</em>490&ndash;<em>c.</em>570) of Alexandria. Philoponus&rsquo;
arguments, most importantly those that deny the possibility of an
infinite number of events in the past, had entered the Arabic
discourse on the world&rsquo;s creation earlier during the 9th century
(Davidson 1987, 55&ndash;56, 86&ndash;116, 366&ndash;75).</p>

<p>
At the end of the <em>Incoherence</em> al-Ghaz&acirc;l&icirc; asks
whether the twenty positions discussed in the book are in conflict
with the religious law (<em>shar&icirc;&rsquo;a</em>). Most of them
are wrong, he says, yet pose no serious problems in terms of religion,
where they should be considered &ldquo;innovations&rdquo; (singl.
<em>bid&rsquo;a</em>). A small group of positions is considered wrong
as well as religiously problematic. These are three teachings from
Avicenna&rsquo;s philosophy, namely (1) that the world has no
beginning in the past and is not created in time, (2) that God&rsquo;s
knowledge includes only classes of beings (universals) and does not
extend to individual beings and their circumstances (particulars), and
(3) that after death the souls of humans will never again return into
bodies. In these three cases the teachings of Islam, which are based
on revelation, suggest the opposite, al-Ghaz&acirc;l&icirc; says, and
thus overrule the unfounded claims of the <em>fal&acirc;sifa</em>.
What&rsquo;s more, these three teachings may mislead the public to
disregarding the religious law (<em>shar&icirc;&rsquo;a</em>) and are,
therefore, dangerous for society (Griffel 2000, 301&ndash;3). In his
function as a Muslim jurisprudent al-Ghaz&acirc;l&icirc; adds a brief
<em>fatw&acirc;</em> at the end of his <em>Incoherence</em> and
declares that everybody who teaches these three positions publicly is
an unbeliever (<em>k&acirc;fir</em>) and an apostate from Islam, who
can be killed (al-Ghaz&acirc;l&icirc; 2000a, 226).</p>

<p>
Al-Ghaz&acirc;l&icirc;&rsquo;s efforts in dealing with the
philosophical movement amount to defining the boundaries of religious
tolerance in Islam. Soon after the <em>Incoherence</em>, he wrote a
similar book about the movement of the Ism&acirc;&rsquo;&icirc;lite
Shiites, known as the &ldquo;B&acirc;tinites&rdquo; (&ldquo;those who
arbitrarily follow an inner meaning in the Qur&rsquo;an&rdquo;).
Initially the Ism&acirc;&rsquo;&icirc;lite Shiites were supporters of
the F&acirc;timid counter-caliphate in Cairo and opposed the political
and religious authority of the Sunni caliph in Baghdad and the Seljuq
Sultans that he installed. During al-Ghaz&acirc;l&icirc;&rsquo;s
lifetime, however, there occurred a schism within the clandestine
Ism&acirc;&rsquo;&icirc;lite movement. The &ldquo;new
propaganda&rdquo; of the Ism&acirc;&rsquo;&icirc;lites in Iraq and
Iran was now independent from the center in Cairo and developed its
own strategies. A key element of their&mdash;not entirely
unsuccessful&mdash;efforts to persuade people to their camp was their
criticism of sense perception and of rational arguments
(al-Ghaz&acirc;l&icirc; 1954, 34; 1964b, 76, 80).
Al-Ghaz&acirc;l&icirc; was closely familiar with the
Ism&acirc;&rsquo;&icirc;lites&rsquo; propaganda efforts but did not
always have reliable information on their teachings on cosmology and
metaphysics. These were deeply influenced by cosmological notions in
late antique Gnostic and Neoplatonic literature (Walker 1993, de Smet
1995). What information he got, al-Ghz&acirc;l&icirc; seems to have
received from the Persian writings of the Ism&acirc;&rsquo;&icirc;lite
propagandist and philosopher N&acirc;sir-i Khosrow (d. <em>c.</em>
1075), who lived a generation earlier in Balkh in Khorasan and in the
remote region of the Pamir Mountains (Andani 2017).
Al-Ghaz&acirc;l&icirc;, however, did not know about the schism within
the movement. In his book on the <em>Scandals of the Esoterics</em>
(<em>Fad&acirc;&rsquo;ih al-B&acirc;tiniyya</em>) he looks closely at
those teachings that he knew and discusses which of them are merely
erroneous and which are unbelief. He assumes&mdash;wrongly&mdash;that
the Ism&acirc;&rsquo;&icirc;lite propagandists teach the existence of
two gods. Yet this presentation is not so much a misunderstanding on
the side of al-Ghaz&acirc;l&icirc; but rather a deliberate
misrepresentation, based on a long discourse of
anti-Ism&acirc;&rsquo;&icirc;lite polemics (Andani 2017: 193). This
assumed dualism and the Ism&acirc;&rsquo;&icirc;lites&rsquo; denial of
bodily resurrection in the afterlife leads to their condemnation by
al-Ghaz&acirc;l&icirc; as unbelievers and apostates from Islam
(al-Ghaz&acirc;l&icirc; 1964b, 151&ndash;55 = 2000b,
228&ndash;29).</p>

<h2><a name="PlaFalIsl">4. The Place of <em>falsafa</em> in Islam</a></h2>

<p>
In his attempt to define the boundaries of Islam
al-Ghaz&acirc;l&icirc; singles out a limited number of teachings that
in his opinion overstep the borders. In a separate book, <em>The</em>
<em>Decisive Criterion for Distinguishing Islam from Clandestine
Unbelief</em> (<em>Faysal al-tafriqa bayna l-Isl&acirc;m
wa-l-zandaqa</em>) he clarifies that only teachings that violate
certain &ldquo;fundamental doctrines&rdquo; (<em>us&ucirc;l
al-&lsquo;aq&acirc;&rsquo;id</em>) should be deemed unbelief and
apostasy. These doctrines are limited to three: monotheism,
Muhammad&rsquo;s prophecy, and the Qur&rsquo;anic descriptions of life
after death (al-Ghaz&acirc;l&icirc; 1961, 195 = 2002, 112). He
stresses that all other teachings, including those that are erroneous
or even regarded as &ldquo;religious innovations&rdquo; (singl.
<em>bid&rsquo;a</em>), should be tolerated. Again other teachings may
be correct, al-Ghaz&acirc;l&icirc; adds, and despite their
philosophical background, for instance, should be accepted by the
Muslim community. Each teaching must be judged by itself, and if found
sound and in accordance with revelation, should be adopted
(al-Ghaz&acirc;l&icirc; 1959a, 25&ndash;27 = 2000b, 67&ndash;70). This
attitude leads to a widespread application of Aristotelian teachings
in al-Ghaz&acirc;l&icirc;&rsquo;s works on Muslim theology and
ethics.</p>

<p>
Al-Ghaz&acirc;l&icirc;&rsquo;s refutations of the
<em>fal&acirc;sifa</em> and the Ism&acirc;&rsquo;&icirc;lites have a
distinctly political component. In both cases he fears that the
followers of these movements as well as people with only a cursory
understanding of them might believe that they can disregard the
religious law (<em>shar&icirc;&rsquo;a</em>). In the case of the
Ism&acirc;&rsquo;&icirc;lites there was an additional theological
motive. In their religious propaganda the
Ism&acirc;&rsquo;&icirc;lites openly challenged the authority of Sunni
theology, claiming its religious speculation and its interpretation of
scripture is arbitrary. The Sunni theologians submit God&rsquo;s word
to judgments that appear to be reasonable, the
Ism&acirc;&rsquo;&icirc;lites said, yet they are purely capricious, a
fact evident from the many disputes among Sunni theologians. No
rational argument is more convincing than any of its opposing rational
arguments, the Ism&acirc;&rsquo;&icirc;lites claimed, since all
rational proofs are mutually equivalent (<em>tak&acirc;fu&rsquo;
al-adilla</em>). Only the divinely guided word of the Shiite Imam
conveys certainty (al-Ghaz&acirc;l&icirc; 1964b, 76, 80 = 2000b, 189,
191). In response to this criticism al-Ghaz&acirc;l&icirc; introduces
the Aristotelian notion of demonstration (<em>burh&acirc;n</em>).
Sunni theologians argue among each other, he says, because they are
largely unfamiliar with the technique of demonstration. For
al-Ghaz&acirc;l&icirc;, reason (<em>&lsquo;aql</em>) is executed most
purely and precisely by formulating arguments that are demonstrative
and reach a level where their conclusions are beyond doubt.
Al-Ghaz&acirc;l&icirc; wrote in one of his letters to a student that
later circulated as an independent epistle: &ldquo;A [valid] rational
demonstration is never wrong&rdquo; (Griffel 2015: 110&ndash;112).
This also implies that the results of true demonstrations cannot
conflict with revelation since neither reason nor revelation can be
considered false. If demonstration proves something that violates the
literal meaning of revelation, the scholar must apply interpretation
(<em>ta&rsquo;w&icirc;l</em>) to the outward text and read it as a
symbol of a deeper truth. There are, for instance, valid demonstrative
arguments proving that God cannot have a &ldquo;hand&rdquo; or sit on
a &ldquo;throne.&rdquo; These prompt the Muslim scholar to interpret
the Qur&rsquo;anic passages where these words appear as symbols
(al-Ghaz&acirc;l&icirc; 1961, 175&ndash;89 = 2002, 96&ndash;103). The
interpretation of passages in revelation, however, whose outward
meaning is not disproved by a valid demonstration, is not allowed
(Griffel 2000, 332&ndash;35; 2009, 111&ndash;16).</p>

<p>
Al-Ghaz&acirc;l&icirc;&rsquo;s rule for reconciling apparent conflicts
between reason and the literal meaning of revelation was widely
accepted by almost all later Muslim theologians, particularly those
with rationalist tendencies. Ibn Taymiyya (1263&ndash;1328), however,
criticized al-Ghaz&acirc;l&icirc;&rsquo;s rule from an scriptualist
angle. Ibn Taymiyya (1980, 1:86&ndash;87) rejected
al-Ghaz&acirc;l&icirc;&rsquo;s implication that in cases of conflict
between reason and the revealed text, priority should be given to the
former over the latter. He also remarked that
al-Ghaz&acirc;l&icirc;&rsquo;s own arguments denying the possibility
that God sits on a &ldquo;throne&rdquo; (Qur&rsquo;an 2.255), for
instance, fail to be demonstrative. Ibn Taymiyya flatly denied the
possibility of a conflict between reason and revelation and maintained
that the perception of such a disagreement results from subjecting
revelation to premises that revelation itself does not accept (Heer
1993, 188&ndash;92).</p>

<p>
On the <em>fal&acirc;sifa</em>&rsquo;s side Averroes accepted
al-Ghaz&acirc;l&icirc;&rsquo;s rule for reconciling conflicts between
reason and the outward meaning of revelation but he did not agree with
his findings on what can and cannot be demonstrated (Griffel 2000,
437&ndash;61). Averroes composed a refutation of
al-Ghaz&acirc;l&icirc;&rsquo;s <em>Incoherence</em>, which he called
<em>The Incoherence of the [Book of the] Incoherence</em>
(<em>Tah&acirc;fut al-tah&acirc;fut</em>). This work was translated
twice into Latin in 1328 and 1526, the later one on the basis of an
earlier Hebrew translation of the text (Steinschneider 1893,
1:330&ndash;38). The two Latin translations both have the title
<em>Destructio destructionum</em> (the later one is edited in Averroes
1961). They were printed numerous times during the 16th century and
made al-Ghaz&acirc;l&icirc;&rsquo;s criticism of Aristotelianism known
among the Averroists of the Renaissance. The Italian Agostino Nifo
(<em>c.</em>1473&ndash; after 1538), for instance, wrote a Latin
commentary to Averroes&rsquo; book. While accepting the principle that
only a valid demonstration allows interpreting the Qur&rsquo;an
symbolically, Averroes maintained that Aristotle had already
demonstrated the pre-eternity of the world, which would elevate it,
according to al-Ghaz&acirc;l&icirc;&rsquo;s rules, to a philosophical
as well as religious doctrine. Averroes also remarked that there is no
passage in the Qur&rsquo;an that unambiguously states the creation of
the world in time (Averroes 2001, 16). Al-Ghaz&acirc;l&icirc; was
clearly aware of this but assumed that this tenet is established
through the consensus (<em>ijm&acirc;&rsquo;</em>) of Muslim
theologians (Griffel 2000, 278, 429&ndash;30; 2002, 58). While
al-Ghaz&acirc;l&icirc; condemns the pre-eternity of the world at the
end of his <em>Incoherence of the Philosophers</em>, the subject of
the world&rsquo;s pre-eternity is no longer raised in his later more
systematic work on the boundaries of Islam, <em>The</em> <em>Decisive
Criterion for Distinguishing Islam from Clandestine Unbelief</em>.</p>

<h2><a name="EthRevRelSci">5. The Ethics of the <em>Revival of the Religious Sciences</em></a></h2>

<p>
Soon after al-Ghaz&acirc;l&icirc; had published his two refutations of
<em>falsafa</em> and Ism&acirc;&rsquo;&icirc;lism he left his position
at the Niz&acirc;miyya madrasa in Baghdad. During this period he began
writing what most Muslim scholars regard as his major work, <em>The
Revival of the Religious Sciences</em> (<em>Ihy&acirc;&rsquo;
&lsquo;ul&ucirc;m al-d&icirc;n</em>). The voluminous <em>Revival</em>
is a comprehensive guide to ethical behavior in the everyday life of
Muslims (Garden 2014: 63&ndash;122). It is divided into four sections, each
containing ten books. The first section deals with ritual practices
(<em>&lsquo;ib&acirc;d&acirc;t</em>), the second with social customs
(<em>&lsquo;&acirc;d&acirc;t</em>), the third with those things that
lead to perdition (<em>muhlik&acirc;t</em>) and hence should be
avoided, and the fourth with those that lead to salvation
(<em>munjiy&acirc;t</em>) and should be sought. In the forty books of
the <em>Revival</em> al-Ghaz&acirc;l&icirc; severely criticizes the
coveting of worldly matters and reminds his readers that human life is
a path towards Judgment Day and the reward or punishment gained
through it. Compared with the eternity of the next life, this life is
almost insignificant, yet it seals our fate in the world to come. In
his autobiography al-Ghaz&acirc;l&icirc; writes that reading Sufi
literature made him realize that our theological convictions are by
themselves irrelevant for gaining redemption in the afterlife. Not our
good beliefs or intentions count; only our good and virtuous actions
will determine our life in the world to come. This insight prompted
al-Ghaz&acirc;l&icirc; to change his lifestyle and adopt the Sufi path
(al-Ghaz&acirc;l&icirc; 1959a, 35&ndash;38 = 2000b, 77&ndash;80). In
the <em>Revival</em> he composed a book about human actions
(<em>mu&rsquo;&acirc;mal&acirc;t</em>) that wishes to steer clear of
any deeper discussion of theological insights
(<em>muk&acirc;shaf&acirc;t</em>). Rather, it aims at guiding people
towards ethical behavior that God will reward in this world and the
next (al-Ghaz&acirc;l&icirc; 1937&ndash;38, 1:4&ndash;5).</p>

<p>
In the <em>Revival</em> al-Ghaz&acirc;l&icirc; attacks his colleagues
in Muslim scholarship, questioning their intellectual capacities and
independence as well as their commitment to gaining reward in the
world to come. This increased moral consciousness brings
al-Ghaz&acirc;l&icirc; close to Sufi attitudes, which have a profound
influence on his subsequent works such as <em>The Niche of Lights</em>
(<em>Mishk&acirc;t al-anw&acirc;r</em>). These later works also reveal
a significant philosophical influence on al-Ghaz&acirc;l&icirc;. In
the <em>Revival</em> he teaches ethics that are based on the
development of character traits (singl., <em>khulq</em>, pl.
<em>akhl&acirc;q</em>). Performing praiseworthy deeds is an effect of
praiseworthy character traits that warrant salvation in the next life
(al-Ghaz&acirc;l&icirc; 1937&ndash;38, 1:34.4&ndash;5). He criticizes
the more traditional concept of Sunni ethics that is limited to
compliance with the ordinances of the religious law
(<em>shar&icirc;&rsquo;a</em>) and following the example of the
Prophet Muhammad. Traditional Sunni ethics are closely linked to
jurisprudence (<em>fiqh</em>) and limit itself, according to
al-Ghaz&acirc;l&icirc;, to determining and teaching the rules of
<em>shar&icirc;&rsquo;a</em>. Traditional Sunni jurisprudents are mere
&ldquo;scholars of this world&rdquo; (<em>&lsquo;ulam&acirc;&rsquo;
al-duny&acirc;</em>) who cannot guide Muslims on the best way to gain
the afterlife (al-Ghaz&acirc;l&icirc; 1937&ndash;38, 1:30&ndash;38,
98&ndash;140).</p>

<p>
In his own ethics al-Ghaz&acirc;l&icirc; stresses that the
Prophet&mdash;and no other teacher&mdash;should be the one person a
Muslim emulates. He supplements this key Sunni notion with the concept
of &ldquo;disciplining the soul&rdquo; (<em>riy&acirc;dat
al-nafs</em>). At birth the essence of the human is deficient and
ignoble and only strict efforts and patient treatment can lead it
towards developing virtuous character traits (al-Ghaz&acirc;l&icirc;
1937&ndash;38, book 23). The human soul&rsquo;s temperament, for
instance, becomes imbalanced through the influence of other people and
needs to undergo constant disciplining (<em>riy&acirc;da</em>) and
training (<em>tarbiya</em>) in order to keep these character traits at
equilibrium. Behind this kind of ethics stands the Aristotelian notion
of <em>entelechy</em>: humans have a natural potential to develop
rationality and through it acquire virtuous character. Education,
literature, religion, and politics should help realizing this
potential. Al-Ghaz&acirc;l&icirc; became acquainted with an ethic that
focuses on the development of virtuous character traits through the
works of Muslim <em>fal&acirc;sifa</em> like Miskawayh (d. 1030) and
Muslim scholars like al-R&acirc;ghib al-Isfah&acirc;n&icirc; (d.
<em>c.</em>1025), who strove to make philosophical notions compatible
with Muslim religious scholarship (Madelung 1974). As a result
al-Ghaz&acirc;l&icirc; rejected the notion, for instance, that one
should try to give up potentially harmful affections like anger or
sexual desire. These character traits are part of human nature,
al-Ghaz&acirc;l&icirc; teaches, and cannot be given up. Rather,
disciplining the soul means controlling these potentially harmful
traits through one&rsquo;s rationality (<em>&lsquo;aql</em>). The
human soul has to undergo constant training and needs to be
disciplined similar to a young horse that needs to be broken in,
schooled, and treated well.</p>

<p>
At no point does al-Ghaz&acirc;l&icirc; reveal the philosophical
origins of his ethics. He himself saw a close connection between the
ethics of the <em>fal&acirc;sifa</em> and Sufi notions of an ascetic
and virtuous lifestyle. In his <em>Revival</em> he merges these two
ethical traditions to a successful and influential fusion. In his
autobiography al-Ghaz&acirc;l&icirc; says that the ethics of the
<em>fal&acirc;sifa</em> and that of the Sufis are one and the same.
Congruent with his position that many teachings and arguments of the
<em>fal&acirc;sifa</em> are taken from earlier revelations and from
the divinely inspired insights of mystics, who existed already in
pre-Islamic religions (Treiger 2012, 99&ndash;101) he adds that the
<em>fal&acirc;sifa</em> have taken their ethics from the Sufis,
meaning here mystics among the earlier religions
(al-Ghaz&acirc;l&icirc; 1959a, 24 = 2000b, 67).</p>

<p>
Another important field where al-Ghaz&acirc;l&icirc; introduced
Avicennan ideas into Ash&rsquo;arite <em>kal&acirc;m</em> in a way
that this tradition eventually adopted them is human psychology and
the rational explanation of prophecy (Griffel 2004, al-Akiti 2004).
Based on partly mis-translated texts by Aristotle (Hansberger 2011),
Avicenna developed a psychology that assumes the existence of several
distinct faculties of the soul. These faculties are stronger or weaker
in individual humans. Prophecy is the combination of three faculties
which the prophet has in an extraordinarily strong measure. These
faculties firstly allow the prophet to acquire theoretical knowledge
instantly without learning, secondly represent this knowledge through
symbols and parables as well as divine future events, and thirdly to
bring about effects outside of his body such as rain or earthquakes.
These three faculties exist in every human in a small measure, a fact
proven by the experience of <em>d&eacute;j&agrave; vu</em>, for
instance, a phenomenon referred to in the Arabic philosophic tradition
as &ldquo;the veridical dream&rdquo; (<em>al-man&acirc;m
al-s&acirc;diq</em>). Al-Ghaz&acirc;l&icirc; adopted these teachings
and appropriated them for his own purposes (Treiger 2012). The
existence of the three faculties in human souls that make up prophecy
serves for him as an explanation of the higher insights that mystics
such as Sufi masters have in comparison to other people. While
prophets have strong prophetic faculties and ordinary humans very weak
ones, the &ldquo;friends of God&rdquo; (<em>awliy&acirc;&rsquo;</em>,
i.e. Sufi masters) stand in between these two. They are endowed with
&ldquo;inspiration&rdquo; (<em>ilh&acirc;m</em>), which is similar to
prophecy and which serves in al-Ghaz&acirc;l&icirc; as one of the most
important sources of human knoweldge. Unlike Avicenna, for whom
prophets and maybe also some particularly talented humans
(<em>&rsquo;&acirc;rif&ucirc;n</em> in his language) acquire the same
knowledge that philosophers reach through apodictic reasoning, in
al-Ghaz&acirc;l&icirc; the prophets and <em>awliy&acirc;&rsquo;</em>
have access to knowledge that is superior to that available solely
through reason. </p>

<p>
Despite the significant philosophical influence on
al-Ghaz&acirc;l&icirc;&rsquo;s ethics, he maintained in Islamic law
(<em>fiqh</em>) the anti-rationalist Ash&rsquo;arite position that
human rationality is mute with regard to normative judgments about
human actions and cannot decide whether an action is
&ldquo;good&rdquo; or &ldquo;bad.&rdquo; When humans think they know,
for instance, that lying is bad, their judgment is determined by a
consideration of their benefits. With regard to the ethical value of
our actions we have a tendency to confuse moral value with benefit. We
generally tend to assume that whatever benefits our collective
interest is morally good, while whatever harms us collectively is bad.
These judgments, however, are ultimately fallacious and cannot be the
basis of jurisprudence (<em>fiqh</em>). &ldquo;Good&rdquo; actions are
those that are rewarded in the afterlife and &ldquo;bad&rdquo; actions
are those that are punished (al-Ghaz&acirc;l&icirc; 1904&ndash;07,
1:61). The kind of connection between human actions and reward or
punishment in the afterlife can only be learned from revelation
(Hourani 1976, Marmura 1968&ndash;69). Muslim jurisprudence is the
science that extracts general rules from revelation. Like most
religious sciences it aims at advancing humans&rsquo; prospect of
redemption in the world to come. Therefore it must be based on the
Qur&rsquo;an and the <em>sunna</em> of the Prophet while it uses logic
and other rational means to extract general rules.</p>

<p>
Al-Ghaz&acirc;l&icirc; was one of the first Muslim jurists who
introduced the consideration of a &ldquo;public benefit&rdquo;
(<em>maslaha</em>) into Muslim jurisprudence. In addition to
developing clear guidance of how to gain redemption in the afterlife,
religious law (<em>shar&icirc;&rsquo;a</em>) also aims at creating an
environment that allows each individual wellbeing and the pursuit of a
virtuous and pious lifestyle. Al-Ghaz&acirc;l&icirc; argues that when
God revealed divine law (<em>shar&icirc;&rsquo;a</em>) He did so with
the purpose (<em>maqsad</em>) of advancing human benefits in this
world <em>and</em> the next. Al-Ghaz&acirc;l&icirc; identifies five
essential components for wellbeing in this world: religion, life,
intellect, offspring, and property. Whatever protects these
&ldquo;five necessities&rdquo; (<em>al-dar&ucirc;riyy&acirc;t
al-khamsa</em>) is considered public benefit (<em>maslaha</em>) and
should be advanced, while whatever harms them should be avoided. The
jurisprudent (<em>faq&icirc;h</em>) should aim at safeguarding these
five necessities in his legal judgments. In recommending this,
al-Ghaz&acirc;l&icirc; practically implies that a &ldquo;<em>maslaha
mursala</em>,&rdquo; a public benefit that is not mentioned in the
revealed text, is considered a valid source of legislation (Opwis 2007
and 2010, 65&ndash;88).</p>

<h2><a name="CosRevRelSci">6. Cosmology in the <em>Revival of the Religious Sciences</em></a></h2>

<p>
Despite his declared reluctance to enter into theological discussions,
al-Ghaz&acirc;l&icirc; addresses in his <em>Revival</em> important
philosophical problems related to human actions. In the 35th book on
&ldquo;Belief in Divine Unity and Trust in God&rdquo; (<em>Kit&acirc;b
al-Tawh&icirc;d wa-l-tawakkul</em>) he discusses the relationship
between human actions and God&rsquo;s omnipotence as creator of the
world. In this and other books of the <em>Revival</em>
al-Ghaz&acirc;l&icirc; teaches a strictly determinist position with
regard to events in the universe. God creates and determines
everything, including the actions of humans. God is the only
&ldquo;agent&rdquo; or the only &ldquo;efficient cause&rdquo;
(<em>f&acirc;&rsquo;il</em>, the Arabic term means both) in the world.
Every event in creation follows a pre-determined plan that is
eternally present in God&rsquo;s knowledge. God&rsquo;s knowledge
exists in a timeless realm and does not contain individual
&ldquo;cognitions&rdquo; (<em>&lsquo;ul&ucirc;m</em>) like human
knowledge does. God&rsquo;s knowledge does not change, for instance,
when its object, the world, changes. While the events that are
contained in God&rsquo;s knowledge are ordered in &ldquo;before&rdquo;
and &ldquo;after&rdquo;, there is no past, present, and future.
God&rsquo;s knowledge contains the first moment of creation just as
the last, and He knows &ldquo;in His eternity,&rdquo; for instance,
whether a certain individual will end up in paradise or hell (Griffel
2009, 175&ndash;213).</p>

<p>
For all practical purposes it befits humans to assume that God
controls everything through chains of causes (Marmura 1965,
193&ndash;96). We witness in nature causal processes that add up to
longer causal chains. Would we be able to follow a causal chain like
an &ldquo;inquiring wayfarer&rdquo; (<em>s&acirc;lik
s&acirc;&rsquo;il</em>), who follows a chain of events to its origin,
we would be led through causal processes in the sub-lunar sphere, the
&ldquo;world of dominion&rdquo; (<em>&lsquo;&acirc;lam al-mulk</em>),
further to causes that exist in the celestial spheres, the
&ldquo;world of sovereignty&rdquo; (<em>&lsquo;&acirc;lam
al-malak&ucirc;t</em>), until we would finally reach the highest
celestial intellect, which is caused by the being beyond it, God
(al-Ghaz&acirc;l&icirc; 1937&ndash;38, 13:2497&ndash;509 = 2001,
15&ndash;33; see also idem 1964a, 220&ndash;21). God is the starting
point of all causal chains and He creates and controls all elements
therein. God is &ldquo;the one who makes the causes function as
causes&rdquo; (<em>musabbib al-asb&acirc;b</em>) (Frank 1992, 18).</p>

<p>
God&rsquo;s &ldquo;causal&rdquo; determination of all events also
extends to human actions. Every human action is caused by the
person&rsquo;s volition, which is caused by a certain motive
(<em>d&acirc;&rsquo;iya</em>). The person&rsquo;s volition and motive
are, in turn, caused by the person&rsquo;s convictions and his or her
knowledge (<em>&lsquo;ilm</em>). Human knowledge is caused by various
factors, like one&rsquo;s experience of the world, one&rsquo;s
knowledge of revelation, or the books one has read
(al-Ghaz&acirc;l&icirc; 1937&ndash;38, 13:2509&ndash;11 = 2001,
34&ndash;37). There is no single event in this world that is not
determined by God&rsquo;s will. While humans are under the impression
that they have a free will, their actions are in reality compelled by
causes that exist within them as well as outside (Griffel 2009,
213&ndash;34).</p>

<p>
Al-Ghaz&acirc;l&icirc; viewed the world as a conglomerate of
connections that are all pre-determined and meticulously planned in
God&rsquo;s timeless knowledge. God creates the universe as a huge
apparatus and employs it in order to pursue a certain goal
(<em>qasd</em>). In two of his later works al-Ghaz&acirc;l&icirc;
compares the universe with a water-clock. Here he describes three
stages of its creation. The builder of the water-clock first has to
make a plan of it, secondly execute this plan and build the clock, and
thirdly he has to make the clock going by supplying it with a constant
source of energy, namely the flow of water. That energy needs to be
carefully measured, because only the right amount of energy will
produce the desired result. In God&rsquo;s creation of the universe
these three stages are called judgment (<em>hukm</em>), decree
(<em>qad&acirc;&rsquo;</em>), and pre-destination (<em>qadar</em>)
(al-Ghaz&acirc;l&icirc; 1971, 98&ndash;102; 1964a, 12&ndash;14). God
designs the universe in His timeless knowledge, puts it into being at
one point in time, and provides it with a constant and well-measured
supply of &ldquo;being&rdquo; (<em>wuj&ucirc;d</em>). According to
Avicenna&rsquo;s explanation of creation&mdash;which
al-Ghaz&acirc;l&icirc; was not opposed to&mdash;&ldquo;being&rdquo; is
passed down from God to the first and ontologically highest creation
and from there in a chain of secondary efficient causes to all other
existents. It is important to acknowledge, however, that God is the
only true efficient cause (<em>f&acirc;&rsquo;il</em>) in this chain.
He is the only &ldquo;agent,&rdquo; all other beings are merely
employed in His service (Griffel 2009, 236&ndash;53).</p>

<p>
Nature is a process in which all elements harmoniously dovetail with
one another. Celestial movements, natural processes, human actions,
even redemption in the afterlife are all &ldquo;causally&rdquo;
determined. Whether we will be rewarded or punished in the afterlife
can be understood, according to al-Ghaz&acirc;l&icirc;, as the mere
causal effect of our actions in this world. In the 32nd book of his
<em>Revival</em> al-Ghaz&acirc;l&icirc; explains how knowing the
Qur&rsquo;an causes the conviction (<em>i&rsquo;tiq&acirc;d</em>) that
one is punished for bad deeds, and how that conviction may cause
salvation in the afterlife:</p>

<blockquote>
&hellip;and the conviction [that some humans will be punished] is a
cause (<em>sabab</em>) for the setting in of fear, and the setting in
of fear is a cause for abandoning the passions and retreating from the
abode of delusions. This is a cause for arriving at the vicinity of
God, and God is the one who makes the causes function as causes
(<em>musabbib al-asb&acirc;b</em>) and who arranges them
(<em>murattibuh&acirc;</em>). These causes have been made easy for
him, who has been predestined in eternity to earn redemption, so that
through their chaining-together the causes will lead him to paradise.
(al-Ghaz&acirc;l&icirc; 1937&ndash;38, 11:2225.)
</blockquote>

<p>
All these are teachings that are very close to those of Avicenna
(Frank 1992, 24&ndash;25). Al-Ghaz&acirc;l&icirc; also followed
Avicenna in his conviction that this universe is the best of all
possible worlds and that &ldquo;there is in possibility nothing more
wondrous than what is&rdquo; (<em>laysa f&icirc;-l-imk&acirc;n
abda&rsquo; mimm&acirc; k&acirc;n</em>) (al-Ghaz&acirc;l&icirc;
1937&ndash;38, 13:2515&ndash;18 = 2001, 47&ndash;50). This led to a
long-lasting debate among later Muslim theologians about what is meant
by this sentence and whether al-Ghaz&acirc;l&icirc; is, in fact, right
(Ormsby 1984). It must be stressed, however, that contrary to
Avicenna&mdash;and contrary to Frank&rsquo;s (1992, 55&ndash;63)
understanding of him&mdash;al-Ghaz&acirc;l&icirc; firmly held that God
exercises a genuine free will and that when He creates, He chooses
between alternatives. God&rsquo;s will is not in any way determined by
God&rsquo;s nature or essence. God&rsquo;s will is the undetermined
determinator of everything in this world.</p>

<h2><a name="CauAlGha">7. Causality in al-Ghaz&acirc;l&icirc;</a></h2>

<p>
Al-Ghaz&acirc;l&icirc;&rsquo;s cosmology of God&rsquo;s determination
and His control over events in His creation through chains of causes
(singl. <em>sabab</em>) aimed at safeguarding the Sunni doctrine of
omnipotence and divine pre-determination against the criticism of
Mu&rsquo;tazilites and Shiites. Humans have only the impression of a
free will (<em>ikhtiy&acirc;r</em>). In reality they are compelled to
choose what they deem is the best action (<em>khayr</em>) among the
present alternatives. Avicenna&rsquo;s determinist ontology, where
every event in the created world is by itself contingent (<em>mumkim
al-wuj&ucirc;d bi-dh&acirc;tihi</em>) yet also necessitated by
something else (<em>w&acirc;jib al-wuj&ucirc;d bi-ghayrihi</em>),
provided a suitable interpretation of God&rsquo;s pre-determination
and is readily adopted by al-Ghaz&acirc;l&icirc; although he never
admits that or uses Avicenna&rsquo;s language. In Avicenna the First
Being, which is God, makes all other beings and events necessary. In
al-Ghaz&acirc;l&icirc; God&rsquo;s will, which is distinct from His
essence, necessitates all beings and events in creation. The
adaptation of fundamental assumptions in Avicenna&rsquo;s cosmology
together with an almost wholesale acceptance of Avicenna&rsquo;s
psychology and his prophetology led Frank (1992, 86) to conclude
&ldquo;that from a theological standpoint most of [Avicenna&rsquo;s]
theses which he rejected are relatively tame and inconsequential
compared to those in which he follows the philosopher.&rdquo;</p>

<p>
While al-Ghaz&acirc;l&icirc;&rsquo;s determinist cosmology is a
radical but faithful interpretation of the Ash&rsquo;arite tenet of
divine pre-determination, the way al-Ghaz&acirc;l&icirc; writes about
it in his <em>Revival</em> and later works violates other principles
of Ash&rsquo;arism and has led to much confusion among modern
interpreters. The remainder of this article will make an attempt to
resolve current interpretative problems and explain
al-Ghaz&acirc;l&icirc;&rsquo;s innovative approach towards
causality.</p>

<h3><a name="OccVerSecCau">7.1 Occasionalism versus Secondary Causality</a></h3>

<p>
Al-Ash&rsquo;ari (873&ndash;935), the founder of the theological
school that al-Ghaz&acirc;l&icirc; belonged to, had rejected the
existence of &ldquo;natures&rdquo; (<em>tab&acirc;&rsquo;i&rsquo;</em>
) and of causal connections among created beings. In a radical attempt
to explain God&rsquo;s omnipotence, he combined several ideas that
were developed earlier in Muslim <em>kal&acirc;m</em> to what became
known as occasionalism. All material things are composed of atoms that
have no qualities or attributes but simply make up the shape of the
body. The atoms of the bodies are the carrier of
&ldquo;accidents&rdquo; (singl. <em>&lsquo;arad</em>), which are
attributes like weight, density, color, smell, etc. In the cosmology
of al-Ash&rsquo;ar&icirc; all immaterial things are considered
&ldquo;accidents&rdquo; that inhere in a &ldquo;substance&rdquo;
(<em>jawhar</em>). Only the atoms of spatially extended bodies can be
substances. A person&rsquo;s thoughts, for instance, are considered
accidents that inhere in the atoms of the person&rsquo;s brain, while
his or her faith is an accident inhering in the atoms of the heart.
None of the accidents, however, can subsist from one moment
(<em>waqt</em>) to the next. This leads to a cosmology where in each
moment God assigns the accidents to bodies in which they inhere. When
one moment ends, God creates new accidents. None of the created
accidents in the second moment has any causal relation to the ones in
the earlier moment. If a body continues to have a certain attribute
from one moment to the next, then God creates two identical accidents
inhering in that body in each of the two subsequent moments. Movement
and development generate when God decides to change the arrangement of
the moment before. A ball is moved, for instance, when in the second
moment of two the atoms of the ball happen to be created in a certain
distance from the first. The distance determines the speed of the
movement. The ball thus jumps in leaps over the playing field and the
same is true for the players&rsquo; limbs and their bodies. This also
applies to the atoms of the air if there happen to be some wind. In
every moment, God re-arranges all the atoms of this world anew and He
creates new accidents&mdash;thus creating a new world every moment
(Perler/Rudolph 2000, 28&ndash;62).</p>

<p>
All Ash&rsquo;arite theologians up to the generation of
al-Ghaz&acirc;l&icirc;&mdash;including his teacher
al-Juwayn&icirc;&mdash;subscribed to the occasionalist ontology
developed by al-Ash&rsquo;ar&icirc;. One of al-Juwayn&icirc;&rsquo;s
late works, the <em>Creed for Niz&acirc;m al-Mulk</em>
(<em>al-&lsquo;Aq&icirc;da al-Niz&acirc;miyya</em>), shows, however,
that he already explored different ontological models, particularly
with regard to the effects of human actions (al-Juwayn&icirc; 1948,
30&ndash;36; Gimaret 1980, 122&ndash;28). A purely occasionalist model
finds it difficult to explain how God can make humans responsible for
their own actions if they do not cause them. As a viable alternative
to the occasionalist ontology, al-Ghaz&acirc;l&icirc; considered the
Avicennan model of secondary causes. When God wishes to create a
certain event He employs some of His own creations as mediators or
&ldquo;secondary causes.&rdquo; God creates series of efficient causes
where any superior element causes the existence of the inferior ones.
Avicenna stresses that no causal series, in any of the four types of
causes, can regress indefinitely. Every series of causes and effects
must have at least three components: a first element, a middle
element, and a last element. In such a chain only the first element is
the cause in the real sense of the word (<em>&lsquo;illa mutlaqa</em>)
of all subsequent elements. It causes the last element of that
chain&mdash;the ultimate effect&mdash;through one or many
intermediaries (singl. <em>mutawassat</em>), which are the middle
elements of the chain. Looking at a chain of efficient causes, the
&ldquo;finiteness of the causes&rdquo; (<em>tan&acirc;h&icirc;
l-&rsquo;ilal</em>) serves for Avicenna as the basis of a proof of
God&rsquo;s existence. Tracing back all efficient causes in the
universe will lead to a first efficient cause, which is itself
uncaused. When the First Cause is also shown to be incorporeal and
numerically one, one has achieved a proof of God&rsquo;s existence
(Avicenna 2005, 257&ndash;9, 270&ndash;3; Davidson 1987,
339&ndash;40).</p>

<h3><a name="17tDisInc">7.2 The 17th Discussion of the <em>Incoherence</em></a></h3>

<p>
Al-Ghaz&acirc;l&icirc; offers a brief yet very comprehensive
examination of causality within the 17th discussion of his
<em>Incoherence of the Philosophers</em>. The 17th discussion is not
triggered by any opposition to causality. Rather it aims at forcing
al-Ghaz&acirc;l&icirc;&rsquo;s adversaries, the
<em>fal&acirc;sifa</em>, to acknowledge that all prophetical miracles
that are reported in the Qur&rsquo;an are possible. If their
possibility is acknowledged, a Muslim philosopher who accepts the
authority of revelation must also admit that the prophets performed
these miracles and that the narrative in revelation is truthful.
Al-Ghaz&acirc;l&icirc; divides the 17th discussion into four different
sections. He presents three different &ldquo;positions&rdquo; (singl.
<em>maq&acirc;m</em>) of his (various) opponents and addresses them
one by one. His response to the &ldquo;second position&rdquo;, which
is that of Avicenna, is further divided into two different
&ldquo;approaches&rdquo; (singl<em>. maslak</em>). This four-fold
division of the 17th discussion is crucial for its understanding.
Al-Ghaz&acirc;l&icirc; addresses different concepts about causality
within the different discussions and develops not one, but at least
two coherent responses.</p>

<p>
For a detailed discussion of the four parts in the 17th discussion the
reader must be referred to chapter 6 in Griffel 2009 (147&ndash;73).
The following pages give only an outline of
al-Ghaz&acirc;l&icirc;&rsquo;s overall argument. In the opening
sentence of the 17th discussion al-Ghaz&acirc;l&icirc; introduces the
position he wishes to refute and he lines out elements that
alternative explanations of causality must include in order to be
acceptable for al-Ghaz&acirc;l&icirc;. This opening statement is a
masterwork of philosophical literature:</p>

<blockquote>
The connection (<em>iqtir&acirc;n</em>) between what is habitually
believed to be a cause and what is habitually believed to be an effect
is not necessary (<em>dar&ucirc;r&icirc;</em>), according to us. But
[with] any two things [that are not identical and that do not imply
one another] (&hellip;) it is not necessary that the existence or the
nonexistence of one follows necessarily (<em>min dar&ucirc;ra</em>)
from the existence or the nonexistence of the other (&hellip;). Their
connection is due to the prior decision (<em>taqd&icirc;r</em>) of
God, who creates them side by side (<em>&lsquo;al&acirc;
al-tas&acirc;wuq</em>), not to its being necessary by itself,
incapable of separation. (al-Ghaz&acirc;l&icirc; 2000a, 166)
</blockquote>

<p>
Al-Ghaz&acirc;l&icirc; lays out four conditions that any explanation
of physical processes that is acceptable to him must fulfill: (1) the
connection between a cause and its effect is not necessary, (2) the
effect can come to exist without this particular cause (&ldquo;they
are not incapable of separation&rdquo;), (3) God creates two events
concomitant, side by side, and (4) God&rsquo;s creation follows a
prior decision (<em>taqd&icirc;r</em>). On first sight, it seems that
only an occasionalist explanation of physical processes would fulfill
these four conditions, and this is how this statement has mostly been
understood. Rudolph (in Perler/Rudolph 2000, 75&ndash;77), however,
pointed out that not only occasionalism but other types of
explanations also fulfill these four criteria. Most misleading is the
third requirement that God would need to create events &ldquo;side by
side.&rdquo; These words seem to point exclusively to an occasionalist
understanding of creation. One should keep in mind, however, that this
formula leaves open, <em>how</em> God creates events. Even an
Avicennan philosopher holds that God creates the cause concomitant to
its effect, and does so by means of secondary causality. While the
17th discussion of al-Ghaz&acirc;l&icirc;&rsquo;s <em>Incoherence</em>
points towards occasionalism as a possible solution, it also points to
others. Al-Ghaz&acirc;l&icirc; chooses a certain linguistic
association to occasionalism, which has led many interpreters of this
discussion to believe that here, he argues exclusively in favor of
it.</p>

<p>
It is important to understand that al-Ghaz&acirc;l&icirc; does not
deny the existence of a connection between a cause and its effect;
rather he denies the necessary character of this connection. In the
First Position of the 17th discussion al-Ghaz&acirc;l&icirc; brings
the argument that observation cannot prove causal connections.
Observation can only conclude that the cause and its effect occur
concomitantly:</p>

<blockquote>
Observation (<em>mush&acirc;hada</em>) points towards a concomitant
occurrence (<em>al-hus&ucirc;l &lsquo;indahu</em>) but not to a
combined occurrence (<em>al-hus&ucirc;l bihi</em>) and that there is
no other cause (<em>&lsquo;illa</em>) for it. (al-Ghaz&acirc;l&icirc;
2000a, 167.)
</blockquote>

<p>
It would be wrong, however, to conclude from this argument that
al-Ghaz&acirc;l&icirc; denied the existence of causal connections.
While such connections cannot be proven through observation (or
through any other means), they may or may not exist. In the First
Position al-Ghaz&acirc;l&icirc; rejects the view that the connection
between an efficient cause and its effect is simply necessary <em>per
se</em>, meaning that the proximate cause alone is fully responsible
for the effect and that nothing else is also necessary for the effect
to occur. In another work this position is described as one held by
&ldquo;materialists&rdquo; (<em>dahriyy&ucirc;n</em>) who deny that
the world has a cause or a maker (al-Ghaz&acirc;l&icirc; 1959a, 19 =
2000b, 61). The Mu&rsquo;tazilite view of <em>tawallud</em>, meaning
that humans are the sole creators of their own actions and their
immediate effects, also falls under this position
(al-Ghaz&acirc;l&icirc; 2000, 226.13&ndash;14). Like in the connection
between a father and his son, where the father is not the
<em>only</em> efficient cause for the son&rsquo;s existence, so there
may be in every causal connection efficient causes involved other than
the most obvious or the most proximate one. The proximate efficient
cause may be just the last element in a long chain of efficient causes
that extends via the heavenly realm. The intellects of the celestial
spheres, which were thought to be referred to in revelation as
&ldquo;angels,&rdquo; may be middle elements or intermediaries in
causal chains that all have its beginning in God.
Al-Ghaz&acirc;l&icirc; rejects the position of the materialists and
the Mu&rsquo;tazilites because it does not take account of the fact
that God is the ultimate efficient cause of the observed effect. God
may create this effect directly or by way of secondary causality.
Discussing the example that when fire touches a ball of cotton it
causes it to combust, al-Ghaz&acirc;l&icirc; writes about the First
Position that the fire <em>alone</em> causes combustion:</p>

<blockquote>
This [position] is one of those that we deny. Rather we say that the
efficient cause (<em>f&acirc;&rsquo;il</em>) of the combustion through
the creation of blackness in the cotton and through causing the
separation of its parts and turning it into coal or ashes is
God&mdash;either through the mediation of the angels or without
mediation. (al-Ghaz&acirc;l&icirc; 2000a, 167.)
</blockquote>

<p>
Secondary causality is a viable option for al-Ghaz&acirc;l&icirc; that
he is willing to accept. Still he does not accept the teachings of
Avicenna, which are discussed in the Second Position. Avicenna
combines secondary causality with the view that causal processes
proceed with necessity and in accord with the natures of things, and
not by way of deliberation and choice on the side of the efficient
cause. The ultimate efficient cause in a cosmology of secondary
causality is, of course, God. The Avicennan opponent of the Second
Position teaches secondary causality <em>plus</em> he holds that the
causal connections follow with necessity from the nature of the First
Being. They are not created through God&rsquo;s deliberation and
choice but are a necessary effect of God&rsquo;s essence.</p>

<h3><a name="TwoDifConMod">7.3 Two Different Concepts of the Modalities</a></h3>

<p>
When al-Ghaz&acirc;l&icirc; writes that the connection between a cause
and its effect is not necessary he attacks Avicenna&rsquo;s
necessitarian ontology not his secondary causality. The dispute
between al-Ghaz&acirc;l&icirc; and Avicenna is not about causality as
such, rather about the necessary nature of God&rsquo;s creation.
Kukkonen (2000) and Dutton (2001) have shown that the two start with
quite different assumptions about necessity. Avicenna&rsquo;s view of
the modalities follows the statistical model of Aristotle and connects
the possibility of a thing to its temporal actuality (B&auml;ck 1992).
A temporally unqualified sentence like, &ldquo;Fire causes cotton to
combust,&rdquo; contains implicitly or explicitly a reference to the
time of utterance as part of its meaning. If this sentence is true
whenever uttered, it is necessarily true. If its truth-value can
change in the course of time, it is possible. If such a sentence is
false whenever uttered, it is impossible (Hintikka 1973, 63&ndash;72,
84&ndash;6, 103&ndash;5, 149&ndash;53). In Aristotelian modal
theories, modal terms were taken to refer to the one and only
historical world of ours. For Avicenna, fire necessarily causes cotton
to combust because the sentence &ldquo;Fire causes cotton to
combust,&rdquo; was, is, and will always be true.</p>

<p>
Al-Ghaz&acirc;l&icirc;&rsquo;s understanding of the modalities
developed in the context of Ash&rsquo;arite <em>kal&acirc;m</em> and
does not share the statistical model of Aristotle and Avicenna.
Ash&rsquo;arite <em>kal&acirc;m</em> developed an understanding that
is closer to our modern view of the modalities as referring to
synchronic alternative states of affairs. In the modern model, the
notion of necessity refers to what obtains in all alternatives, the
notion of possibility refers to what obtains in at least in one
alternative, and that which is impossible does not obtain in any
conceivable state of affairs (Knuuttila 1998, 145). Ash&rsquo;arite
<em>kal&acirc;m</em> pursued the notion that God is the
particularizing agent (<em>mukhassis</em>) of all events in the world,
who determines, for instance, when things come into existence and when
they fall out of existence (Davidson 1987, 159&ndash;61,
176&ndash;80). The idea of particularization (<em>takhs&icirc;s</em>)
includes implicitly an understanding of possible worlds that are
different from this. The process of particularization makes one of
several alternatives actual. In his <em>Creed for Niz&acirc;m
al-Mulk</em>, al-Juwayn&icirc; explains the Ash&rsquo;arite
understanding of the modalities. Every sound thinking person finds
within herself, &ldquo;the knowledge about the possibility of what is
possible, the necessity of what is necessary, and the impossibility of
what is impossible&rdquo; (al-Juwayn&icirc; 1948, 8&ndash;9). We know
this distinction instinctively without learning it from others and
without further inquiry into the world. It is an impulse
(<em>bad&icirc;ha</em>) in our rational judgment
(<em>&lsquo;aql</em>). Al-Juwayn&icirc; explains this impulse:</p>

<blockquote>
The impulsive possibility that the intellect rushes to apprehend
without [any] consideration, thinking, or inquiry is what becomes
evident to the intelligent person when he sees a building. [The
building] is a possibility that comes into being (<em>min jaw&acirc;z
hud&ucirc;thihi</em>). The person knows decisively and offhand that
the actual state (<em>hud&ucirc;th</em>) of that building is from
among its possible states (<em>ja&rsquo;iz&acirc;t</em>) and that it
is not impossible in the intellect had it not been built.
(al-Juwayn&icirc; 1948, 9)
</blockquote>

<p>
The intelligent person (<em>al-&lsquo;&acirc;qil</em>)&mdash;here
simply meaning a person with full rational capacity&mdash;realizes
that all the features of the building, its height, its length, its
form, etc., are actualized possibilities and could be different. The
same applies to the time when the building is built. We immediately
realize, al-Juwayn&icirc; says, that there is a synchronic alternative
state to the actual building. This is what we call possibility or more
precisely contingency (<em>imk&acirc;n</em>). Realizing that there is
such an alternative is an important part of our understanding:
&ldquo;The intelligent person cannot realize in his mind anything
about the states of the building without comparing it with what is
contingent like it (<em>imk&acirc;n mithlihi</em>) or what is
different from it (<em>khil&acirc;fihi</em>).&rdquo; (al-Juwayn&icirc;
1948,9.)</p>

<p>
In at least three passages of the <em>Incoherence</em>
al-Ghaz&acirc;l&icirc; criticizes Avicenna&rsquo;s understanding of
the modalities. Here he refers to another, closely related dispute,
namely that for Avicenna the modalities exist in reality while for
al-Ghaz&acirc;l&icirc; they exist only as judgments in the minds of
humans (al-Ghaz&acirc;l&icirc; 2000, 42.2&ndash;5, 124.10&ndash;11,
207.4&ndash;14). He denies Avicenna&rsquo;s premise that possibility
needs a substrate. This premise is Aristotelian&mdash;it is the basis
to the principle of entelechy, namely that all things have
potentialities and are driven to actualize them (Dutton 2001,
26&ndash;7) Al-Ghaz&acirc;l&icirc; shifts, as Kukkonen (2000,
488&ndash;9) puts it, the locus of the presumption of a thing&rsquo;s
actual existence from the plane of the actualized reality to the plane
of mental conceivability.</p>

<p>
When al-Ghaz&acirc;l&icirc; says that &ldquo;according to us&rdquo;
the connection between the efficient cause and its effect is not
necessary, he aims to point out that the connection <em>could</em> be
different even if it never will be different. For Avicenna, the fact
that the connection never was different and never will be different
implies that it is necessary. Nowhere in his works requires
al-Ghaz&acirc;l&icirc; that any given causal connection was different
or will be different in order to be considered not necessary. We will
see that he, like Avicenna, assumes causal connections never were and
never will be different from what they are now. Still they are not
necessary, he maintains. The connection between a cause and its effect
is contingent (<em>mumkin</em>) because an alternative to it is
conceivable in our minds. We can imagine a world where fire does not
cause cotton to combust. Or, to continue reading the initial statement
of the 17th discussion:</p>

<blockquote>
(&hellip;) it is within divine power to create satiety without eating,
to create death without a deep cut (<em>hazz</em>) in the neck, to
continue life after having received a deep cut in the neck, and so on
to all connected things. The <em>fal&acirc;sifa</em> deny the
possibility of [this] and claim it to be impossible.
(al-Ghaz&acirc;l&icirc; 2000a, 166.)
</blockquote>

<p>
Of course, a world where fire doesn&rsquo;t cause combustion in cotton
would be radically different from the one we live in. A change in a
single causal connection would probably imply that many others would
be different as well. Still, such a world can be conceived in our
minds, which means it is a possible world. God, however, did not
choose to create such an alternative possible world (Griffel 2009,
172&ndash;3).</p>

<p>
In the initial statement of the 17th discussion al-Ghaz&acirc;l&icirc;
claims that &ldquo;the connection [between cause and effect] is due to
the prior decision (<em>taqd&icirc;r</em>) of God.&rdquo; When he
objects to Avicenna that these connections are not necessary,
al-Ghaz&acirc;l&icirc; wishes to point out that God could have chosen
to create an alternative world where the causal connections are
different from what they are. Avicenna denied this. This world is the
necessary effect of God&rsquo;s nature and a world different from this
one is unconceivable. Al-Ghaz&acirc;l&icirc; objects and says this
world is the contingent effect of God&rsquo;s free will and His
deliberate choice between alternative worlds.</p>

<h3><a name="CumPosOccSecCau">7.4 The Cum-Possibility of Occasionalism and Secondary Causality</a></h3>

<p>
In the Second Position of the 17th discussion al-Ghaz&acirc;l&icirc;
presents two different &ldquo;approaches&rdquo; (singl.
<em>maslak</em>) in order to counter Avicenna&rsquo;s position that
the necessary connection between existing causes and effects renders
some miracles in the Qur&rsquo;an impossible. In the First Approach
al-Ghaz&acirc;l&icirc; denies the existence of &ldquo;natures&rdquo;
(<em>tab&acirc;&rsquo;i&rsquo;</em>) and of causal connections and
maintains that God creates every event immediately. This is the part
of the 17th discussion where he presents occasionalism as a viable
explanation of what we have usually come to refer as efficient
causality. God&rsquo;s eternal and unchanging knowledge already
contains all events that will happen in creation. By creating
combustion every time fire touches cotton, God follows a certain
custom (<em>&lsquo;&acirc;da</em>). In real terms, however, combustion
occurs only concomitantly when fire touches cotton and is not
connected to this event. In the First Approach of the Second Position
in the 17th discussion (al-Ghaz&acirc;l&icirc; 2000a,
169.14&ndash;171.11) and in some of his later works
(al-Ghaz&acirc;l&icirc; 1962), he maintains that causal processes may
simply be the result of God&rsquo;s habit and that He creates what we
consider a cause and its effect individually and immediately. When God
wishes to perform a miracle and confirm the mission of one of His
prophets, he suspends His habit and omits to create the effect He
usually does according to His habit.</p>

<p>
The Second Approach (al-Ghaz&acirc;l&icirc; 2000a, 171.12&ndash;174.8)
presents a very different explanation of prophetical miracles. Marmura
(1981) called it &ldquo;al-Ghaz&acirc;l&icirc;&rsquo;s second causal
theory.&rdquo; Here al-Ghaz&acirc;l&icirc; accepts the existence of
&ldquo;natures&rdquo; (<em>tab&acirc;&rsquo;i&rsquo;</em>) and of
unchanging connections between causes and their effects. In the second
causal theory al-Ghaz&acirc;l&icirc; merely points out that despite
human efforts in the natural sciences, we are far away from knowing
all causes and explaining all processes in nature. It may well be the
case that those miracles that the <em>fal&acirc;sifa</em> deny have
immanent natural causes that are unknown to us. When Moses, for
instance, threw his stick to the ground and it changed into a serpent
(Qur&rsquo;an, 7.107, 20.69, 26.32) the material of the wooden stick
may have undergone a rapid transformation and become a living animal.
We know that wood disintegrates with time and becomes earth that
fertilizes and feeds plants. These plants are, in turn, the fodder of
herbivores, which are consumed by carnivores like snakes. The
<em>fal&acirc;sifa</em> cannot exclude that some unknown cause acts as
a catalyst and may rapidly expedite the usually slow process where the
matter of a wooden stick is transformed into a snake. These and other
explanations given in the Second Approach are only examples of how the
prophetical miracles may be the result of natural causes that are not
fully understood by humans.</p>

<p>
Marmura (1965, 183; 1981, 97) rejected the suggestion that
al-Ghaz&acirc;l&icirc; might have held occasionalism and secondary
causality as two cum-possible cosmological explanations. Marmura
conceded that al-Ghaz&acirc;l&icirc; makes use of causalist language
&ldquo;sometimes in the way it is used in ordinary Arabic, sometimes
in a more specifically Avicennian / Aristotelian way&rdquo; and that
this usage of language is innovative for the Ash&rsquo;arite school
discourse (1995, 89). Yet in all major points of Muslim theology
al-Ghaz&acirc;l&icirc; held positions that follow closely the ones
developed by earlier Ash&rsquo;arite scholars, namely the possibility
of miracles, the creation of humans acts, and God&rsquo;s freedom
during the creation of the universe (1995, 91, 93&ndash;97,
99&ndash;100). In Marmura&rsquo;s view, al-Ghaz&acirc;l&icirc; never
deviated from occasionalism, while he sometimes expressed his opinions
in ambiguous language that mocked philosophical parlance, probably in
order to lure followers of <em>fals&acirc;fa</em> into the
Ash&rsquo;arite occasionalist camp.</p>

<p>
That al-Ghaz&acirc;l&icirc; considered occasionalism and secondary
causality as cum-possible explanations of God&rsquo;s creative
activity is stated, however, in a passage in the 20th discussion of
the <em>Incoherence</em> on the subject of corporeal resurrection in
the afterlife. The <em>fal&acirc;sifa</em> argue that corporeal
resurrection is impossible because it requires the transformation of
substances like iron into a garment, which is impossible. In his
response, al-Ghaz&acirc;l&icirc; refers to the Second Approach of the
Second Position in the 17th discussion where, he says, he had already
discussed this problem. He argues that the unusually rapid recycling
of the matter that makes up the piece of iron into a piece of garment
is not impossible. &ldquo;But this is not the point at issue
here,&rdquo; al-Ghaz&acirc;l&icirc; says. The real question is whether
such a transformation &ldquo;occurs purely through [divine] power
without an intermediary, or through one of the causes.&rdquo; He
continues:</p>

<blockquote>
Both these two views are possible for us (<em>kil&acirc;hum&acirc;
mumkin&acirc;n &lsquo;indan&acirc;</em>) (&hellip;) [In the 17th
discussion we stated] that the connection of connected things in
existence is not by way of necessity but through habitual events,
which can be disrupted. Thus, these events come about through the
power of God without the existence of their causes. The second [view]
is that we say: This is due to causes, but it is not a condition that
the cause [here] would be one that is well-known
(<em>ma&rsquo;h&ucirc;d</em>). Rather, in the treasury of things that
are enacted by [God&rsquo;s] power there are wondrous and strange
things that one hasn&rsquo;t come across. These are denied by someone
who thinks that only those things exists that he experiences similar
to people who deny magic, sorcery, the talismanic arts, [prophetic]
miracles, and the wondrous deeds [done by saints].
(al-Ghaz&acirc;l&icirc; 2000a, 222.)
</blockquote>

<p>
Al-Ghaz&acirc;l&icirc; maintained this undecided position throughout
his lifetime. Given the fact that neither observation nor any other
means of knowing (including revelation) gives a decisive proof for the
existence or non-existence of a connection between a cause and its
effect, we must suspend our judgment on this matter. God may create
through the mediation of causes that He employs, or directly without
such mediation. This undecided position is unfortunately nowhere
clearly explained. It can be gathered from isolated statements like
the one above and the fact that after the <em>Incoherence</em>
al-Ghaz&acirc;l&icirc; wrote books where he maintained a distinctly
occasionalist cosmology (al-Ghaz&acirc;l&icirc; 1962) and others like
the 35th book of his <em>Revival</em> or the <em>Niche of Lights</em>,
where he uses language that is explicitly causalist. In none of these
books, however, he commits himself to the position that the cause is
connected to its effect. God may create the two independently from one
another or He may create them through the mediation of secondary
causes. In his very last work, completed only days before his death,
al-Ghaz&acirc;l&icirc; discusses whether God creates &ldquo;through
the mediation&rdquo; (<em>bi-w&acirc;sita</em>) of his creations or
not, and maintains that the matter cannot be settled decisively
(al-Ghaz&acirc;l&icirc; 1985, 68&ndash;69).</p>

<p>
In all this al-Ghaz&acirc;l&icirc; accepted the unchanging character
of this creation. Once God chose to create this world among
alternatives, He also chose not to change the rules that govern it.
While it is conceivable and therefore possible that God would break
his habit or intervene in the assigned function of the secondary
causes, He informs us in His revelation that He will not do so. In the
31st book of his <em>Revival</em>, al-Ghaz&acirc;l&icirc; says that
God creates all things one after the other in an orderly manner. After
making clear that this order represents God&rsquo;s habit
(<em>sunna</em>), he quotes the Qur&rsquo;an (33:62 and 48:23):
&ldquo;You will not find any change in God&rsquo;s habit.&rdquo;
(al-Ghaz&acirc;l&icirc; 1937&ndash;38, 11:2084&ndash;85.) This verse
is quoted several times in the <em>Revival</em>; in one passage
al-Ghaz&acirc;l&icirc; adds that we should not think God will ever
change His habit (ibid, 4:12). Prophetical miracles are merely
extraordinary occurrences that take place within the system of the
strictly habitual operation of God&rsquo;s actions or within the
&ldquo;natural laws&rdquo; that govern the secondary causes. Miracles
are programmed into God&rsquo;s plan for His creation, so to speak,
from the very beginning and do not represent a direct intervention or
a suspension of God&rsquo;s lawful actions (Frank 1992, 59; idem,
1994, 20). Given that there will never be a break in God&rsquo;s
habit, an occasionalist universe will always remain indistinguishable
from one governed by secondary causality.</p>
</div>

<div id="bibliography">

<h2><a name="Bib">Bibliography</a></h2>

<h3><a name="PriTex">Primary Texts</a></h3>

<ul class="hanging">

<li>Avicenna, 2005, <em>The Metaphysics of The Healing: A Parallel
English-Arabic Text</em>, M.E. Marmura (ed. and trans.). Provo (Utah):
Brigham Young University Press.</li>

<li>Averroes, 1930, <em>Averro&egrave;s Tahafot at-Tahafot</em>, M.
Bouyges (ed.), Beirut: Imprimerie Catholique.</li>

<li>&ndash;&ndash;&ndash; 1954, <em>Averroes&rsquo; Tahafut al-tahafut
(The Incoherence of the Incoherence)</em>, S. van den Bergh (trans.),
2 vols., London: Luzac.</li>

<li>&ndash;&ndash;&ndash; 1961, <em>Destructio destructionum
philosophiae Algazelis in the Latin Version of Calo Calonymos</em>,
B.H. Zedler (ed.), Milwaukee: Marquette University Press.</li>

<li>&ndash;&ndash;&ndash; 2001, <em>The Book of the Decisive Treatise
Determining the Connection Between Law and Wisdom</em> (Arabic and
English Text), C. Butterworth (ed. and trans.), Provo (Utah): Brigham
Young University Press.</li>

<li>al-Juwayn&icirc;, 1948, <em>al-&rsquo;Aq&icirc;da
al-Niz&acirc;miyya</em>, M.Z. al-Kawthar&icirc; (ed.), Cairo: Maktabat
al-Kh&acirc;nj&icirc;.</li>

<li>al-Ghaz&acirc;l&icirc;, 1506, <em>Logica et philosophia Algazelis
Arabis</em>, Venice: P. Liechtenstein. Reprint Frankfurt (Germany):
Minerva, 1969.</li>

<li>&ndash;&ndash;&ndash; 1896, <em>Die Abhandlung des Ab&ucirc;
H&acirc;mid al-Gazz&acirc;l&icirc;. Antworten auf Fragen, die an ihn
gerichtet wurden</em>, H. Malter (ed.) Frankfurt: J. Kauffmann.</li>

<li>&ndash;&ndash;&ndash; 1904&ndash;07, <em>al-Mustasf&acirc; min
&lsquo;ilm al-us&ucirc;l</em>, 2 vols. B&ucirc;l&acirc;q:
al-Matba&rsquo;a al-Am&icirc;riyya. Reprint Beirut: D&acirc;r al-Fikr,
n.d.</li>

<li>&ndash;&ndash;&ndash; 1923, <em>M&icirc;z&acirc;n
al-&rsquo;amal</em>, M.S. al-Kurd&icirc; (ed.), Cairo:
al-Matba&rsquo;a al-&rsquo;Arabiyya.</li>

<li>&ndash;&ndash;&ndash; 1933, <em>Algazels&rsquo;s Metaphysics: A
Medieval Translation</em>, J.T. Muckle (ed.), Toronto: St.
Michael&rsquo;s College.</li>

<li>&ndash;&ndash;&ndash; 1936, <em>Maq&acirc;sid
al-fal&acirc;sifa</em>, M.S. al-Kurd&icirc; (ed.), Cairo:
al-Matba&rsquo;a al-Mahm&ucirc;diyya al-Tij&acirc;riyya.</li>

<li>&ndash;&ndash;&ndash; 1937&ndash;38, <em>Ihy&acirc;&rsquo;
&lsquo;ul&ucirc;m al-d&icirc;n</em>, 16 parts, Cairo: Lajnat Nashr
al-Thaq&acirc;fa al-Isl&acirc;miyya. Reprint Beirut: D&acirc;r
al-Kit&acirc;b al-&rsquo;Arab&icirc;, n. d. [<em>c.</em>1990].</li>

<li>&ndash;&ndash;&ndash; 1954, <em>Qaw&acirc;sim
al-B&acirc;tiniyya</em>, in Ahmed Ates,
&ldquo;Gaz&acirc;l&icirc;&rsquo;in Batin&icirc;lerin Belini
Delliler&rsquo;i Kit&acirc;b Kav&acirc;sim
al-B&acirc;t&icirc;n&icirc;ya.&rdquo; <em>Il&acirc;hiy&acirc;t
Fak&uuml;ltesi Dergisi Ankara &Uuml;niversitesi</em> 3:
23&ndash;54.</li>

<li>&ndash;&ndash;&ndash; 1959a, <em>al-Munqidh min
al-dal&acirc;l</em> / <em>Erreur et d&eacute;livrance</em>, F. Jabre
(ed. and trans.), Beirut: Commission libanaise pour la traduction des
chefs-d&rsquo;oeuvre.</li>

<li>&ndash;&ndash;&ndash; 1959b, <em>al-Qist&acirc;s
al-mustaq&icirc;m</em>, V. Chelhot (ed.), Beirut: Imprimerie
Catholique.</li>

<li>&ndash;&ndash;&ndash; 1961, <em>Faysal al-tafriqa bayna
l-Isl&acirc;m wa-l-zandaqa</em>, S. Duny&acirc; (ed.), Cairo:
&lsquo;&Icirc;s&acirc; al-B&acirc;b&icirc; al-Halab&icirc;.</li>

<li>&ndash;&ndash;&ndash; 1962, <em>al-Iqtis&acirc;d f&icirc;
l-i&rsquo;tiq&acirc;d</em>, I.A. Cubukcu and H. Atay (eds.), Ankara:
Nur Matbaasi.</li>

<li>&ndash;&ndash;&ndash; 1964a, <em>al-Arba&rsquo;&icirc;n f&icirc;
us&ucirc;l al-d&icirc;n</em>, M.M. J&acirc;bir (ed.), Cairo: Maktabat
al-Jund&icirc;.</li>

<li>&ndash;&ndash;&ndash; 1964b <em>Fad&acirc;&rsquo;ih
al-B&acirc;tiniyya wa-fad&acirc;&rsquo;il al-Mustazhiriyya</em>,
&lsquo;A. Badaw&icirc; (ed.), Cairo: D&acirc;r al-Qawmiyya.</li>

<li>&ndash;&ndash;&ndash; 1971, <em>al-Maqsad al-asn&acirc; fi sharh
ma&rsquo;&acirc;n&icirc; asm&acirc;&rsquo; All&acirc;h
al-husn&acirc;</em>, F.A. Shehadi (ed.), Beirut: D&acirc;r
al-Mashriq.</li>

<li>&ndash;&ndash;&ndash; 1985, <em>Ilj&acirc;m al-&lsquo;aw&acirc;mm
&lsquo;an &lsquo;ilm al-kal&acirc;m</em>, M.M. al-Bagh&acirc;d&icirc;
(ed.), Beirut: D&acirc;r al-Kit&acirc;b al-&lsquo;Arab&icirc;.</li>

<li>&ndash;&ndash;&ndash; 1998, <em>The Niche of Lights: A Parallel
English-Arabic Text</em>, D. Buchman (ed. and trans.) Provo (Utah):
Brigham Young University Press.</li>

<li>&ndash;&ndash;&ndash; 2000a, <em>The Incoherence of the
Philosophers / Tah&acirc;fut al-fal&acirc;sifa</em>, <em>a Parallel
English-Arabic Text</em>, M. E. Marmura (ed. and trans.), 2nd. ed.,
Provo (Utah): Brigham Young University Press.</li>

<li>&ndash;&ndash;&ndash; 2000b, <em>Deliverance from Error. Five Key
Texts Including His Spiritual Autobiography al-Munqidh min
al-Dalal</em>, R. McCarthy (trans.), Louisville (Kenn.): Fons
Vitae.</li>

<li>&ndash;&ndash;&ndash; 2001, <em>Faith in Divine Unity and Trust in
Divine Providence</em> [Book 35 of <em>The Revival of Religious
Sciences</em>], D. Burrell (trans.), Louisville (Kenn.): Fons
Vitae.</li>

<li>&ndash;&ndash;&ndash; 2002, <em>On the Boundaries of Theological
Tolerance in Islam: Ab&ucirc; H&acirc;mid
al-Gh&acirc;zal&icirc;&rsquo;s Faysal al-Tafriqa bayna al-Islam wa
al-zandaqa</em>. S.A. Jackson (trans.), Karachi: Oxford University
Press.</li>

<li>Ibn Taymiyya, 1980, <em>Dar&rsquo; ta&rsquo;&acirc;rud
al-&lsquo;aql wa-l-naql</em>, M. Rash&acirc;d S&acirc;lim (ed.), 11
vols., Beirut: D&acirc;r al-Kun&ucirc;z al-Adabiyya.</li>
</ul>

<h3><a name="SecLit">Secondary Literature</a></h3>

<ul class="hanging">

<li>Andani, Khalil, 2017, &ldquo;The Merits of the
<em>B&acirc;tiniyya:</em> Al-Ghaz&acirc;l&icirc;&rsquo;s Appropriation
of Isma&rsquo;ili Cosmology,&rdquo; <em>Journal of Islamic
Studies</em> 29: 181&ndash;229.</li>

<li>al-Akiti, M.A., 2004, &ldquo;The Three Properties of Prophethood
in Certain Works of Avicenna and al-Gaz&acirc;l&icirc;,&rdquo; in
<em>Interpreting Avicenna: Science and Philosophy in Medieval
Islam</em>, J. McGinnis (ed.), Leiden: Brill, pp. 189&ndash;212.</li>

<li>&ndash;&ndash;&ndash; 2009, &ldquo;The Good, the Bad, and the Ugly
of Falsafa: Al-Ghaz&acirc;l&icirc;&rsquo;s Madn&ucirc;n,
Tah&acirc;fut, and Maq&acirc;sid, with Particular Attention to Their
Falsaf&icirc; Treatment of God&rsquo;s Knoweldge of Temporal
Events,&rdquo; in <em>Avicenna and His Legacy: A Golden Age of Science
and Philosophy</em>, Y.T. Langermann (ed.), Turnhout (Bel.): Brepols,
pp. 51&ndash;100.</li>

<li>Alonso, M., 1958, &ldquo;Influencia de Algazel en el mundo
latino,&rdquo; <em>Al-Andalus</em> 23: 371&ndash;80.</li>

<li>B&auml;ck, A., 1992, &ldquo;Avicenna&rsquo;s Conception of
Modalities,&rdquo; <em>Vivarium</em> 30: 217&ndash;55.</li>

<li>Burnett, C., 1994, &ldquo;Magister Iohannes Hispanus: Towards the
Identity of a Toledan Translator,&rdquo; in <em>Comprendre et
ma&icirc;triser la nature au Moyen Age. M&eacute;langes
d&rsquo;histoire des sciences offerts &agrave; Guy Beaujouan</em>,
Geneva/Paris: Librairie Droz/Librairie Champion, pp.
425&ndash;36.</li>

<li>Chertoff, G.B., 1952, <em>The Logical Part of
al-Ghaz&acirc;l&icirc;&rsquo;s Maq&acirc;sid al-Fal&acirc;sifa. In an
Anonymous Hebrew Translation with the Hebrew Commentary of Moses of
Narbonne</em>, PhD Diss. Columbia University, New York.</li>

<li>d&rsquo;Alverny, M.T., 1986, &ldquo;Algazel dans l&rsquo;occident
latin,&rdquo; in <em>Un trait d&rsquo;union entre l&rsquo;orient et
l&rsquo;occident: al-Ghazzali et Ibn Maimoun. Agadir 27&ndash;29 Nov.
1985</em>, Agadir: Academie Royale du Maroc, pp. 125&ndash;46. Reprint
in d&rsquo;Alverny 1994, 3&ndash;24.</li>

<li>&ndash;&ndash;&ndash;&ndash; 1994, <em>La transmission des textes
philosophiques et scientifique au moyen &acirc;ge</em>, C. Burnett
(ed.), Aldershot: Variorum.</li>

<li>Davidson, H.A., 1987, <em>Proofs for Eternity, Creation and the
Existence of God in Medieval Islamic and Jewish Philosophy</em>, New
York: Oxford University Press.</li>

<li>Dutton, B.D., 2001, &ldquo;Al-Ghaz&acirc;l&icirc; on Possibility
and the Critique of Causality,&rdquo; <em>Medieval Philosophy and
Theology</em> 10: 23&ndash;46.</li>

<li>de Smet, D., 1995, <em>La quietude de l&rsquo;intellect.
N&eacute;oplatonisme et gnose isma&eacute;lienne dans l&rsquo;oeuvre
de Ham&icirc;d ad-D&icirc;n al-Kirm&acirc;n&icirc; (Xe/XIe s.)</em>,
Leuven: Peeters.</li>

<li>Eran, A., 2007, &ldquo;Ghaz&acirc;l&icirc;, Abu Hamid Muhammad ibn
Muhammad al-T&ucirc;s&icirc;, al-&rdquo; in <em>Encyclopaedia
Judaica</em>, 2nd ed., F. Skolnik (ed.), 22 vols., Detroit: Macmillan
Reference, vol. 7, pp. 571&ndash;73.</li>

<li>Frank, R.M., 1992, <em>Creation and the Cosmic System:
Al-Ghaz&acirc;l&icirc; &amp; Avicenna</em>, Heidelberg: C.
Winter.</li>

<li>&ndash;&ndash;&ndash; 1994, <em>Al-Ghazali and the Ash&rsquo;arite
School</em>, Durham: Duke University Press.</li>

<li>Garden, K., 2014, <em>The First Islamic Reviver. Ab&ucirc;
H&acirc;mid al-Ghaz&acirc;l&icirc; and His Revival of the Religious
Sciences</em>, New York: Oxford University Press.</li>

<li>Gavison, A., 1748, <em>Sefer &lsquo;Omer ha-Shikhhah</em>.
Livorno: A. Meldola. Reprint Brooklyn (N.Y.): Ch. Reich, 1993.</li>

<li>Gimaret, D., 1980, <em>Th&eacute;ories de l&rsquo;acte humain en
th&eacute;ologie musulmane</em>, Paris: Vrin.</li>

<li>Griffel, F., 2000, <em>Apostasie und Toleranz im Islam. Die
Entwicklung zu al-Gaz&acirc;l&icirc;s Urteil gegen die Philosophen und
die Reaktionen der Philosophen</em>, Leiden: Brill.</li>

<li>&ndash;&ndash;&ndash; 2002, &ldquo;The Relationship Between
Averroes and al-Ghaz&acirc;l&icirc; as it Presents Itself in
Averroes&rsquo; Early writings, Especially in his Commentary on
al-Ghaz&acirc;l&icirc;&rsquo;s <em>al-Mustasf&acirc;</em>,&rdquo; in
<em>Medieval Philosophy and the Classical Tradition in Islam, Judaism,
and Christianity</em>, J. Inglis (ed.), Richmond: Curzon Press, pp.
51&ndash;63.</li>

<li>&ndash;&ndash;&ndash; 2004, &ldquo;Al-Gaz&acirc;l&icirc;&rsquo;s
Concept of Prophecy: The Introduction of Avicennan Psychology into
As&rsquo;arite Theology,&rdquo; <em>Arabic Sciences and
Philosophy</em> 14: 101&ndash;44.</li>

<li>&ndash;&ndash;&ndash; 2005, &ldquo;Taql&icirc;d of the
Philosophers. Al-Ghaz&acirc;l&icirc;&rsquo;s Initial Accusation In the
<em>Tah&acirc;fut</em>&rdquo;, in <em>Ideas, Images, and Methods of
Portrayal. Insights into Arabic Literature and Islam</em>, S.
G&uuml;nther (ed.), Leiden: Brill, pp. 253&ndash;273.</li>

<li>&ndash;&ndash;&ndash; 2006, &ldquo;MS London, British Library Or.
3126: An Unknown Work by al-Ghaz&acirc;l&icirc; on Metaphysics and
Philosophical Theology,&rdquo; <em>Journal of Islamic Studies</em> 17:
1&ndash;42.</li>

<li>&ndash;&ndash;&ndash; 2009, <em>Al-Ghaz&acirc;l&icirc;&rsquo;s
Philosophical Theology</em>, New York: Oxford University Press.</li>

<li>&ndash;&ndash;&ndash; 2015, &ldquo;Al-Ghaz&acirc;l&icirc; at His
Most Rationalist: <em>The Universal Rule for Allegorically
Interpreting Revelation (al-Q&acirc;n&ucirc;n al-Kull&icirc; f&icirc;
t-Ta&rsquo;w&icirc;l)</em>&rdquo;, in <em>Islam and Rationality: The
Impact of al-Ghaz&acirc;l&icirc;. Papers Collected on His 900th
Anniversarym</em> (Volume 1), G. Tamer (ed.), Leiden: Brill, pp.
89&ndash;120.</li>

<li>Hansberger, R., 2011, &ldquo;Plotinus Arabus Rides Again,&rdquo;
<em>Arabic Sciences and Philosophy</em> 21: 57&ndash;84.</li>

<li>Harvey, S., 2001, &ldquo;Why Did Fourtheenth Century Jews Turn to
Alghazali&rsquo;s Account of Natural Science?&rdquo; <em>Jewish
Quarterly Review</em> 91: 359&ndash;76.</li>

<li>&ndash;&ndash;&ndash; 2015, &ldquo;The Changing Image of
al-Ghaz&acirc;l&icirc; in Medieval Jewish Thought,&rdquo; in <em>Islam
and Rationality. The Impact of al-Ghaz&acirc;l&icirc;. Papers
Collected on His 900th Anniversary</em> (Volme 1), G. Tamer (ed.),
Leiden: Brill, pp. 288&ndash;302.</li>

<li>&ndash;&ndash;&ndash; and W.Z. Harvey, 2002, &ldquo;Yakhas&ocirc;
shel Rabbi Hasd&acirc;y Kreskas le-Algaz&acirc;l&icirc; (Rabbi Hasdai
Crescas&rsquo;s Attitude Towards al-Ghaz&acirc;l&icirc;)&rdquo;, in
<em>Ha-Islam we-&#699;Olam&ocirc;t ha-Shez&ucirc;r&icirc;m b&ocirc; /
The Intertwined Worlds of Islam: Essays in Memory of Hava
Lazarus-Yafeh</em>, N. Ilan (ed.), Jerusalem: Ben-Zvi Institute, pp.
191&ndash;210.</li>

<li>Heer, N., 1993, &ldquo;The Priority of Reason in the
Interpretation of Scripture: Ibn Taym&icirc;yah and the
<em>Mutakallim&ucirc;n</em>,&rdquo; in <em>The Literary Heritage of
Classical Islam: Arabic and Islamic Studies in Honor of James A.
Bellamy</em>, M. Mir (ed.), Princeton: Darvin Press, pp.
181&ndash;95.</li>

<li>Hintikka. J., 1973, <em>Time &amp; Necessity: Studies in
Aristotle&rsquo;s Theory of Modalities</em>, Oxford: Clarendon.</li>

<li>Hourani, G.F., 1958, &ldquo;The Dialogue Between al
Ghaz&acirc;l&icirc; and the Philosophers on the Origin of the
World,&rdquo; <em>Muslim World</em> 48: 183&ndash;191,
308&ndash;14.</li>

<li>&ndash;&ndash;&ndash; 1976, &ldquo;Ghaz&acirc;l&icirc; on the
Ethics of Action,&rdquo; <em>Journal of the American Oriental
Society</em>, 96: 69&ndash;88. Reprinted in Hourani 1985, pp.
135&ndash;66.</li>

<li>&ndash;&ndash;&ndash; 1985, <em>Reason and Tradition in Islamic
Ethics</em>, Cambridge: Cambridge University Press.</li>

<li>Janssens, J., 1986, &ldquo;Le <em>D&acirc;nesh-N&acirc;meh</em>
d&rsquo;Ibn S&icirc;n&acirc;: Un text &agrave; revoir?&rdquo;
<em>Bulletin de philosophie m&eacute;di&eacute;vale</em> 28:
163&ndash;77.</li>

<li>&ndash;&ndash;&ndash; 2003, &ldquo;Al-Ghazz&acirc;l&icirc; and his
Use of Avicennian Texts,&rdquo; in <em>Problems in Arabic
Philosophy</em>, M. Mar&oacute;th (ed.), Piliscaba (Hungary): Avicenna
Institute of Middle East Studies, pp. 37&ndash;49.</li>

<li>Knuuttila, S., 1998, &ldquo;Plentitude, Reason and Value: Old and
New in the Metaphyscis of Nature,&rdquo; in <em>Nature and Lifeworld:
Theoretical and Practical Metaphysics</em>, C. Bengt-Pedersen and N.
Thomassen (eds.), Odense (Denmark): Odense University Press, pp.
139&ndash;51.</li>

<li>Kukkonen, T., 2000, &ldquo;Possible Worlds in the
<em>Tah&acirc;fut al-Fal&acirc;sifa</em>: Al-Ghaz&acirc;l&icirc; on
Creation and Contingency,&rdquo; <em>Journal of the History of
Philosophy</em> 38: 479&ndash;502.</li>

<li>Langermann, Y.T., 2011, &ldquo;The &rsquo;Hebrew Ajwiba&rsquo;
Ascribed to al-Ghaz&acirc;l&icirc;: Corpus, Conspectus, and
Context,&rdquo; <em>The Muslim World</em> 101: 680&ndash;97.</li>

<li>Lohr, C.H., 1965, &ldquo;Logica Algazelis: Introduction and
Critical Text,&rdquo; <em>Traditio</em> 21: 223&ndash;90.</li>

<li>Madelung, W., 1974, &ldquo;Ar-R&acirc;gib al-Isfah&acirc;n&icirc;
und die Ethik al-Gaz&acirc;l&icirc;s,&rdquo; in <em>Islamkundliche
Abhandlungen: Fritz Meier zum sechzigsten Geburtstag</em>. R. Gramlich
(ed.), Wiesbaden: Steiner, pp. 152&ndash;63.</li>

<li>Marmura, M.E., 1959, &ldquo;The Logical Role of the Argument from
Time in the Tah&acirc;fut&rsquo;s Second Proof for the World&rsquo;s
Pre-Eternity,&rdquo; <em>Muslim World</em> 49: 306&ndash;14. Reprinted
in Marmura 2005, pp. 219&ndash;27.</li>

<li>&ndash;&ndash;&ndash; 1965, &ldquo;Ghaz&acirc;l&icirc; and
Demonstrative Science,&rdquo; <em>Journal of the History of
Philosophy</em> 3: 183&ndash;204. Reprinted in Marmura 2005, pp.
231&ndash;60.</li>

<li>&ndash;&ndash;&ndash; 1968&ndash;69, &ldquo;Ghaz&acirc;l&icirc; on
Ethical Premises,&rdquo; <em>The Philosophical Forum</em> 4:
393&ndash;403. Reprinted in Marmura 2005, pp. 261&ndash;65.</li>

<li>&ndash;&ndash;&ndash; 1981, &ldquo;Al-Ghaz&acirc;l&icirc;&rsquo;s
Second Causal Theory in the 17th Discussion of His
Tah&acirc;fut,&rdquo; in <em>Islamic Philosophy and Mysticism</em>, P.
Morewedge (ed.), Delmar (N.Y.): Caravan Books, pp. 85&ndash;112.</li>

<li>&ndash;&ndash;&ndash; 1995, &ldquo;Ghaz&acirc;lian Causes and
Intermediaries,&rdquo; <em>Journal of the American Oriental
Society</em> 115: 89&ndash;100.</li>

<li>&ndash;&ndash;&ndash; 2005, <em>Probing in Islamic
Philosophy</em>, Binghampton (N.Y.): Global Academic Publishing.</li>

<li>Marx, A., 1935, &ldquo;Texts by and About Maimonides,&rdquo;
<em>Jewish Quarterly Review</em> 25: 371&ndash;428.</li>

<li>Minnema, A.H. 2014, &ldquo;Algazel Latinus: The Audience of the
<em>Summa Theoricae Philosophiae</em>, 1150&ndash;1600,&rdquo;
<em>Traditio</em>, 69: 153&ndash;213.</li>

<li>Opwis, F., 2007, &ldquo;Islamic Law and Legal Change: The Concept
of <em>Maslaha</em> in Classical and Contemporary Legal Theory&rdquo;,
in <em>Shari&rsquo;a: Islamic Law in the Contemporary Context</em>, A.
Amanat and F. Griffel (eds.), Stanford (Calif.): Stanford University
Press, pp. 62&ndash;82, 203&ndash;07.</li>

<li>&ndash;&ndash;&ndash; 2010, <em>Maslaha and the Purpose of the
Law: Islamic Discourse on Legal Change from the 4th/10th to 8th/14th
century</em>, Leiden: Brill.</li>

<li>Ormsby, E.L., 1984, <em>Theodicy in Islamic Thought. The Dispute
over al-Ghaz&acirc;l&icirc;&rsquo;s &lsquo;Best of All Possible
Worlds&rsquo;</em>, Princeton: Princeton University Press.</li>

<li>Pourjavady, N. (ed.), 2002, <em>Majm&ucirc;&rsquo;ah-ye
falsaf&icirc;-e Mar&acirc;ghah: A Philosophical Anthology from
Maraghah. Containing Works by Ab&ucirc; H&acirc;mid
Ghazz&acirc;l&icirc;, &lsquo;Ayn al-Qud&acirc;t
al-Hamad&acirc;n&icirc;, Ibn S&icirc;n&acirc;, &lsquo;Umar ibn
Sahl&acirc;n S&acirc;vi, Majdudd&icirc;n J&icirc;l&icirc; and
others</em>, Tehran: Markaz-i Nashr-i D&acirc;nishg&acirc;h.</li>

<li>Perler, D. and U. Rudolph, 2000, <em>Occasionalismus: Theorien der
Kausalit&auml;t im arabisch-islamischen und im europ&auml;ischen
Denken</em>, G&ouml;ttingen: Vandenhoeck &amp; Ruprecht.</li>

<li>Salman, D., 1935, &ldquo;Algazel et les latins,&rdquo;
<em>Archives d&rsquo;histoire doctrinale et litteraire du moyen
age</em> 10: 103&ndash;127.</li>

<li>Sabra, A.I., 1987, &ldquo;The Appropriation and Subsequent
Naturalization of Greek Sciences in Medieval Islam: A Preliminary
Statement,&rdquo; <em>History of Science</em> 25: 223&ndash;43.</li>

<li>Shihadeh, A., 2011, &ldquo;New Light on the Reception of
al-Ghaz&acirc;l&icirc;&rsquo;s Doctrines of the Philosophers
(Maq&acirc;sid al-Fal&acirc;sifa),&rdquo; in <em>In the Age of
Averroes: Arabic Philosophy in the Sixth/Twelfth Century</em>. P.
Adamson (ed.), London/Turin: Warburg Institute/Nino Aragno, pp.
77&ndash;92.</li>

<li>Steinschneider, M., 1893, <em>Die hebraeischen &Uuml;bersetzer des
Mittelalters und die Juden als Dolmetscher</em>, 2 vols., Berlin:
Kommissionsverlag des Bibliographischen Bureaus. Reprint Graz:
Akademische Druck- und Verlagsanstalt, 1956.</li>

<li>Treiger, A., 2012, <em>Inspired Knowledge in Islamic Thought.
Al-Ghaz&acirc;l&icirc;&rsquo;s Theory of Mystical Cognition and its
Avicennian Foundation</em>, London and New York: Routledge.</li>

<li>Vajda, G., 1960, <em>Isaac Albalag, averro&iuml;ste juif,
traducteaur et annotateur d&rsquo;al-Ghaz&acirc;l&icirc;</em>, Paris:
J. Vrin.</li>

<li>Walker, P., 1993, <em>Early Philosophical Shiism. The Ismaili
Neoplatonism of Ab&ucirc; Ya&rsquo;q&ucirc;b
al-Sijist&acirc;n&icirc;</em>, Cambridge: Cambridge University
Press.</li>

<li>Wisnovsky, R., 2003, <em>Avicenna&rsquo;s Metaphysics in
Context</em>, London: Duckworth.</li>
</ul>
</div> 
<div id="academic-tools">

<h2 id="Aca">Academic Tools</h2>

<blockquote>
<table class="vert-top">
<tr>
<td><img src="../../symbols/sepman-icon.jpg" alt="sep man icon" /></td>
<td><a href="https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=al-ghazali" target="other">How to cite this entry</a>.</td>
</tr>

<tr>
<td><img src="../../symbols/sepman-icon.jpg" alt="sep man icon" /></td>
<td><a href="https://leibniz.stanford.edu/friends/preview/al-ghazali/" target="other">Preview the PDF version of this entry</a> at the
 <a href="https://leibniz.stanford.edu/friends/" target="other">Friends of the SEP Society</a>.</td>
</tr>

<tr>
<td><img src="../../symbols/inpho.png" alt="inpho icon" /></td>
<td><a href="https://www.inphoproject.org/entity?sep=al-ghazali&amp;redirect=True" target="other">Look up topics and thinkers related to this entry</a>
 at the Internet Philosophy Ontology Project (InPhO).</td>
</tr>

<tr>
<td><img src="../../symbols/pp.gif" alt="phil papers icon" /></td>
<td><a href="https://philpapers.org/sep/al-ghazali/" target="other">Enhanced bibliography for this entry</a>
at <a href="https://philpapers.org/" target="other">PhilPapers</a>, with links to its database.</td>
</tr>

</table>
</blockquote>

</div>

<div id="other-internet-resources">

<h2><a name="Oth">Other Internet Resources</a></h2>

<ul>

 <li><a href="http://www.ghazali.org/" target="other">Abu Hamid al-Ghazali</a>,
 site maintained by Muhammad Hozien</li>
</ul>
</div>

<div id="related-entries">

<h2><a name="Rel">Related Entries</a></h2>

<p>

 <a href="../al-farabi/index.html">al-Farabi</a> |
 <a href="../arabic-islamic-natural/index.html">Arabic and Islamic Philosophy, disciplines in: natural philosophy and natural science</a> |
 <a href="../causation-medieval/index.html">causation: medieval theories of</a> |
 <a href="../duns-scotus/index.html">Duns Scotus, John</a> |
 <a href="../medieval-futcont/index.html">future contingents: medieval theories of</a> |
 <a href="../ibn-rushd/index.html">Ibn Rushd [Averroes]</a> |
 <a href="../ibn-sina/index.html">Ibn Sina [Avicenna]</a> |
 <a href="../maimonides-islamic/index.html">Maimonides: the influence of Islamic thought on</a> |
 <a href="../modality-medieval/index.html">modality: medieval theories of</a> |
 <a href="../philoponus/index.html">Philoponus</a>

</p>

</div> 

</div><!-- #aueditable --><!--DO NOT MODIFY THIS LINE AND BELOW-->

<!-- END ARTICLE HTML -->

</div> <!-- End article-content -->

  <div id="article-copyright">
    <p>
 <a href="../../info.html#c">Copyright &copy; 2020</a> by

<br />
Frank Griffel
&lt;<a href="m&#97;ilto:frank&#37;2egriffel&#37;40yale&#37;2eedu"><em>frank<abbr title=" dot ">&#46;</abbr>griffel<abbr title=" at ">&#64;</abbr>yale<abbr title=" dot ">&#46;</abbr>edu</em></a>&gt;
    </p>
  </div>

</div> <!-- End article -->

<!-- NOTE: article banner is outside of the id="article" div. -->
<div id="article-banner" class="scroll-block">
  <div id="article-banner-content">
    <a href="../../fundraising/index.html">
    Open access to the SEP is made possible by a world-wide funding initiative.<br />
    The Encyclopedia Now Needs Your Support<br />
    Please Read How You Can Help Keep the Encyclopedia Free</a>
  </div>
</div> <!-- End article-banner -->

    </div> <!-- End content -->

    <div id="footer">

      <div id="footer-menu">
        <div class="menu-block">
          <h4><i class="icon-book"></i> Browse</h4>
          <ul role="menu">
            <li><a href="../../contents.html">Table of Contents</a></li>
            <li><a href="../../new.html">What's New</a></li>
            <li><a href="https://plato.stanford.edu/cgi-bin/encyclopedia/random">Random Entry</a></li>
            <li><a href="../../published.html">Chronological</a></li>
            <li><a href="../../archives/index.html">Archives</a></li>
          </ul>
        </div>
        <div class="menu-block">
          <h4><i class="icon-info-sign"></i> About</h4>
          <ul role="menu">
            <li><a href="../../info.html">Editorial Information</a></li>
            <li><a href="../../about.html">About the SEP</a></li>
            <li><a href="../../board.html">Editorial Board</a></li>
            <li><a href="../../cite.html">How to Cite the SEP</a></li>
            <li><a href="../../special-characters.html">Special Characters</a></li>
            <li><a href="../../tools/index.html">Advanced Tools</a></li>
            <li><a href="../../contact.html">Contact</a></li>
          </ul>
        </div>
        <div class="menu-block">
          <h4><i class="icon-leaf"></i> Support SEP</h4>
          <ul role="menu">
            <li><a href="../../support/index.html">Support the SEP</a></li>
            <li><a href="../../support/friends.html">PDFs for SEP Friends</a></li>
            <li><a href="../../support/donate.html">Make a Donation</a></li>
            <li><a href="../../support/sepia.html">SEPIA for Libraries</a></li>
          </ul>
        </div>
      </div> <!-- End footer menu -->

      <div id="mirrors">
        <div id="mirror-info">
          <h4><i class="icon-globe"></i> Mirror Sites</h4>
          <p>View this site from another server:</p>
        </div>
        <div class="btn-group open">
          <a class="btn dropdown-toggle" data-toggle="dropdown" href="https://plato.stanford.edu/">
            <span class="flag flag-usa"></span> USA (Main Site) <span class="caret"></span>
            <span class="mirror-source">Philosophy, Stanford University</span>
          </a>
          <ul class="dropdown-menu">
            <li><a href="../../mirrors.html">Info about mirror sites</a></li>
          </ul>
        </div>
      </div> <!-- End mirrors -->
      
      <div id="site-credits">
        <p>The Stanford Encyclopedia of Philosophy is <a href="../../info.html#c">copyright &copy; 2021</a> by <a href="http://mally.stanford.edu/">The Metaphysics Research Lab</a>, Department of Philosophy, Stanford University</p>
        <p>Library of Congress Catalog Data: ISSN 1095-5054</p>
      </div> <!-- End site credits -->

    </div> <!-- End footer -->

  </div> <!-- End container -->

   <!-- NOTE: Script required for drop-down button to work (mirrors). -->
  <script>
    $('.dropdown-toggle').dropdown();
  </script>

</body>

<!-- Mirrored from seop.illc.uva.nl/entries/al-ghazali/ by HTTrack Website Copier/3.x [XR&CO'2014], Wed, 22 Jun 2022 19:37:28 GMT -->
</html>
